P6_s = Parameter((2,2))

objective6_s = (Array{Sym,2}(ones(1,1)),Array{Sym,1}([1.0]))
constraints6_s=Array{Sym}(undef,4)
constraints6_s[1] = -3*γ1 - 3*γ2 + 1
constraints6_s[2] = -108*α1^2*γ1 + 72*α1*γ1 - 108*α2^2*γ2 + 72*α2*γ2 - 12*γ1 - 12*γ2 + 1
constraints6_s[3] =  810*α1^3*γ1 - 810*α1^2*γ1 + 270*α1*γ1 + 810*α2^3*γ2 - 810*α2^2*γ2 + 270*α2*γ2 - 30*γ1 - 30*γ2 + 1
constraints6_s[4] =  -2430*α1^4*γ1 + 3240*α1^3*γ1 - 1620*α1^2*γ1 + 360*α1*γ1 - 2430*α2^4*γ2 + 3240*α2^3*γ2 - 1620*α2^2*γ2 + 360*α2*γ2 - 30*γ1 - 30*γ2 + 1

init6_s = [0.154700538379252, 0.422649730810374, 1/6, 1/6]

P6_model_s = OptModel(objective6_s, constraints6_s, init6_s, P6_s)