function objective(α1, α2, α3, α4, α5, γ1, γ2, γ3, γ4)
    1.0
end

function objective_grad1(α1, α2, α3, α4, α5, γ1, γ2, γ3, γ4)
    0
end

function objective_grad2(α1, α2, α3, α4, α5, γ1, γ2, γ3, γ4)
    0
end

function objective_grad3(α1, α2, α3, α4, α5, γ1, γ2, γ3, γ4)
    0
end

function objective_grad4(α1, α2, α3, α4, α5, γ1, γ2, γ3, γ4)
    0
end

function objective_grad5(α1, α2, α3, α4, α5, γ1, γ2, γ3, γ4)
    0
end

function objective_grad6(α1, α2, α3, α4, α5, γ1, γ2, γ3, γ4)
    0
end

function objective_grad7(α1, α2, α3, α4, α5, γ1, γ2, γ3, γ4)
    0
end

function objective_grad8(α1, α2, α3, α4, α5, γ1, γ2, γ3, γ4)
    0
end

function objective_grad9(α1, α2, α3, α4, α5, γ1, γ2, γ3, γ4)
    0
end

objective_grad = [objective_grad1,objective_grad2,objective_grad3,objective_grad4,objective_grad5,objective_grad6,objective_grad7,objective_grad8,objective_grad9]

function constraint1(α1, α2, α3, α4, α5, γ1, γ2, γ3, γ4)
    (((-4γ1 - 4γ2) - 4γ3) - 12γ4) + 1
end

function constraint1_grad1(α1, α2, α3, α4, α5, γ1, γ2, γ3, γ4)
    0
end

function constraint1_grad2(α1, α2, α3, α4, α5, γ1, γ2, γ3, γ4)
    0
end

function constraint1_grad3(α1, α2, α3, α4, α5, γ1, γ2, γ3, γ4)
    0
end

function constraint1_grad4(α1, α2, α3, α4, α5, γ1, γ2, γ3, γ4)
    0
end

function constraint1_grad5(α1, α2, α3, α4, α5, γ1, γ2, γ3, γ4)
    0
end

function constraint1_grad6(α1, α2, α3, α4, α5, γ1, γ2, γ3, γ4)
    -4
end

function constraint1_grad7(α1, α2, α3, α4, α5, γ1, γ2, γ3, γ4)
    -4
end

function constraint1_grad8(α1, α2, α3, α4, α5, γ1, γ2, γ3, γ4)
    -4
end

function constraint1_grad9(α1, α2, α3, α4, α5, γ1, γ2, γ3, γ4)
    -12
end

constraint1_grad = [constraint1_grad1,constraint1_grad2,constraint1_grad3,constraint1_grad4,constraint1_grad5,constraint1_grad6,constraint1_grad7,constraint1_grad8,constraint1_grad9]

function constraint2(α1, α2, α3, α4, α5, γ1, γ2, γ3, γ4)
    (((((((((((((((-320 * α1 .^ 2) .* γ1 + (160α1) .* γ1) - (320 * α2 .^ 2) .* γ2) + (160α2) .* γ2) - (320 * α3 .^ 2) .* γ3) + (160α3) .* γ3) - (480 * α4 .^ 2) .* γ4) - ((320α4) .* α5) .* γ4) + (320α4) .* γ4) - (160 * α5 .^ 2) .* γ4) + (160α5) .* γ4) - 20γ1) - 20γ2) - 20γ3) - 60γ4) + 1
end

function constraint2_grad1(α1, α2, α3, α4, α5, γ1, γ2, γ3, γ4)
    (-640α1) .* γ1 + 160γ1
end

function constraint2_grad2(α1, α2, α3, α4, α5, γ1, γ2, γ3, γ4)
    (-640α2) .* γ2 + 160γ2
end

function constraint2_grad3(α1, α2, α3, α4, α5, γ1, γ2, γ3, γ4)
    (-640α3) .* γ3 + 160γ3
end

function constraint2_grad4(α1, α2, α3, α4, α5, γ1, γ2, γ3, γ4)
    ((-960α4) .* γ4 - (320α5) .* γ4) + 320γ4
end

function constraint2_grad5(α1, α2, α3, α4, α5, γ1, γ2, γ3, γ4)
    ((-320α4) .* γ4 - (320α5) .* γ4) + 160γ4
end

function constraint2_grad6(α1, α2, α3, α4, α5, γ1, γ2, γ3, γ4)
    (-320 * α1 .^ 2 + 160α1) - 20
end

function constraint2_grad7(α1, α2, α3, α4, α5, γ1, γ2, γ3, γ4)
    (-320 * α2 .^ 2 + 160α2) - 20
end

function constraint2_grad8(α1, α2, α3, α4, α5, γ1, γ2, γ3, γ4)
    (-320 * α3 .^ 2 + 160α3) - 20
end

function constraint2_grad9(α1, α2, α3, α4, α5, γ1, γ2, γ3, γ4)
    ((((-480 * α4 .^ 2 - (320α4) .* α5) + 320α4) - 160 * α5 .^ 2) + 160α5) - 60
end

constraint2_grad = [constraint2_grad1,constraint2_grad2,constraint2_grad3,constraint2_grad4,constraint2_grad5,constraint2_grad6,constraint2_grad7,constraint2_grad8,constraint2_grad9]

function constraint3(α1, α2, α3, α4, α5, γ1, γ2, γ3, γ4)
    (((((((((((((((((3840 * α1 .^ 3) .* γ1 - (2880 * α1 .^ 2) .* γ1) + (720α1) .* γ1 + (3840 * α2 .^ 3) .* γ2) - (2880 * α2 .^ 2) .* γ2) + (720α2) .* γ2 + (3840 * α3 .^ 3) .* γ3) - (2880 * α3 .^ 2) .* γ3) + (720α3) .* γ3 + (2880 * α4 .^ 3) .* γ4 + ((5760 * α4 .^ 2) .* α5) .* γ4) - (3600 * α4 .^ 2) .* γ4) + ((2880α4) .* α5 .^ 2) .* γ4) - ((4320α4) .* α5) .* γ4) + (1440α4) .* γ4) - (720 * α5 .^ 2) .* γ4) + (720α5) .* γ4) - 60γ1) - 60γ2) - 60γ3) - 180γ4) + 1
end

function constraint3_grad1(α1, α2, α3, α4, α5, γ1, γ2, γ3, γ4)
    ((11520 * α1 .^ 2) .* γ1 - (5760α1) .* γ1) + 720γ1
end

function constraint3_grad2(α1, α2, α3, α4, α5, γ1, γ2, γ3, γ4)
    ((11520 * α2 .^ 2) .* γ2 - (5760α2) .* γ2) + 720γ2
end

function constraint3_grad3(α1, α2, α3, α4, α5, γ1, γ2, γ3, γ4)
    ((11520 * α3 .^ 2) .* γ3 - (5760α3) .* γ3) + 720γ3
end

function constraint3_grad4(α1, α2, α3, α4, α5, γ1, γ2, γ3, γ4)
    (((((8640 * α4 .^ 2) .* γ4 + ((11520α4) .* α5) .* γ4) - (7200α4) .* γ4) + (2880 * α5 .^ 2) .* γ4) - (4320α5) .* γ4) + 1440γ4
end

function constraint3_grad5(α1, α2, α3, α4, α5, γ1, γ2, γ3, γ4)
    ((((5760 * α4 .^ 2) .* γ4 + ((5760α4) .* α5) .* γ4) - (4320α4) .* γ4) - (1440α5) .* γ4) + 720γ4
end

function constraint3_grad6(α1, α2, α3, α4, α5, γ1, γ2, γ3, γ4)
    ((3840 * α1 .^ 3 - 2880 * α1 .^ 2) + 720α1) - 60
end

function constraint3_grad7(α1, α2, α3, α4, α5, γ1, γ2, γ3, γ4)
    ((3840 * α2 .^ 3 - 2880 * α2 .^ 2) + 720α2) - 60
end

function constraint3_grad8(α1, α2, α3, α4, α5, γ1, γ2, γ3, γ4)
    ((3840 * α3 .^ 3 - 2880 * α3 .^ 2) + 720α3) - 60
end

function constraint3_grad9(α1, α2, α3, α4, α5, γ1, γ2, γ3, γ4)
    (((((((2880 * α4 .^ 3 + (5760 * α4 .^ 2) .* α5) - 3600 * α4 .^ 2) + (2880α4) .* α5 .^ 2) - (4320α4) .* α5) + 1440α4) - 720 * α5 .^ 2) + 720α5) - 180
end

constraint3_grad = [constraint3_grad1,constraint3_grad2,constraint3_grad3,constraint3_grad4,constraint3_grad5,constraint3_grad6,constraint3_grad7,constraint3_grad8,constraint3_grad9]

function constraint4(α1, α2, α3, α4, α5, γ1, γ2, γ3, γ4)
    (((((((((-15120 * α4 .^ 4) .* γ4 + ((20160 * α4 .^ 3) .* α5) .* γ4 + (10080 * α4 .^ 3) .* γ4 + ((3360 * α4 .^ 2) .* α5 .^ 2) .* γ4) - ((16800 * α4 .^ 2) .* α5) .* γ4) - (1680 * α4 .^ 2) .* γ4) - ((6720α4) .* α5 .^ 3) .* γ4) + ((3360α4) .* α5 .^ 2) .* γ4 + ((3360α4) .* α5) .* γ4) - (1680 * α5 .^ 4) .* γ4) + (3360 * α5 .^ 3) .* γ4) - (1680 * α5 .^ 2) .* γ4) + 1
end

function constraint4_grad1(α1, α2, α3, α4, α5, γ1, γ2, γ3, γ4)
    0
end

function constraint4_grad2(α1, α2, α3, α4, α5, γ1, γ2, γ3, γ4)
    0
end

function constraint4_grad3(α1, α2, α3, α4, α5, γ1, γ2, γ3, γ4)
    0
end

function constraint4_grad4(α1, α2, α3, α4, α5, γ1, γ2, γ3, γ4)
    (((((-60480 * α4 .^ 3) .* γ4 + ((60480 * α4 .^ 2) .* α5) .* γ4 + (30240 * α4 .^ 2) .* γ4 + ((6720α4) .* α5 .^ 2) .* γ4) - ((33600α4) .* α5) .* γ4) - (3360α4) .* γ4) - (6720 * α5 .^ 3) .* γ4) + (3360 * α5 .^ 2) .* γ4 + (3360α5) .* γ4
end

function constraint4_grad5(α1, α2, α3, α4, α5, γ1, γ2, γ3, γ4)
    (((((((20160 * α4 .^ 3) .* γ4 + ((6720 * α4 .^ 2) .* α5) .* γ4) - (16800 * α4 .^ 2) .* γ4) - ((20160α4) .* α5 .^ 2) .* γ4) + ((6720α4) .* α5) .* γ4 + (3360α4) .* γ4) - (6720 * α5 .^ 3) .* γ4) + (10080 * α5 .^ 2) .* γ4) - (3360α5) .* γ4
end

function constraint4_grad6(α1, α2, α3, α4, α5, γ1, γ2, γ3, γ4)
    0
end

function constraint4_grad7(α1, α2, α3, α4, α5, γ1, γ2, γ3, γ4)
    0
end

function constraint4_grad8(α1, α2, α3, α4, α5, γ1, γ2, γ3, γ4)
    0
end

function constraint4_grad9(α1, α2, α3, α4, α5, γ1, γ2, γ3, γ4)
    (((((((-15120 * α4 .^ 4 + (20160 * α4 .^ 3) .* α5 + 10080 * α4 .^ 3 + (3360 * α4 .^ 2) .* α5 .^ 2) - (16800 * α4 .^ 2) .* α5) - 1680 * α4 .^ 2) - (6720α4) .* α5 .^ 3) + (3360α4) .* α5 .^ 2 + (3360α4) .* α5) - 1680 * α5 .^ 4) + 3360 * α5 .^ 3) - 1680 * α5 .^ 2
end

constraint4_grad = [constraint4_grad1,constraint4_grad2,constraint4_grad3,constraint4_grad4,constraint4_grad5,constraint4_grad6,constraint4_grad7,constraint4_grad8,constraint4_grad9]

function constraint5(α1, α2, α3, α4, α5, γ1, γ2, γ3, γ4)
    (((((((((((((((((((((((((256 * α1 .^ 4) .* γ1 - (256 * α1 .^ 3) .* γ1) + (96 * α1 .^ 2) .* γ1) - (16α1) .* γ1) + (256 * α2 .^ 4) .* γ2) - (256 * α2 .^ 3) .* γ2) + (96 * α2 .^ 2) .* γ2) - (16α2) .* γ2) + (256 * α3 .^ 4) .* γ3) - (256 * α3 .^ 3) .* γ3) + (96 * α3 .^ 2) .* γ3) - (16α3) .* γ3) - (36 * α4 .^ 4) .* γ4) + ((560 * α4 .^ 3) .* α5) .* γ4) - (104 * α4 .^ 3) .* γ4) + ((264 * α4 .^ 2) .* α5 .^ 2) .* γ4) - ((552 * α4 .^ 2) .* α5) .* γ4) + (108 * α4 .^ 2) .* γ4) - ((16α4) .* α5 .^ 3) .* γ4) - ((120α4) .* α5 .^ 2) .* γ4) + ((168α4) .* α5) .* γ4) - (32α4) .* γ4) - (4 * α5 .^ 4) .* γ4) + (8 * α5 .^ 3) .* γ4 + (12 * α5 .^ 2) .* γ4) - (16α5) .* γ4) + γ1 + γ2 + γ3 + 3γ4
end

function constraint5_grad1(α1, α2, α3, α4, α5, γ1, γ2, γ3, γ4)
    (((1024 * α1 .^ 3) .* γ1 - (768 * α1 .^ 2) .* γ1) + (192α1) .* γ1) - 16γ1
end

function constraint5_grad2(α1, α2, α3, α4, α5, γ1, γ2, γ3, γ4)
    (((1024 * α2 .^ 3) .* γ2 - (768 * α2 .^ 2) .* γ2) + (192α2) .* γ2) - 16γ2
end

function constraint5_grad3(α1, α2, α3, α4, α5, γ1, γ2, γ3, γ4)
    (((1024 * α3 .^ 3) .* γ3 - (768 * α3 .^ 2) .* γ3) + (192α3) .* γ3) - 16γ3
end

function constraint5_grad4(α1, α2, α3, α4, α5, γ1, γ2, γ3, γ4)
    (((((((((-144 * α4 .^ 3) .* γ4 + ((1680 * α4 .^ 2) .* α5) .* γ4) - (312 * α4 .^ 2) .* γ4) + ((528α4) .* α5 .^ 2) .* γ4) - ((1104α4) .* α5) .* γ4) + (216α4) .* γ4) - (16 * α5 .^ 3) .* γ4) - (120 * α5 .^ 2) .* γ4) + (168α5) .* γ4) - 32γ4
end

function constraint5_grad5(α1, α2, α3, α4, α5, γ1, γ2, γ3, γ4)
    ((((((((560 * α4 .^ 3) .* γ4 + ((528 * α4 .^ 2) .* α5) .* γ4) - (552 * α4 .^ 2) .* γ4) - ((48α4) .* α5 .^ 2) .* γ4) - ((240α4) .* α5) .* γ4) + (168α4) .* γ4) - (16 * α5 .^ 3) .* γ4) + (24 * α5 .^ 2) .* γ4 + (24α5) .* γ4) - 16γ4
end

function constraint5_grad6(α1, α2, α3, α4, α5, γ1, γ2, γ3, γ4)
    (((256 * α1 .^ 4 - 256 * α1 .^ 3) + 96 * α1 .^ 2) - 16α1) + 1
end

function constraint5_grad7(α1, α2, α3, α4, α5, γ1, γ2, γ3, γ4)
    (((256 * α2 .^ 4 - 256 * α2 .^ 3) + 96 * α2 .^ 2) - 16α2) + 1
end

function constraint5_grad8(α1, α2, α3, α4, α5, γ1, γ2, γ3, γ4)
    (((256 * α3 .^ 4 - 256 * α3 .^ 3) + 96 * α3 .^ 2) - 16α3) + 1
end

function constraint5_grad9(α1, α2, α3, α4, α5, γ1, γ2, γ3, γ4)
    ((((((((((((-36 * α4 .^ 4 + (560 * α4 .^ 3) .* α5) - 104 * α4 .^ 3) + (264 * α4 .^ 2) .* α5 .^ 2) - (552 * α4 .^ 2) .* α5) + 108 * α4 .^ 2) - (16α4) .* α5 .^ 3) - (120α4) .* α5 .^ 2) + (168α4) .* α5) - 32α4) - 4 * α5 .^ 4) + 8 * α5 .^ 3 + 12 * α5 .^ 2) - 16α5) + 3
end

constraint5_grad = [constraint5_grad1,constraint5_grad2,constraint5_grad3,constraint5_grad4,constraint5_grad5,constraint5_grad6,constraint5_grad7,constraint5_grad8,constraint5_grad9]

function constraint6(α1, α2, α3, α4, α5, γ1, γ2, γ3, γ4)
    (((((((((((((((((((((((((((((((((143360 * α1 .^ 5) .* γ1 - (179200 * α1 .^ 4) .* γ1) + (89600 * α1 .^ 3) .* γ1) - (22400 * α1 .^ 2) .* γ1) + (2800α1) .* γ1 + (143360 * α2 .^ 5) .* γ2) - (179200 * α2 .^ 4) .* γ2) + (89600 * α2 .^ 3) .* γ2) - (22400 * α2 .^ 2) .* γ2) + (2800α2) .* γ2 + (143360 * α3 .^ 5) .* γ3) - (179200 * α3 .^ 4) .* γ3) + (89600 * α3 .^ 3) .* γ3) - (22400 * α3 .^ 2) .* γ3) + (2800α3) .* γ3 + (53760 * α4 .^ 5) .* γ4 + ((143360 * α4 .^ 4) .* α5) .* γ4) - (103040 * α4 .^ 4) .* γ4) + ((143360 * α4 .^ 3) .* α5 .^ 2) .* γ4) - ((215040 * α4 .^ 3) .* α5) .* γ4) + (78400 * α4 .^ 3) .* γ4 + ((71680 * α4 .^ 2) .* α5 .^ 3) .* γ4) - ((161280 * α4 .^ 2) .* α5 .^ 2) .* γ4) + ((120960 * α4 .^ 2) .* α5) .* γ4) - (29680 * α4 .^ 2) .* γ4) + ((17920α4) .* α5 .^ 4) .* γ4) - ((53760α4) .* α5 .^ 3) .* γ4) + ((60480α4) .* α5 .^ 2) .* γ4) - ((30240α4) .* α5) .* γ4) + (5600α4) .* γ4) - (4480 * α5 .^ 4) .* γ4) + (8960 * α5 .^ 3) .* γ4) - (7280 * α5 .^ 2) .* γ4) + (2800α5) .* γ4) - 140γ1) - 140γ2) - 140γ3) - 420γ4) + 1
end

function constraint6_grad1(α1, α2, α3, α4, α5, γ1, γ2, γ3, γ4)
    ((((716800 * α1 .^ 4) .* γ1 - (716800 * α1 .^ 3) .* γ1) + (268800 * α1 .^ 2) .* γ1) - (44800α1) .* γ1) + 2800γ1
end

function constraint6_grad2(α1, α2, α3, α4, α5, γ1, γ2, γ3, γ4)
    ((((716800 * α2 .^ 4) .* γ2 - (716800 * α2 .^ 3) .* γ2) + (268800 * α2 .^ 2) .* γ2) - (44800α2) .* γ2) + 2800γ2
end

function constraint6_grad3(α1, α2, α3, α4, α5, γ1, γ2, γ3, γ4)
    ((((716800 * α3 .^ 4) .* γ3 - (716800 * α3 .^ 3) .* γ3) + (268800 * α3 .^ 2) .* γ3) - (44800α3) .* γ3) + 2800γ3
end

function constraint6_grad4(α1, α2, α3, α4, α5, γ1, γ2, γ3, γ4)
    (((((((((((((268800 * α4 .^ 4) .* γ4 + ((573440 * α4 .^ 3) .* α5) .* γ4) - (412160 * α4 .^ 3) .* γ4) + ((430080 * α4 .^ 2) .* α5 .^ 2) .* γ4) - ((645120 * α4 .^ 2) .* α5) .* γ4) + (235200 * α4 .^ 2) .* γ4 + ((143360α4) .* α5 .^ 3) .* γ4) - ((322560α4) .* α5 .^ 2) .* γ4) + ((241920α4) .* α5) .* γ4) - (59360α4) .* γ4) + (17920 * α5 .^ 4) .* γ4) - (53760 * α5 .^ 3) .* γ4) + (60480 * α5 .^ 2) .* γ4) - (30240α5) .* γ4) + 5600γ4
end

function constraint6_grad5(α1, α2, α3, α4, α5, γ1, γ2, γ3, γ4)
    ((((((((((((143360 * α4 .^ 4) .* γ4 + ((286720 * α4 .^ 3) .* α5) .* γ4) - (215040 * α4 .^ 3) .* γ4) + ((215040 * α4 .^ 2) .* α5 .^ 2) .* γ4) - ((322560 * α4 .^ 2) .* α5) .* γ4) + (120960 * α4 .^ 2) .* γ4 + ((71680α4) .* α5 .^ 3) .* γ4) - ((161280α4) .* α5 .^ 2) .* γ4) + ((120960α4) .* α5) .* γ4) - (30240α4) .* γ4) - (17920 * α5 .^ 3) .* γ4) + (26880 * α5 .^ 2) .* γ4) - (14560α5) .* γ4) + 2800γ4
end

function constraint6_grad6(α1, α2, α3, α4, α5, γ1, γ2, γ3, γ4)
    ((((143360 * α1 .^ 5 - 179200 * α1 .^ 4) + 89600 * α1 .^ 3) - 22400 * α1 .^ 2) + 2800α1) - 140
end

function constraint6_grad7(α1, α2, α3, α4, α5, γ1, γ2, γ3, γ4)
    ((((143360 * α2 .^ 5 - 179200 * α2 .^ 4) + 89600 * α2 .^ 3) - 22400 * α2 .^ 2) + 2800α2) - 140
end

function constraint6_grad8(α1, α2, α3, α4, α5, γ1, γ2, γ3, γ4)
    ((((143360 * α3 .^ 5 - 179200 * α3 .^ 4) + 89600 * α3 .^ 3) - 22400 * α3 .^ 2) + 2800α3) - 140
end

function constraint6_grad9(α1, α2, α3, α4, α5, γ1, γ2, γ3, γ4)
    (((((((((((((((((53760 * α4 .^ 5 + (143360 * α4 .^ 4) .* α5) - 103040 * α4 .^ 4) + (143360 * α4 .^ 3) .* α5 .^ 2) - (215040 * α4 .^ 3) .* α5) + 78400 * α4 .^ 3 + (71680 * α4 .^ 2) .* α5 .^ 3) - (161280 * α4 .^ 2) .* α5 .^ 2) + (120960 * α4 .^ 2) .* α5) - 29680 * α4 .^ 2) + (17920α4) .* α5 .^ 4) - (53760α4) .* α5 .^ 3) + (60480α4) .* α5 .^ 2) - (30240α4) .* α5) + 5600α4) - 4480 * α5 .^ 4) + 8960 * α5 .^ 3) - 7280 * α5 .^ 2) + 2800α5) - 420
end

constraint6_grad = [constraint6_grad1,constraint6_grad2,constraint6_grad3,constraint6_grad4,constraint6_grad5,constraint6_grad6,constraint6_grad7,constraint6_grad8,constraint6_grad9]

function constraint7(α1, α2, α3, α4, α5, γ1, γ2, γ3, γ4)
    (((((((((((((((-408240 * α4 .^ 6) .* γ4 + ((816480 * α4 .^ 5) .* α5) .* γ4 + (408240 * α4 .^ 5) .* γ4) - ((136080 * α4 .^ 4) .* α5 .^ 2) .* γ4) - ((952560 * α4 .^ 4) .* α5) .* γ4) - (136080 * α4 .^ 4) .* γ4) - ((423360 * α4 .^ 3) .* α5 .^ 3) .* γ4) + ((453600 * α4 .^ 3) .* α5 .^ 2) .* γ4 + ((362880 * α4 .^ 3) .* α5) .* γ4 + (15120 * α4 .^ 3) .* γ4 + ((45360 * α4 .^ 2) .* α5 .^ 4) .* γ4 + ((272160 * α4 .^ 2) .* α5 .^ 3) .* γ4) - ((272160 * α4 .^ 2) .* α5 .^ 2) .* γ4) - ((45360 * α4 .^ 2) .* α5) .* γ4) + ((90720α4) .* α5 .^ 5) .* γ4) - ((136080α4) .* α5 .^ 4) .* γ4) + ((45360α4) .* α5 .^ 2) .* γ4 + (15120 * α5 .^ 6) .* γ4) - (45360 * α5 .^ 5) .* γ4) + (45360 * α5 .^ 4) .* γ4) - (15120 * α5 .^ 3) .* γ4) + 1
end

function constraint7_grad1(α1, α2, α3, α4, α5, γ1, γ2, γ3, γ4)
    0
end

function constraint7_grad2(α1, α2, α3, α4, α5, γ1, γ2, γ3, γ4)
    0
end

function constraint7_grad3(α1, α2, α3, α4, α5, γ1, γ2, γ3, γ4)
    0
end

function constraint7_grad4(α1, α2, α3, α4, α5, γ1, γ2, γ3, γ4)
    (((((((((((-2449440 * α4 .^ 5) .* γ4 + ((4082400 * α4 .^ 4) .* α5) .* γ4 + (2041200 * α4 .^ 4) .* γ4) - ((544320 * α4 .^ 3) .* α5 .^ 2) .* γ4) - ((3810240 * α4 .^ 3) .* α5) .* γ4) - (544320 * α4 .^ 3) .* γ4) - ((1270080 * α4 .^ 2) .* α5 .^ 3) .* γ4) + ((1360800 * α4 .^ 2) .* α5 .^ 2) .* γ4 + ((1088640 * α4 .^ 2) .* α5) .* γ4 + (45360 * α4 .^ 2) .* γ4 + ((90720α4) .* α5 .^ 4) .* γ4 + ((544320α4) .* α5 .^ 3) .* γ4) - ((544320α4) .* α5 .^ 2) .* γ4) - ((90720α4) .* α5) .* γ4) + (90720 * α5 .^ 5) .* γ4) - (136080 * α5 .^ 4) .* γ4) + (45360 * α5 .^ 2) .* γ4
end

function constraint7_grad5(α1, α2, α3, α4, α5, γ1, γ2, γ3, γ4)
    ((((((((((((816480 * α4 .^ 5) .* γ4 - ((272160 * α4 .^ 4) .* α5) .* γ4) - (952560 * α4 .^ 4) .* γ4) - ((1270080 * α4 .^ 3) .* α5 .^ 2) .* γ4) + ((907200 * α4 .^ 3) .* α5) .* γ4 + (362880 * α4 .^ 3) .* γ4 + ((181440 * α4 .^ 2) .* α5 .^ 3) .* γ4 + ((816480 * α4 .^ 2) .* α5 .^ 2) .* γ4) - ((544320 * α4 .^ 2) .* α5) .* γ4) - (45360 * α4 .^ 2) .* γ4) + ((453600α4) .* α5 .^ 4) .* γ4) - ((544320α4) .* α5 .^ 3) .* γ4) + ((90720α4) .* α5) .* γ4 + (90720 * α5 .^ 5) .* γ4) - (226800 * α5 .^ 4) .* γ4) + (181440 * α5 .^ 3) .* γ4) - (45360 * α5 .^ 2) .* γ4
end

function constraint7_grad6(α1, α2, α3, α4, α5, γ1, γ2, γ3, γ4)
    0
end

function constraint7_grad7(α1, α2, α3, α4, α5, γ1, γ2, γ3, γ4)
    0
end

function constraint7_grad8(α1, α2, α3, α4, α5, γ1, γ2, γ3, γ4)
    0
end

function constraint7_grad9(α1, α2, α3, α4, α5, γ1, γ2, γ3, γ4)
    (((((((((((((-408240 * α4 .^ 6 + (816480 * α4 .^ 5) .* α5 + 408240 * α4 .^ 5) - (136080 * α4 .^ 4) .* α5 .^ 2) - (952560 * α4 .^ 4) .* α5) - 136080 * α4 .^ 4) - (423360 * α4 .^ 3) .* α5 .^ 3) + (453600 * α4 .^ 3) .* α5 .^ 2 + (362880 * α4 .^ 3) .* α5 + 15120 * α4 .^ 3 + (45360 * α4 .^ 2) .* α5 .^ 4 + (272160 * α4 .^ 2) .* α5 .^ 3) - (272160 * α4 .^ 2) .* α5 .^ 2) - (45360 * α4 .^ 2) .* α5) + (90720α4) .* α5 .^ 5) - (136080α4) .* α5 .^ 4) + (45360α4) .* α5 .^ 2 + 15120 * α5 .^ 6) - 45360 * α5 .^ 5) + 45360 * α5 .^ 4) - 15120 * α5 .^ 3
end

constraint7_grad = [constraint7_grad1,constraint7_grad2,constraint7_grad3,constraint7_grad4,constraint7_grad5,constraint7_grad6,constraint7_grad7,constraint7_grad8,constraint7_grad9]

function constraint8(α1, α2, α3, α4, α5, γ1, γ2, γ3, γ4)
    (((((((((((((((((((((((((((((((((((((((((4096 * α1 .^ 6) .* γ1 - (6144 * α1 .^ 5) .* γ1) + (3840 * α1 .^ 4) .* γ1) - (1280 * α1 .^ 3) .* γ1) + (240 * α1 .^ 2) .* γ1) - (24α1) .* γ1) + (4096 * α2 .^ 6) .* γ2) - (6144 * α2 .^ 5) .* γ2) + (3840 * α2 .^ 4) .* γ2) - (1280 * α2 .^ 3) .* γ2) + (240 * α2 .^ 2) .* γ2) - (24α2) .* γ2) + (4096 * α3 .^ 6) .* γ3) - (6144 * α3 .^ 5) .* γ3) + (3840 * α3 .^ 4) .* γ3) - (1280 * α3 .^ 3) .* γ3) + (240 * α3 .^ 2) .* γ3) - (24α3) .* γ3) - (3876 * α4 .^ 6) .* γ4) - ((17592 * α4 .^ 5) .* α5) .* γ4) + (10212 * α4 .^ 5) .* γ4 + ((28020 * α4 .^ 4) .* α5 .^ 2) .* γ4 + ((7980 * α4 .^ 4) .* α5) .* γ4) - (7380 * α4 .^ 4) .* γ4) + ((24880 * α4 .^ 3) .* α5 .^ 3) .* γ4) - ((46680 * α4 .^ 3) .* α5 .^ 2) .* γ4) + ((7680 * α4 .^ 3) .* α5) .* γ4 + (1820 * α4 .^ 3) .* γ4) - ((8700 * α4 .^ 2) .* α5 .^ 4) .* γ4) - ((9960 * α4 .^ 2) .* α5 .^ 3) .* γ4) + ((21240 * α4 .^ 2) .* α5 .^ 2) .* γ4) - ((5460 * α4 .^ 2) .* α5) .* γ4) - ((8952α4) .* α5 .^ 5) .* γ4) + ((15540α4) .* α5 .^ 4) .* γ4) - ((5280α4) .* α5 .^ 3) .* γ4) - ((2220α4) .* α5 .^ 2) .* γ4) + ((960α4) .* α5) .* γ4) - (48α4) .* γ4) - (1492 * α5 .^ 6) .* γ4) + (4476 * α5 .^ 5) .* γ4) - (4740 * α5 .^ 4) .* γ4) + (2020 * α5 .^ 3) .* γ4) - (240 * α5 .^ 2) .* γ4) - (24α5) .* γ4) + γ1 + γ2 + γ3 + 3γ4
end

function constraint8_grad1(α1, α2, α3, α4, α5, γ1, γ2, γ3, γ4)
    (((((24576 * α1 .^ 5) .* γ1 - (30720 * α1 .^ 4) .* γ1) + (15360 * α1 .^ 3) .* γ1) - (3840 * α1 .^ 2) .* γ1) + (480α1) .* γ1) - 24γ1
end

function constraint8_grad2(α1, α2, α3, α4, α5, γ1, γ2, γ3, γ4)
    (((((24576 * α2 .^ 5) .* γ2 - (30720 * α2 .^ 4) .* γ2) + (15360 * α2 .^ 3) .* γ2) - (3840 * α2 .^ 2) .* γ2) + (480α2) .* γ2) - 24γ2
end

function constraint8_grad3(α1, α2, α3, α4, α5, γ1, γ2, γ3, γ4)
    (((((24576 * α3 .^ 5) .* γ3 - (30720 * α3 .^ 4) .* γ3) + (15360 * α3 .^ 3) .* γ3) - (3840 * α3 .^ 2) .* γ3) + (480α3) .* γ3) - 24γ3
end

function constraint8_grad4(α1, α2, α3, α4, α5, γ1, γ2, γ3, γ4)
    ((((((((((((((((-23256 * α4 .^ 5) .* γ4 - ((87960 * α4 .^ 4) .* α5) .* γ4) + (51060 * α4 .^ 4) .* γ4 + ((112080 * α4 .^ 3) .* α5 .^ 2) .* γ4 + ((31920 * α4 .^ 3) .* α5) .* γ4) - (29520 * α4 .^ 3) .* γ4) + ((74640 * α4 .^ 2) .* α5 .^ 3) .* γ4) - ((140040 * α4 .^ 2) .* α5 .^ 2) .* γ4) + ((23040 * α4 .^ 2) .* α5) .* γ4 + (5460 * α4 .^ 2) .* γ4) - ((17400α4) .* α5 .^ 4) .* γ4) - ((19920α4) .* α5 .^ 3) .* γ4) + ((42480α4) .* α5 .^ 2) .* γ4) - ((10920α4) .* α5) .* γ4) - (8952 * α5 .^ 5) .* γ4) + (15540 * α5 .^ 4) .* γ4) - (5280 * α5 .^ 3) .* γ4) - (2220 * α5 .^ 2) .* γ4) + (960α5) .* γ4) - 48γ4
end

function constraint8_grad5(α1, α2, α3, α4, α5, γ1, γ2, γ3, γ4)
    ((((((((((((((((((-17592 * α4 .^ 5) .* γ4 + ((56040 * α4 .^ 4) .* α5) .* γ4 + (7980 * α4 .^ 4) .* γ4 + ((74640 * α4 .^ 3) .* α5 .^ 2) .* γ4) - ((93360 * α4 .^ 3) .* α5) .* γ4) + (7680 * α4 .^ 3) .* γ4) - ((34800 * α4 .^ 2) .* α5 .^ 3) .* γ4) - ((29880 * α4 .^ 2) .* α5 .^ 2) .* γ4) + ((42480 * α4 .^ 2) .* α5) .* γ4) - (5460 * α4 .^ 2) .* γ4) - ((44760α4) .* α5 .^ 4) .* γ4) + ((62160α4) .* α5 .^ 3) .* γ4) - ((15840α4) .* α5 .^ 2) .* γ4) - ((4440α4) .* α5) .* γ4) + (960α4) .* γ4) - (8952 * α5 .^ 5) .* γ4) + (22380 * α5 .^ 4) .* γ4) - (18960 * α5 .^ 3) .* γ4) + (6060 * α5 .^ 2) .* γ4) - (480α5) .* γ4) - 24γ4
end

function constraint8_grad6(α1, α2, α3, α4, α5, γ1, γ2, γ3, γ4)
    (((((4096 * α1 .^ 6 - 6144 * α1 .^ 5) + 3840 * α1 .^ 4) - 1280 * α1 .^ 3) + 240 * α1 .^ 2) - 24α1) + 1
end

function constraint8_grad7(α1, α2, α3, α4, α5, γ1, γ2, γ3, γ4)
    (((((4096 * α2 .^ 6 - 6144 * α2 .^ 5) + 3840 * α2 .^ 4) - 1280 * α2 .^ 3) + 240 * α2 .^ 2) - 24α2) + 1
end

function constraint8_grad8(α1, α2, α3, α4, α5, γ1, γ2, γ3, γ4)
    (((((4096 * α3 .^ 6 - 6144 * α3 .^ 5) + 3840 * α3 .^ 4) - 1280 * α3 .^ 3) + 240 * α3 .^ 2) - 24α3) + 1
end

function constraint8_grad9(α1, α2, α3, α4, α5, γ1, γ2, γ3, γ4)
    ((((((((((((((((((((((-3876 * α4 .^ 6 - (17592 * α4 .^ 5) .* α5) + 10212 * α4 .^ 5 + (28020 * α4 .^ 4) .* α5 .^ 2 + (7980 * α4 .^ 4) .* α5) - 7380 * α4 .^ 4) + (24880 * α4 .^ 3) .* α5 .^ 3) - (46680 * α4 .^ 3) .* α5 .^ 2) + (7680 * α4 .^ 3) .* α5 + 1820 * α4 .^ 3) - (8700 * α4 .^ 2) .* α5 .^ 4) - (9960 * α4 .^ 2) .* α5 .^ 3) + (21240 * α4 .^ 2) .* α5 .^ 2) - (5460 * α4 .^ 2) .* α5) - (8952α4) .* α5 .^ 5) + (15540α4) .* α5 .^ 4) - (5280α4) .* α5 .^ 3) - (2220α4) .* α5 .^ 2) + (960α4) .* α5) - 48α4) - 1492 * α5 .^ 6) + 4476 * α5 .^ 5) - 4740 * α5 .^ 4) + 2020 * α5 .^ 3) - 240 * α5 .^ 2) - 24α5) + 3
end

constraint8_grad = [constraint8_grad1,constraint8_grad2,constraint8_grad3,constraint8_grad4,constraint8_grad5,constraint8_grad6,constraint8_grad7,constraint8_grad8,constraint8_grad9]

function constraint9(α1, α2, α3, α4, α5, γ1, γ2, γ3, γ4)
    ((((((((((((((((((((9 * α4 .^ 6) .* γ4 + ((78 * α4 .^ 5) .* α5) .* γ4) - (33 * α4 .^ 5) .* γ4) - ((77 * α4 .^ 4) .* α5 .^ 2) .* γ4) - ((59 * α4 .^ 4) .* α5) .* γ4) + (28 * α4 .^ 4) .* γ4) - ((76 * α4 .^ 3) .* α5 .^ 3) .* γ4) + ((134 * α4 .^ 3) .* α5 .^ 2) .* γ4) - ((4 * α4 .^ 3) .* α5) .* γ4) - (9 * α4 .^ 3) .* γ4) + ((31 * α4 .^ 2) .* α5 .^ 4) .* γ4 + ((26 * α4 .^ 2) .* α5 .^ 3) .* γ4) - ((60 * α4 .^ 2) .* α5 .^ 2) .* γ4) + ((11 * α4 .^ 2) .* α5) .* γ4 + α4 .^ 2 .* γ4 + ((30α4) .* α5 .^ 5) .* γ4) - ((53α4) .* α5 .^ 4) .* γ4) + ((20α4) .* α5 .^ 3) .* γ4 + ((5α4) .* α5 .^ 2) .* γ4) - ((2α4) .* α5) .* γ4) + (5 * α5 .^ 6) .* γ4) - (15 * α5 .^ 5) .* γ4) + (16 * α5 .^ 4) .* γ4) - (7 * α5 .^ 3) .* γ4) + α5 .^ 2 .* γ4
end

function constraint9_grad1(α1, α2, α3, α4, α5, γ1, γ2, γ3, γ4)
    0
end

function constraint9_grad2(α1, α2, α3, α4, α5, γ1, γ2, γ3, γ4)
    0
end

function constraint9_grad3(α1, α2, α3, α4, α5, γ1, γ2, γ3, γ4)
    0
end

function constraint9_grad4(α1, α2, α3, α4, α5, γ1, γ2, γ3, γ4)
    (((((((((((((((54 * α4 .^ 5) .* γ4 + ((390 * α4 .^ 4) .* α5) .* γ4) - (165 * α4 .^ 4) .* γ4) - ((308 * α4 .^ 3) .* α5 .^ 2) .* γ4) - ((236 * α4 .^ 3) .* α5) .* γ4) + (112 * α4 .^ 3) .* γ4) - ((228 * α4 .^ 2) .* α5 .^ 3) .* γ4) + ((402 * α4 .^ 2) .* α5 .^ 2) .* γ4) - ((12 * α4 .^ 2) .* α5) .* γ4) - (27 * α4 .^ 2) .* γ4) + ((62α4) .* α5 .^ 4) .* γ4 + ((52α4) .* α5 .^ 3) .* γ4) - ((120α4) .* α5 .^ 2) .* γ4) + ((22α4) .* α5) .* γ4 + (2α4) .* γ4 + (30 * α5 .^ 5) .* γ4) - (53 * α5 .^ 4) .* γ4) + (20 * α5 .^ 3) .* γ4 + (5 * α5 .^ 2) .* γ4) - (2α5) .* γ4
end

function constraint9_grad5(α1, α2, α3, α4, α5, γ1, γ2, γ3, γ4)
    ((((((((((((((((78 * α4 .^ 5) .* γ4 - ((154 * α4 .^ 4) .* α5) .* γ4) - (59 * α4 .^ 4) .* γ4) - ((228 * α4 .^ 3) .* α5 .^ 2) .* γ4) + ((268 * α4 .^ 3) .* α5) .* γ4) - (4 * α4 .^ 3) .* γ4) + ((124 * α4 .^ 2) .* α5 .^ 3) .* γ4 + ((78 * α4 .^ 2) .* α5 .^ 2) .* γ4) - ((120 * α4 .^ 2) .* α5) .* γ4) + (11 * α4 .^ 2) .* γ4 + ((150α4) .* α5 .^ 4) .* γ4) - ((212α4) .* α5 .^ 3) .* γ4) + ((60α4) .* α5 .^ 2) .* γ4 + ((10α4) .* α5) .* γ4) - (2α4) .* γ4) + (30 * α5 .^ 5) .* γ4) - (75 * α5 .^ 4) .* γ4) + (64 * α5 .^ 3) .* γ4) - (21 * α5 .^ 2) .* γ4) + (2α5) .* γ4
end

function constraint9_grad6(α1, α2, α3, α4, α5, γ1, γ2, γ3, γ4)
    0
end

function constraint9_grad7(α1, α2, α3, α4, α5, γ1, γ2, γ3, γ4)
    0
end

function constraint9_grad8(α1, α2, α3, α4, α5, γ1, γ2, γ3, γ4)
    0
end

function constraint9_grad9(α1, α2, α3, α4, α5, γ1, γ2, γ3, γ4)
    (((((((((((((((((((9 * α4 .^ 6 + (78 * α4 .^ 5) .* α5) - 33 * α4 .^ 5) - (77 * α4 .^ 4) .* α5 .^ 2) - (59 * α4 .^ 4) .* α5) + 28 * α4 .^ 4) - (76 * α4 .^ 3) .* α5 .^ 3) + (134 * α4 .^ 3) .* α5 .^ 2) - (4 * α4 .^ 3) .* α5) - 9 * α4 .^ 3) + (31 * α4 .^ 2) .* α5 .^ 4 + (26 * α4 .^ 2) .* α5 .^ 3) - (60 * α4 .^ 2) .* α5 .^ 2) + (11 * α4 .^ 2) .* α5 + α4 .^ 2 + (30α4) .* α5 .^ 5) - (53α4) .* α5 .^ 4) + (20α4) .* α5 .^ 3 + (5α4) .* α5 .^ 2) - (2α4) .* α5) + 5 * α5 .^ 6) - 15 * α5 .^ 5) + 16 * α5 .^ 4) - 7 * α5 .^ 3) + α5 .^ 2
end

constraint9_grad = [constraint9_grad1,constraint9_grad2,constraint9_grad3,constraint9_grad4,constraint9_grad5,constraint9_grad6,constraint9_grad7,constraint9_grad8,constraint9_grad9]

P24_model_j = JuliaModel(FunctionGradient(objective,objective_grad),
	[FunctionGradient(constraint1,constraint1_grad),
	 FunctionGradient(constraint2,constraint2_grad),
	 FunctionGradient(constraint3,constraint3_grad),
	 FunctionGradient(constraint4,constraint4_grad),
	 FunctionGradient(constraint5,constraint5_grad),
	 FunctionGradient(constraint6,constraint6_grad),
	 FunctionGradient(constraint7,constraint7_grad),
	 FunctionGradient(constraint8,constraint8_grad),
	 FunctionGradient(constraint9,constraint9_grad)],
	[0.1, 0.2, 0.3, 0.26, 0.05, 0.041666666666666664, 0.041666666666666664, 0.041666666666666664, 0.041666666666666664],
	Parameter((5,4))
	)
 
