function objective(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    1.0
end

function objective_grad1(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    0
end

function objective_grad2(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    0
end

function objective_grad3(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    0
end

function objective_grad4(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    0
end

function objective_grad5(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    0
end

function objective_grad6(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    0
end

function objective_grad7(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    0
end

function objective_grad8(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    0
end

function objective_grad9(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    0
end

function objective_grad10(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    0
end

function objective_grad11(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    0
end

objective_grad = [objective_grad1,objective_grad2,objective_grad3,objective_grad4,objective_grad5,objective_grad6,objective_grad7,objective_grad8,objective_grad9,objective_grad10,objective_grad11]

function constraint1(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    ((((-4γ1 - 4γ2) - 4γ3) - 4γ4) - 12γ5) + 1
end

function constraint1_grad1(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    0
end

function constraint1_grad2(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    0
end

function constraint1_grad3(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    0
end

function constraint1_grad4(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    0
end

function constraint1_grad5(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    0
end

function constraint1_grad6(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    0
end

function constraint1_grad7(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    -4
end

function constraint1_grad8(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    -4
end

function constraint1_grad9(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    -4
end

function constraint1_grad10(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    -4
end

function constraint1_grad11(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    -12
end

constraint1_grad = [constraint1_grad1,constraint1_grad2,constraint1_grad3,constraint1_grad4,constraint1_grad5,constraint1_grad6,constraint1_grad7,constraint1_grad8,constraint1_grad9,constraint1_grad10,constraint1_grad11]

function constraint2(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    ((((((((((((((((((-320 * α1 .^ 2) .* γ1 + (160α1) .* γ1) - (320 * α2 .^ 2) .* γ2) + (160α2) .* γ2) - (320 * α3 .^ 2) .* γ3) + (160α3) .* γ3) - (320 * α4 .^ 2) .* γ4) + (160α4) .* γ4) - (480 * α5 .^ 2) .* γ5) - ((320α5) .* α6) .* γ5) + (320α5) .* γ5) - (160 * α6 .^ 2) .* γ5) + (160α6) .* γ5) - 20γ1) - 20γ2) - 20γ3) - 20γ4) - 60γ5) + 1
end

function constraint2_grad1(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    (-640α1) .* γ1 + 160γ1
end

function constraint2_grad2(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    (-640α2) .* γ2 + 160γ2
end

function constraint2_grad3(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    (-640α3) .* γ3 + 160γ3
end

function constraint2_grad4(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    (-640α4) .* γ4 + 160γ4
end

function constraint2_grad5(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    ((-960α5) .* γ5 - (320α6) .* γ5) + 320γ5
end

function constraint2_grad6(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    ((-320α5) .* γ5 - (320α6) .* γ5) + 160γ5
end

function constraint2_grad7(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    (-320 * α1 .^ 2 + 160α1) - 20
end

function constraint2_grad8(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    (-320 * α2 .^ 2 + 160α2) - 20
end

function constraint2_grad9(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    (-320 * α3 .^ 2 + 160α3) - 20
end

function constraint2_grad10(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    (-320 * α4 .^ 2 + 160α4) - 20
end

function constraint2_grad11(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    ((((-480 * α5 .^ 2 - (320α5) .* α6) + 320α5) - 160 * α6 .^ 2) + 160α6) - 60
end

constraint2_grad = [constraint2_grad1,constraint2_grad2,constraint2_grad3,constraint2_grad4,constraint2_grad5,constraint2_grad6,constraint2_grad7,constraint2_grad8,constraint2_grad9,constraint2_grad10,constraint2_grad11]

function constraint3(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    ((((((((((((((((((((3840 * α1 .^ 3) .* γ1 - (2880 * α1 .^ 2) .* γ1) + (720α1) .* γ1 + (3840 * α2 .^ 3) .* γ2) - (2880 * α2 .^ 2) .* γ2) + (720α2) .* γ2 + (3840 * α3 .^ 3) .* γ3) - (2880 * α3 .^ 2) .* γ3) + (720α3) .* γ3 + (3840 * α4 .^ 3) .* γ4) - (2880 * α4 .^ 2) .* γ4) + (720α4) .* γ4 + (2880 * α5 .^ 3) .* γ5 + ((5760 * α5 .^ 2) .* α6) .* γ5) - (3600 * α5 .^ 2) .* γ5) + ((2880α5) .* α6 .^ 2) .* γ5) - ((4320α5) .* α6) .* γ5) + (1440α5) .* γ5) - (720 * α6 .^ 2) .* γ5) + (720α6) .* γ5) - 60γ1) - 60γ2) - 60γ3) - 60γ4) - 180γ5) + 1
end

function constraint3_grad1(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    ((11520 * α1 .^ 2) .* γ1 - (5760α1) .* γ1) + 720γ1
end

function constraint3_grad2(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    ((11520 * α2 .^ 2) .* γ2 - (5760α2) .* γ2) + 720γ2
end

function constraint3_grad3(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    ((11520 * α3 .^ 2) .* γ3 - (5760α3) .* γ3) + 720γ3
end

function constraint3_grad4(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    ((11520 * α4 .^ 2) .* γ4 - (5760α4) .* γ4) + 720γ4
end

function constraint3_grad5(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    (((((8640 * α5 .^ 2) .* γ5 + ((11520α5) .* α6) .* γ5) - (7200α5) .* γ5) + (2880 * α6 .^ 2) .* γ5) - (4320α6) .* γ5) + 1440γ5
end

function constraint3_grad6(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    ((((5760 * α5 .^ 2) .* γ5 + ((5760α5) .* α6) .* γ5) - (4320α5) .* γ5) - (1440α6) .* γ5) + 720γ5
end

function constraint3_grad7(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    ((3840 * α1 .^ 3 - 2880 * α1 .^ 2) + 720α1) - 60
end

function constraint3_grad8(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    ((3840 * α2 .^ 3 - 2880 * α2 .^ 2) + 720α2) - 60
end

function constraint3_grad9(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    ((3840 * α3 .^ 3 - 2880 * α3 .^ 2) + 720α3) - 60
end

function constraint3_grad10(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    ((3840 * α4 .^ 3 - 2880 * α4 .^ 2) + 720α4) - 60
end

function constraint3_grad11(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    (((((((2880 * α5 .^ 3 + (5760 * α5 .^ 2) .* α6) - 3600 * α5 .^ 2) + (2880α5) .* α6 .^ 2) - (4320α5) .* α6) + 1440α5) - 720 * α6 .^ 2) + 720α6) - 180
end

constraint3_grad = [constraint3_grad1,constraint3_grad2,constraint3_grad3,constraint3_grad4,constraint3_grad5,constraint3_grad6,constraint3_grad7,constraint3_grad8,constraint3_grad9,constraint3_grad10,constraint3_grad11]

function constraint4(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    (((((((((-15120 * α5 .^ 4) .* γ5 + ((20160 * α5 .^ 3) .* α6) .* γ5 + (10080 * α5 .^ 3) .* γ5 + ((3360 * α5 .^ 2) .* α6 .^ 2) .* γ5) - ((16800 * α5 .^ 2) .* α6) .* γ5) - (1680 * α5 .^ 2) .* γ5) - ((6720α5) .* α6 .^ 3) .* γ5) + ((3360α5) .* α6 .^ 2) .* γ5 + ((3360α5) .* α6) .* γ5) - (1680 * α6 .^ 4) .* γ5) + (3360 * α6 .^ 3) .* γ5) - (1680 * α6 .^ 2) .* γ5) + 1
end

function constraint4_grad1(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    0
end

function constraint4_grad2(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    0
end

function constraint4_grad3(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    0
end

function constraint4_grad4(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    0
end

function constraint4_grad5(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    (((((-60480 * α5 .^ 3) .* γ5 + ((60480 * α5 .^ 2) .* α6) .* γ5 + (30240 * α5 .^ 2) .* γ5 + ((6720α5) .* α6 .^ 2) .* γ5) - ((33600α5) .* α6) .* γ5) - (3360α5) .* γ5) - (6720 * α6 .^ 3) .* γ5) + (3360 * α6 .^ 2) .* γ5 + (3360α6) .* γ5
end

function constraint4_grad6(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    (((((((20160 * α5 .^ 3) .* γ5 + ((6720 * α5 .^ 2) .* α6) .* γ5) - (16800 * α5 .^ 2) .* γ5) - ((20160α5) .* α6 .^ 2) .* γ5) + ((6720α5) .* α6) .* γ5 + (3360α5) .* γ5) - (6720 * α6 .^ 3) .* γ5) + (10080 * α6 .^ 2) .* γ5) - (3360α6) .* γ5
end

function constraint4_grad7(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    0
end

function constraint4_grad8(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    0
end

function constraint4_grad9(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    0
end

function constraint4_grad10(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    0
end

function constraint4_grad11(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    (((((((-15120 * α5 .^ 4 + (20160 * α5 .^ 3) .* α6 + 10080 * α5 .^ 3 + (3360 * α5 .^ 2) .* α6 .^ 2) - (16800 * α5 .^ 2) .* α6) - 1680 * α5 .^ 2) - (6720α5) .* α6 .^ 3) + (3360α5) .* α6 .^ 2 + (3360α5) .* α6) - 1680 * α6 .^ 4) + 3360 * α6 .^ 3) - 1680 * α6 .^ 2
end

constraint4_grad = [constraint4_grad1,constraint4_grad2,constraint4_grad3,constraint4_grad4,constraint4_grad5,constraint4_grad6,constraint4_grad7,constraint4_grad8,constraint4_grad9,constraint4_grad10,constraint4_grad11]

function constraint5(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    (((((((((((((((((((((((((((((256 * α1 .^ 4) .* γ1 - (256 * α1 .^ 3) .* γ1) + (96 * α1 .^ 2) .* γ1) - (16α1) .* γ1) + (256 * α2 .^ 4) .* γ2) - (256 * α2 .^ 3) .* γ2) + (96 * α2 .^ 2) .* γ2) - (16α2) .* γ2) + (256 * α3 .^ 4) .* γ3) - (256 * α3 .^ 3) .* γ3) + (96 * α3 .^ 2) .* γ3) - (16α3) .* γ3) + (256 * α4 .^ 4) .* γ4) - (256 * α4 .^ 3) .* γ4) + (96 * α4 .^ 2) .* γ4) - (16α4) .* γ4) - (36 * α5 .^ 4) .* γ5) + ((560 * α5 .^ 3) .* α6) .* γ5) - (104 * α5 .^ 3) .* γ5) + ((264 * α5 .^ 2) .* α6 .^ 2) .* γ5) - ((552 * α5 .^ 2) .* α6) .* γ5) + (108 * α5 .^ 2) .* γ5) - ((16α5) .* α6 .^ 3) .* γ5) - ((120α5) .* α6 .^ 2) .* γ5) + ((168α5) .* α6) .* γ5) - (32α5) .* γ5) - (4 * α6 .^ 4) .* γ5) + (8 * α6 .^ 3) .* γ5 + (12 * α6 .^ 2) .* γ5) - (16α6) .* γ5) + γ1 + γ2 + γ3 + γ4 + 3γ5
end

function constraint5_grad1(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    (((1024 * α1 .^ 3) .* γ1 - (768 * α1 .^ 2) .* γ1) + (192α1) .* γ1) - 16γ1
end

function constraint5_grad2(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    (((1024 * α2 .^ 3) .* γ2 - (768 * α2 .^ 2) .* γ2) + (192α2) .* γ2) - 16γ2
end

function constraint5_grad3(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    (((1024 * α3 .^ 3) .* γ3 - (768 * α3 .^ 2) .* γ3) + (192α3) .* γ3) - 16γ3
end

function constraint5_grad4(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    (((1024 * α4 .^ 3) .* γ4 - (768 * α4 .^ 2) .* γ4) + (192α4) .* γ4) - 16γ4
end

function constraint5_grad5(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    (((((((((-144 * α5 .^ 3) .* γ5 + ((1680 * α5 .^ 2) .* α6) .* γ5) - (312 * α5 .^ 2) .* γ5) + ((528α5) .* α6 .^ 2) .* γ5) - ((1104α5) .* α6) .* γ5) + (216α5) .* γ5) - (16 * α6 .^ 3) .* γ5) - (120 * α6 .^ 2) .* γ5) + (168α6) .* γ5) - 32γ5
end

function constraint5_grad6(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    ((((((((560 * α5 .^ 3) .* γ5 + ((528 * α5 .^ 2) .* α6) .* γ5) - (552 * α5 .^ 2) .* γ5) - ((48α5) .* α6 .^ 2) .* γ5) - ((240α5) .* α6) .* γ5) + (168α5) .* γ5) - (16 * α6 .^ 3) .* γ5) + (24 * α6 .^ 2) .* γ5 + (24α6) .* γ5) - 16γ5
end

function constraint5_grad7(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    (((256 * α1 .^ 4 - 256 * α1 .^ 3) + 96 * α1 .^ 2) - 16α1) + 1
end

function constraint5_grad8(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    (((256 * α2 .^ 4 - 256 * α2 .^ 3) + 96 * α2 .^ 2) - 16α2) + 1
end

function constraint5_grad9(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    (((256 * α3 .^ 4 - 256 * α3 .^ 3) + 96 * α3 .^ 2) - 16α3) + 1
end

function constraint5_grad10(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    (((256 * α4 .^ 4 - 256 * α4 .^ 3) + 96 * α4 .^ 2) - 16α4) + 1
end

function constraint5_grad11(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    ((((((((((((-36 * α5 .^ 4 + (560 * α5 .^ 3) .* α6) - 104 * α5 .^ 3) + (264 * α5 .^ 2) .* α6 .^ 2) - (552 * α5 .^ 2) .* α6) + 108 * α5 .^ 2) - (16α5) .* α6 .^ 3) - (120α5) .* α6 .^ 2) + (168α5) .* α6) - 32α5) - 4 * α6 .^ 4) + 8 * α6 .^ 3 + 12 * α6 .^ 2) - 16α6) + 3
end

constraint5_grad = [constraint5_grad1,constraint5_grad2,constraint5_grad3,constraint5_grad4,constraint5_grad5,constraint5_grad6,constraint5_grad7,constraint5_grad8,constraint5_grad9,constraint5_grad10,constraint5_grad11]

function constraint6(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    ((((((((((((((((((((((((((((((((((((((143360 * α1 .^ 5) .* γ1 - (179200 * α1 .^ 4) .* γ1) + (89600 * α1 .^ 3) .* γ1) - (22400 * α1 .^ 2) .* γ1) + (2800α1) .* γ1 + (143360 * α2 .^ 5) .* γ2) - (179200 * α2 .^ 4) .* γ2) + (89600 * α2 .^ 3) .* γ2) - (22400 * α2 .^ 2) .* γ2) + (2800α2) .* γ2 + (143360 * α3 .^ 5) .* γ3) - (179200 * α3 .^ 4) .* γ3) + (89600 * α3 .^ 3) .* γ3) - (22400 * α3 .^ 2) .* γ3) + (2800α3) .* γ3 + (143360 * α4 .^ 5) .* γ4) - (179200 * α4 .^ 4) .* γ4) + (89600 * α4 .^ 3) .* γ4) - (22400 * α4 .^ 2) .* γ4) + (2800α4) .* γ4 + (53760 * α5 .^ 5) .* γ5 + ((143360 * α5 .^ 4) .* α6) .* γ5) - (103040 * α5 .^ 4) .* γ5) + ((143360 * α5 .^ 3) .* α6 .^ 2) .* γ5) - ((215040 * α5 .^ 3) .* α6) .* γ5) + (78400 * α5 .^ 3) .* γ5 + ((71680 * α5 .^ 2) .* α6 .^ 3) .* γ5) - ((161280 * α5 .^ 2) .* α6 .^ 2) .* γ5) + ((120960 * α5 .^ 2) .* α6) .* γ5) - (29680 * α5 .^ 2) .* γ5) + ((17920α5) .* α6 .^ 4) .* γ5) - ((53760α5) .* α6 .^ 3) .* γ5) + ((60480α5) .* α6 .^ 2) .* γ5) - ((30240α5) .* α6) .* γ5) + (5600α5) .* γ5) - (4480 * α6 .^ 4) .* γ5) + (8960 * α6 .^ 3) .* γ5) - (7280 * α6 .^ 2) .* γ5) + (2800α6) .* γ5) - 140γ1) - 140γ2) - 140γ3) - 140γ4) - 420γ5) + 1
end

function constraint6_grad1(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    ((((716800 * α1 .^ 4) .* γ1 - (716800 * α1 .^ 3) .* γ1) + (268800 * α1 .^ 2) .* γ1) - (44800α1) .* γ1) + 2800γ1
end

function constraint6_grad2(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    ((((716800 * α2 .^ 4) .* γ2 - (716800 * α2 .^ 3) .* γ2) + (268800 * α2 .^ 2) .* γ2) - (44800α2) .* γ2) + 2800γ2
end

function constraint6_grad3(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    ((((716800 * α3 .^ 4) .* γ3 - (716800 * α3 .^ 3) .* γ3) + (268800 * α3 .^ 2) .* γ3) - (44800α3) .* γ3) + 2800γ3
end

function constraint6_grad4(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    ((((716800 * α4 .^ 4) .* γ4 - (716800 * α4 .^ 3) .* γ4) + (268800 * α4 .^ 2) .* γ4) - (44800α4) .* γ4) + 2800γ4
end

function constraint6_grad5(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    (((((((((((((268800 * α5 .^ 4) .* γ5 + ((573440 * α5 .^ 3) .* α6) .* γ5) - (412160 * α5 .^ 3) .* γ5) + ((430080 * α5 .^ 2) .* α6 .^ 2) .* γ5) - ((645120 * α5 .^ 2) .* α6) .* γ5) + (235200 * α5 .^ 2) .* γ5 + ((143360α5) .* α6 .^ 3) .* γ5) - ((322560α5) .* α6 .^ 2) .* γ5) + ((241920α5) .* α6) .* γ5) - (59360α5) .* γ5) + (17920 * α6 .^ 4) .* γ5) - (53760 * α6 .^ 3) .* γ5) + (60480 * α6 .^ 2) .* γ5) - (30240α6) .* γ5) + 5600γ5
end

function constraint6_grad6(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    ((((((((((((143360 * α5 .^ 4) .* γ5 + ((286720 * α5 .^ 3) .* α6) .* γ5) - (215040 * α5 .^ 3) .* γ5) + ((215040 * α5 .^ 2) .* α6 .^ 2) .* γ5) - ((322560 * α5 .^ 2) .* α6) .* γ5) + (120960 * α5 .^ 2) .* γ5 + ((71680α5) .* α6 .^ 3) .* γ5) - ((161280α5) .* α6 .^ 2) .* γ5) + ((120960α5) .* α6) .* γ5) - (30240α5) .* γ5) - (17920 * α6 .^ 3) .* γ5) + (26880 * α6 .^ 2) .* γ5) - (14560α6) .* γ5) + 2800γ5
end

function constraint6_grad7(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    ((((143360 * α1 .^ 5 - 179200 * α1 .^ 4) + 89600 * α1 .^ 3) - 22400 * α1 .^ 2) + 2800α1) - 140
end

function constraint6_grad8(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    ((((143360 * α2 .^ 5 - 179200 * α2 .^ 4) + 89600 * α2 .^ 3) - 22400 * α2 .^ 2) + 2800α2) - 140
end

function constraint6_grad9(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    ((((143360 * α3 .^ 5 - 179200 * α3 .^ 4) + 89600 * α3 .^ 3) - 22400 * α3 .^ 2) + 2800α3) - 140
end

function constraint6_grad10(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    ((((143360 * α4 .^ 5 - 179200 * α4 .^ 4) + 89600 * α4 .^ 3) - 22400 * α4 .^ 2) + 2800α4) - 140
end

function constraint6_grad11(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    (((((((((((((((((53760 * α5 .^ 5 + (143360 * α5 .^ 4) .* α6) - 103040 * α5 .^ 4) + (143360 * α5 .^ 3) .* α6 .^ 2) - (215040 * α5 .^ 3) .* α6) + 78400 * α5 .^ 3 + (71680 * α5 .^ 2) .* α6 .^ 3) - (161280 * α5 .^ 2) .* α6 .^ 2) + (120960 * α5 .^ 2) .* α6) - 29680 * α5 .^ 2) + (17920α5) .* α6 .^ 4) - (53760α5) .* α6 .^ 3) + (60480α5) .* α6 .^ 2) - (30240α5) .* α6) + 5600α5) - 4480 * α6 .^ 4) + 8960 * α6 .^ 3) - 7280 * α6 .^ 2) + 2800α6) - 420
end

constraint6_grad = [constraint6_grad1,constraint6_grad2,constraint6_grad3,constraint6_grad4,constraint6_grad5,constraint6_grad6,constraint6_grad7,constraint6_grad8,constraint6_grad9,constraint6_grad10,constraint6_grad11]

function constraint7(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    (((((((((((((((-408240 * α5 .^ 6) .* γ5 + ((816480 * α5 .^ 5) .* α6) .* γ5 + (408240 * α5 .^ 5) .* γ5) - ((136080 * α5 .^ 4) .* α6 .^ 2) .* γ5) - ((952560 * α5 .^ 4) .* α6) .* γ5) - (136080 * α5 .^ 4) .* γ5) - ((423360 * α5 .^ 3) .* α6 .^ 3) .* γ5) + ((453600 * α5 .^ 3) .* α6 .^ 2) .* γ5 + ((362880 * α5 .^ 3) .* α6) .* γ5 + (15120 * α5 .^ 3) .* γ5 + ((45360 * α5 .^ 2) .* α6 .^ 4) .* γ5 + ((272160 * α5 .^ 2) .* α6 .^ 3) .* γ5) - ((272160 * α5 .^ 2) .* α6 .^ 2) .* γ5) - ((45360 * α5 .^ 2) .* α6) .* γ5) + ((90720α5) .* α6 .^ 5) .* γ5) - ((136080α5) .* α6 .^ 4) .* γ5) + ((45360α5) .* α6 .^ 2) .* γ5 + (15120 * α6 .^ 6) .* γ5) - (45360 * α6 .^ 5) .* γ5) + (45360 * α6 .^ 4) .* γ5) - (15120 * α6 .^ 3) .* γ5) + 1
end

function constraint7_grad1(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    0
end

function constraint7_grad2(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    0
end

function constraint7_grad3(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    0
end

function constraint7_grad4(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    0
end

function constraint7_grad5(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    (((((((((((-2449440 * α5 .^ 5) .* γ5 + ((4082400 * α5 .^ 4) .* α6) .* γ5 + (2041200 * α5 .^ 4) .* γ5) - ((544320 * α5 .^ 3) .* α6 .^ 2) .* γ5) - ((3810240 * α5 .^ 3) .* α6) .* γ5) - (544320 * α5 .^ 3) .* γ5) - ((1270080 * α5 .^ 2) .* α6 .^ 3) .* γ5) + ((1360800 * α5 .^ 2) .* α6 .^ 2) .* γ5 + ((1088640 * α5 .^ 2) .* α6) .* γ5 + (45360 * α5 .^ 2) .* γ5 + ((90720α5) .* α6 .^ 4) .* γ5 + ((544320α5) .* α6 .^ 3) .* γ5) - ((544320α5) .* α6 .^ 2) .* γ5) - ((90720α5) .* α6) .* γ5) + (90720 * α6 .^ 5) .* γ5) - (136080 * α6 .^ 4) .* γ5) + (45360 * α6 .^ 2) .* γ5
end

function constraint7_grad6(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    ((((((((((((816480 * α5 .^ 5) .* γ5 - ((272160 * α5 .^ 4) .* α6) .* γ5) - (952560 * α5 .^ 4) .* γ5) - ((1270080 * α5 .^ 3) .* α6 .^ 2) .* γ5) + ((907200 * α5 .^ 3) .* α6) .* γ5 + (362880 * α5 .^ 3) .* γ5 + ((181440 * α5 .^ 2) .* α6 .^ 3) .* γ5 + ((816480 * α5 .^ 2) .* α6 .^ 2) .* γ5) - ((544320 * α5 .^ 2) .* α6) .* γ5) - (45360 * α5 .^ 2) .* γ5) + ((453600α5) .* α6 .^ 4) .* γ5) - ((544320α5) .* α6 .^ 3) .* γ5) + ((90720α5) .* α6) .* γ5 + (90720 * α6 .^ 5) .* γ5) - (226800 * α6 .^ 4) .* γ5) + (181440 * α6 .^ 3) .* γ5) - (45360 * α6 .^ 2) .* γ5
end

function constraint7_grad7(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    0
end

function constraint7_grad8(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    0
end

function constraint7_grad9(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    0
end

function constraint7_grad10(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    0
end

function constraint7_grad11(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    (((((((((((((-408240 * α5 .^ 6 + (816480 * α5 .^ 5) .* α6 + 408240 * α5 .^ 5) - (136080 * α5 .^ 4) .* α6 .^ 2) - (952560 * α5 .^ 4) .* α6) - 136080 * α5 .^ 4) - (423360 * α5 .^ 3) .* α6 .^ 3) + (453600 * α5 .^ 3) .* α6 .^ 2 + (362880 * α5 .^ 3) .* α6 + 15120 * α5 .^ 3 + (45360 * α5 .^ 2) .* α6 .^ 4 + (272160 * α5 .^ 2) .* α6 .^ 3) - (272160 * α5 .^ 2) .* α6 .^ 2) - (45360 * α5 .^ 2) .* α6) + (90720α5) .* α6 .^ 5) - (136080α5) .* α6 .^ 4) + (45360α5) .* α6 .^ 2 + 15120 * α6 .^ 6) - 45360 * α6 .^ 5) + 45360 * α6 .^ 4) - 15120 * α6 .^ 3
end

constraint7_grad = [constraint7_grad1,constraint7_grad2,constraint7_grad3,constraint7_grad4,constraint7_grad5,constraint7_grad6,constraint7_grad7,constraint7_grad8,constraint7_grad9,constraint7_grad10,constraint7_grad11]

function constraint8(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    (((((((((((((((((((((((((((((((((((((((((((((((4096 * α1 .^ 6) .* γ1 - (6144 * α1 .^ 5) .* γ1) + (3840 * α1 .^ 4) .* γ1) - (1280 * α1 .^ 3) .* γ1) + (240 * α1 .^ 2) .* γ1) - (24α1) .* γ1) + (4096 * α2 .^ 6) .* γ2) - (6144 * α2 .^ 5) .* γ2) + (3840 * α2 .^ 4) .* γ2) - (1280 * α2 .^ 3) .* γ2) + (240 * α2 .^ 2) .* γ2) - (24α2) .* γ2) + (4096 * α3 .^ 6) .* γ3) - (6144 * α3 .^ 5) .* γ3) + (3840 * α3 .^ 4) .* γ3) - (1280 * α3 .^ 3) .* γ3) + (240 * α3 .^ 2) .* γ3) - (24α3) .* γ3) + (4096 * α4 .^ 6) .* γ4) - (6144 * α4 .^ 5) .* γ4) + (3840 * α4 .^ 4) .* γ4) - (1280 * α4 .^ 3) .* γ4) + (240 * α4 .^ 2) .* γ4) - (24α4) .* γ4) - (3876 * α5 .^ 6) .* γ5) - ((17592 * α5 .^ 5) .* α6) .* γ5) + (10212 * α5 .^ 5) .* γ5 + ((28020 * α5 .^ 4) .* α6 .^ 2) .* γ5 + ((7980 * α5 .^ 4) .* α6) .* γ5) - (7380 * α5 .^ 4) .* γ5) + ((24880 * α5 .^ 3) .* α6 .^ 3) .* γ5) - ((46680 * α5 .^ 3) .* α6 .^ 2) .* γ5) + ((7680 * α5 .^ 3) .* α6) .* γ5 + (1820 * α5 .^ 3) .* γ5) - ((8700 * α5 .^ 2) .* α6 .^ 4) .* γ5) - ((9960 * α5 .^ 2) .* α6 .^ 3) .* γ5) + ((21240 * α5 .^ 2) .* α6 .^ 2) .* γ5) - ((5460 * α5 .^ 2) .* α6) .* γ5) - ((8952α5) .* α6 .^ 5) .* γ5) + ((15540α5) .* α6 .^ 4) .* γ5) - ((5280α5) .* α6 .^ 3) .* γ5) - ((2220α5) .* α6 .^ 2) .* γ5) + ((960α5) .* α6) .* γ5) - (48α5) .* γ5) - (1492 * α6 .^ 6) .* γ5) + (4476 * α6 .^ 5) .* γ5) - (4740 * α6 .^ 4) .* γ5) + (2020 * α6 .^ 3) .* γ5) - (240 * α6 .^ 2) .* γ5) - (24α6) .* γ5) + γ1 + γ2 + γ3 + γ4 + 3γ5
end

function constraint8_grad1(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    (((((24576 * α1 .^ 5) .* γ1 - (30720 * α1 .^ 4) .* γ1) + (15360 * α1 .^ 3) .* γ1) - (3840 * α1 .^ 2) .* γ1) + (480α1) .* γ1) - 24γ1
end

function constraint8_grad2(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    (((((24576 * α2 .^ 5) .* γ2 - (30720 * α2 .^ 4) .* γ2) + (15360 * α2 .^ 3) .* γ2) - (3840 * α2 .^ 2) .* γ2) + (480α2) .* γ2) - 24γ2
end

function constraint8_grad3(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    (((((24576 * α3 .^ 5) .* γ3 - (30720 * α3 .^ 4) .* γ3) + (15360 * α3 .^ 3) .* γ3) - (3840 * α3 .^ 2) .* γ3) + (480α3) .* γ3) - 24γ3
end

function constraint8_grad4(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    (((((24576 * α4 .^ 5) .* γ4 - (30720 * α4 .^ 4) .* γ4) + (15360 * α4 .^ 3) .* γ4) - (3840 * α4 .^ 2) .* γ4) + (480α4) .* γ4) - 24γ4
end

function constraint8_grad5(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    ((((((((((((((((-23256 * α5 .^ 5) .* γ5 - ((87960 * α5 .^ 4) .* α6) .* γ5) + (51060 * α5 .^ 4) .* γ5 + ((112080 * α5 .^ 3) .* α6 .^ 2) .* γ5 + ((31920 * α5 .^ 3) .* α6) .* γ5) - (29520 * α5 .^ 3) .* γ5) + ((74640 * α5 .^ 2) .* α6 .^ 3) .* γ5) - ((140040 * α5 .^ 2) .* α6 .^ 2) .* γ5) + ((23040 * α5 .^ 2) .* α6) .* γ5 + (5460 * α5 .^ 2) .* γ5) - ((17400α5) .* α6 .^ 4) .* γ5) - ((19920α5) .* α6 .^ 3) .* γ5) + ((42480α5) .* α6 .^ 2) .* γ5) - ((10920α5) .* α6) .* γ5) - (8952 * α6 .^ 5) .* γ5) + (15540 * α6 .^ 4) .* γ5) - (5280 * α6 .^ 3) .* γ5) - (2220 * α6 .^ 2) .* γ5) + (960α6) .* γ5) - 48γ5
end

function constraint8_grad6(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    ((((((((((((((((((-17592 * α5 .^ 5) .* γ5 + ((56040 * α5 .^ 4) .* α6) .* γ5 + (7980 * α5 .^ 4) .* γ5 + ((74640 * α5 .^ 3) .* α6 .^ 2) .* γ5) - ((93360 * α5 .^ 3) .* α6) .* γ5) + (7680 * α5 .^ 3) .* γ5) - ((34800 * α5 .^ 2) .* α6 .^ 3) .* γ5) - ((29880 * α5 .^ 2) .* α6 .^ 2) .* γ5) + ((42480 * α5 .^ 2) .* α6) .* γ5) - (5460 * α5 .^ 2) .* γ5) - ((44760α5) .* α6 .^ 4) .* γ5) + ((62160α5) .* α6 .^ 3) .* γ5) - ((15840α5) .* α6 .^ 2) .* γ5) - ((4440α5) .* α6) .* γ5) + (960α5) .* γ5) - (8952 * α6 .^ 5) .* γ5) + (22380 * α6 .^ 4) .* γ5) - (18960 * α6 .^ 3) .* γ5) + (6060 * α6 .^ 2) .* γ5) - (480α6) .* γ5) - 24γ5
end

function constraint8_grad7(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    (((((4096 * α1 .^ 6 - 6144 * α1 .^ 5) + 3840 * α1 .^ 4) - 1280 * α1 .^ 3) + 240 * α1 .^ 2) - 24α1) + 1
end

function constraint8_grad8(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    (((((4096 * α2 .^ 6 - 6144 * α2 .^ 5) + 3840 * α2 .^ 4) - 1280 * α2 .^ 3) + 240 * α2 .^ 2) - 24α2) + 1
end

function constraint8_grad9(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    (((((4096 * α3 .^ 6 - 6144 * α3 .^ 5) + 3840 * α3 .^ 4) - 1280 * α3 .^ 3) + 240 * α3 .^ 2) - 24α3) + 1
end

function constraint8_grad10(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    (((((4096 * α4 .^ 6 - 6144 * α4 .^ 5) + 3840 * α4 .^ 4) - 1280 * α4 .^ 3) + 240 * α4 .^ 2) - 24α4) + 1
end

function constraint8_grad11(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    ((((((((((((((((((((((-3876 * α5 .^ 6 - (17592 * α5 .^ 5) .* α6) + 10212 * α5 .^ 5 + (28020 * α5 .^ 4) .* α6 .^ 2 + (7980 * α5 .^ 4) .* α6) - 7380 * α5 .^ 4) + (24880 * α5 .^ 3) .* α6 .^ 3) - (46680 * α5 .^ 3) .* α6 .^ 2) + (7680 * α5 .^ 3) .* α6 + 1820 * α5 .^ 3) - (8700 * α5 .^ 2) .* α6 .^ 4) - (9960 * α5 .^ 2) .* α6 .^ 3) + (21240 * α5 .^ 2) .* α6 .^ 2) - (5460 * α5 .^ 2) .* α6) - (8952α5) .* α6 .^ 5) + (15540α5) .* α6 .^ 4) - (5280α5) .* α6 .^ 3) - (2220α5) .* α6 .^ 2) + (960α5) .* α6) - 48α5) - 1492 * α6 .^ 6) + 4476 * α6 .^ 5) - 4740 * α6 .^ 4) + 2020 * α6 .^ 3) - 240 * α6 .^ 2) - 24α6) + 3
end

constraint8_grad = [constraint8_grad1,constraint8_grad2,constraint8_grad3,constraint8_grad4,constraint8_grad5,constraint8_grad6,constraint8_grad7,constraint8_grad8,constraint8_grad9,constraint8_grad10,constraint8_grad11]

function constraint9(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    ((((((((((((((((((((9 * α5 .^ 6) .* γ5 + ((78 * α5 .^ 5) .* α6) .* γ5) - (33 * α5 .^ 5) .* γ5) - ((77 * α5 .^ 4) .* α6 .^ 2) .* γ5) - ((59 * α5 .^ 4) .* α6) .* γ5) + (28 * α5 .^ 4) .* γ5) - ((76 * α5 .^ 3) .* α6 .^ 3) .* γ5) + ((134 * α5 .^ 3) .* α6 .^ 2) .* γ5) - ((4 * α5 .^ 3) .* α6) .* γ5) - (9 * α5 .^ 3) .* γ5) + ((31 * α5 .^ 2) .* α6 .^ 4) .* γ5 + ((26 * α5 .^ 2) .* α6 .^ 3) .* γ5) - ((60 * α5 .^ 2) .* α6 .^ 2) .* γ5) + ((11 * α5 .^ 2) .* α6) .* γ5 + α5 .^ 2 .* γ5 + ((30α5) .* α6 .^ 5) .* γ5) - ((53α5) .* α6 .^ 4) .* γ5) + ((20α5) .* α6 .^ 3) .* γ5 + ((5α5) .* α6 .^ 2) .* γ5) - ((2α5) .* α6) .* γ5) + (5 * α6 .^ 6) .* γ5) - (15 * α6 .^ 5) .* γ5) + (16 * α6 .^ 4) .* γ5) - (7 * α6 .^ 3) .* γ5) + α6 .^ 2 .* γ5
end

function constraint9_grad1(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    0
end

function constraint9_grad2(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    0
end

function constraint9_grad3(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    0
end

function constraint9_grad4(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    0
end

function constraint9_grad5(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    (((((((((((((((54 * α5 .^ 5) .* γ5 + ((390 * α5 .^ 4) .* α6) .* γ5) - (165 * α5 .^ 4) .* γ5) - ((308 * α5 .^ 3) .* α6 .^ 2) .* γ5) - ((236 * α5 .^ 3) .* α6) .* γ5) + (112 * α5 .^ 3) .* γ5) - ((228 * α5 .^ 2) .* α6 .^ 3) .* γ5) + ((402 * α5 .^ 2) .* α6 .^ 2) .* γ5) - ((12 * α5 .^ 2) .* α6) .* γ5) - (27 * α5 .^ 2) .* γ5) + ((62α5) .* α6 .^ 4) .* γ5 + ((52α5) .* α6 .^ 3) .* γ5) - ((120α5) .* α6 .^ 2) .* γ5) + ((22α5) .* α6) .* γ5 + (2α5) .* γ5 + (30 * α6 .^ 5) .* γ5) - (53 * α6 .^ 4) .* γ5) + (20 * α6 .^ 3) .* γ5 + (5 * α6 .^ 2) .* γ5) - (2α6) .* γ5
end

function constraint9_grad6(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    ((((((((((((((((78 * α5 .^ 5) .* γ5 - ((154 * α5 .^ 4) .* α6) .* γ5) - (59 * α5 .^ 4) .* γ5) - ((228 * α5 .^ 3) .* α6 .^ 2) .* γ5) + ((268 * α5 .^ 3) .* α6) .* γ5) - (4 * α5 .^ 3) .* γ5) + ((124 * α5 .^ 2) .* α6 .^ 3) .* γ5 + ((78 * α5 .^ 2) .* α6 .^ 2) .* γ5) - ((120 * α5 .^ 2) .* α6) .* γ5) + (11 * α5 .^ 2) .* γ5 + ((150α5) .* α6 .^ 4) .* γ5) - ((212α5) .* α6 .^ 3) .* γ5) + ((60α5) .* α6 .^ 2) .* γ5 + ((10α5) .* α6) .* γ5) - (2α5) .* γ5) + (30 * α6 .^ 5) .* γ5) - (75 * α6 .^ 4) .* γ5) + (64 * α6 .^ 3) .* γ5) - (21 * α6 .^ 2) .* γ5) + (2α6) .* γ5
end

function constraint9_grad7(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    0
end

function constraint9_grad8(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    0
end

function constraint9_grad9(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    0
end

function constraint9_grad10(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    0
end

function constraint9_grad11(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    (((((((((((((((((((9 * α5 .^ 6 + (78 * α5 .^ 5) .* α6) - 33 * α5 .^ 5) - (77 * α5 .^ 4) .* α6 .^ 2) - (59 * α5 .^ 4) .* α6) + 28 * α5 .^ 4) - (76 * α5 .^ 3) .* α6 .^ 3) + (134 * α5 .^ 3) .* α6 .^ 2) - (4 * α5 .^ 3) .* α6) - 9 * α5 .^ 3) + (31 * α5 .^ 2) .* α6 .^ 4 + (26 * α5 .^ 2) .* α6 .^ 3) - (60 * α5 .^ 2) .* α6 .^ 2) + (11 * α5 .^ 2) .* α6 + α5 .^ 2 + (30α5) .* α6 .^ 5) - (53α5) .* α6 .^ 4) + (20α5) .* α6 .^ 3 + (5α5) .* α6 .^ 2) - (2α5) .* α6) + 5 * α6 .^ 6) - 15 * α6 .^ 5) + 16 * α6 .^ 4) - 7 * α6 .^ 3) + α6 .^ 2
end

constraint9_grad = [constraint9_grad1,constraint9_grad2,constraint9_grad3,constraint9_grad4,constraint9_grad5,constraint9_grad6,constraint9_grad7,constraint9_grad8,constraint9_grad9,constraint9_grad10,constraint9_grad11]

function constraint10(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    (((((((((((((((((((((((((((3628800 * α5 .^ 7) .* γ5 + ((2419200 * α5 .^ 6) .* α6) .* γ5) - (6955200 * α5 .^ 6) .* γ5) - ((6854400 * α5 .^ 5) .* α6 .^ 2) .* γ5) - ((201600 * α5 .^ 5) .* α6) .* γ5) + (5241600 * α5 .^ 5) .* γ5) - ((4838400 * α5 .^ 4) .* α6 .^ 3) .* γ5) + ((12196800 * α5 .^ 4) .* α6 .^ 2) .* γ5) - ((2923200 * α5 .^ 4) .* α6) .* γ5) - (1940400 * α5 .^ 4) .* γ5) + ((2822400 * α5 .^ 3) .* α6 .^ 4) .* γ5 + ((2016000 * α5 .^ 3) .* α6 .^ 3) .* γ5) - ((6854400 * α5 .^ 3) .* α6 .^ 2) .* γ5) + ((2116800 * α5 .^ 3) .* α6) .* γ5 + (352800 * α5 .^ 3) .* γ5 + ((2419200 * α5 .^ 2) .* α6 .^ 5) .* γ5) - ((5140800 * α5 .^ 2) .* α6 .^ 4) .* γ5) + ((1814400 * α5 .^ 2) .* α6 .^ 3) .* γ5 + ((1260000 * α5 .^ 2) .* α6 .^ 2) .* γ5) - ((554400 * α5 .^ 2) .* α6) .* γ5) - (25200 * α5 .^ 2) .* γ5) + ((403200α5) .* α6 .^ 6) .* γ5) - ((1814400α5) .* α6 .^ 5) .* γ5) + ((2419200α5) .* α6 .^ 4) .* γ5) - ((1108800α5) .* α6 .^ 3) .* γ5) + ((50400α5) .* α6 .^ 2) .* γ5 + ((50400α5) .* α6) .* γ5) - (100800 * α6 .^ 6) .* γ5) + (302400 * α6 .^ 5) .* γ5) - (327600 * α6 .^ 4) .* γ5) + (151200 * α6 .^ 3) .* γ5) - (25200 * α6 .^ 2) .* γ5) + 1
end

function constraint10_grad1(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    0
end

function constraint10_grad2(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    0
end

function constraint10_grad3(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    0
end

function constraint10_grad4(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    0
end

function constraint10_grad5(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    (((((((((((((((((((((25401600 * α5 .^ 6) .* γ5 + ((14515200 * α5 .^ 5) .* α6) .* γ5) - (41731200 * α5 .^ 5) .* γ5) - ((34272000 * α5 .^ 4) .* α6 .^ 2) .* γ5) - ((1008000 * α5 .^ 4) .* α6) .* γ5) + (26208000 * α5 .^ 4) .* γ5) - ((19353600 * α5 .^ 3) .* α6 .^ 3) .* γ5) + ((48787200 * α5 .^ 3) .* α6 .^ 2) .* γ5) - ((11692800 * α5 .^ 3) .* α6) .* γ5) - (7761600 * α5 .^ 3) .* γ5) + ((8467200 * α5 .^ 2) .* α6 .^ 4) .* γ5 + ((6048000 * α5 .^ 2) .* α6 .^ 3) .* γ5) - ((20563200 * α5 .^ 2) .* α6 .^ 2) .* γ5) + ((6350400 * α5 .^ 2) .* α6) .* γ5 + (1058400 * α5 .^ 2) .* γ5 + ((4838400α5) .* α6 .^ 5) .* γ5) - ((10281600α5) .* α6 .^ 4) .* γ5) + ((3628800α5) .* α6 .^ 3) .* γ5 + ((2520000α5) .* α6 .^ 2) .* γ5) - ((1108800α5) .* α6) .* γ5) - (50400α5) .* γ5) + (403200 * α6 .^ 6) .* γ5) - (1814400 * α6 .^ 5) .* γ5) + (2419200 * α6 .^ 4) .* γ5) - (1108800 * α6 .^ 3) .* γ5) + (50400 * α6 .^ 2) .* γ5 + (50400α6) .* γ5
end

function constraint10_grad6(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    (((((((((((((((((((((2419200 * α5 .^ 6) .* γ5 - ((13708800 * α5 .^ 5) .* α6) .* γ5) - (201600 * α5 .^ 5) .* γ5) - ((14515200 * α5 .^ 4) .* α6 .^ 2) .* γ5) + ((24393600 * α5 .^ 4) .* α6) .* γ5) - (2923200 * α5 .^ 4) .* γ5) + ((11289600 * α5 .^ 3) .* α6 .^ 3) .* γ5 + ((6048000 * α5 .^ 3) .* α6 .^ 2) .* γ5) - ((13708800 * α5 .^ 3) .* α6) .* γ5) + (2116800 * α5 .^ 3) .* γ5 + ((12096000 * α5 .^ 2) .* α6 .^ 4) .* γ5) - ((20563200 * α5 .^ 2) .* α6 .^ 3) .* γ5) + ((5443200 * α5 .^ 2) .* α6 .^ 2) .* γ5 + ((2520000 * α5 .^ 2) .* α6) .* γ5) - (554400 * α5 .^ 2) .* γ5) + ((2419200α5) .* α6 .^ 5) .* γ5) - ((9072000α5) .* α6 .^ 4) .* γ5) + ((9676800α5) .* α6 .^ 3) .* γ5) - ((3326400α5) .* α6 .^ 2) .* γ5) + ((100800α5) .* α6) .* γ5 + (50400α5) .* γ5) - (604800 * α6 .^ 5) .* γ5) + (1512000 * α6 .^ 4) .* γ5) - (1310400 * α6 .^ 3) .* γ5) + (453600 * α6 .^ 2) .* γ5) - (50400α6) .* γ5
end

function constraint10_grad7(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    0
end

function constraint10_grad8(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    0
end

function constraint10_grad9(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    0
end

function constraint10_grad10(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    0
end

function constraint10_grad11(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    (((((((((((((((((((((((((3628800 * α5 .^ 7 + (2419200 * α5 .^ 6) .* α6) - 6955200 * α5 .^ 6) - (6854400 * α5 .^ 5) .* α6 .^ 2) - (201600 * α5 .^ 5) .* α6) + 5241600 * α5 .^ 5) - (4838400 * α5 .^ 4) .* α6 .^ 3) + (12196800 * α5 .^ 4) .* α6 .^ 2) - (2923200 * α5 .^ 4) .* α6) - 1940400 * α5 .^ 4) + (2822400 * α5 .^ 3) .* α6 .^ 4 + (2016000 * α5 .^ 3) .* α6 .^ 3) - (6854400 * α5 .^ 3) .* α6 .^ 2) + (2116800 * α5 .^ 3) .* α6 + 352800 * α5 .^ 3 + (2419200 * α5 .^ 2) .* α6 .^ 5) - (5140800 * α5 .^ 2) .* α6 .^ 4) + (1814400 * α5 .^ 2) .* α6 .^ 3 + (1260000 * α5 .^ 2) .* α6 .^ 2) - (554400 * α5 .^ 2) .* α6) - 25200 * α5 .^ 2) + (403200α5) .* α6 .^ 6) - (1814400α5) .* α6 .^ 5) + (2419200α5) .* α6 .^ 4) - (1108800α5) .* α6 .^ 3) + (50400α5) .* α6 .^ 2 + (50400α5) .* α6) - 100800 * α6 .^ 6) + 302400 * α6 .^ 5) - 327600 * α6 .^ 4) + 151200 * α6 .^ 3) - 25200 * α6 .^ 2
end

constraint10_grad = [constraint10_grad1,constraint10_grad2,constraint10_grad3,constraint10_grad4,constraint10_grad5,constraint10_grad6,constraint10_grad7,constraint10_grad8,constraint10_grad9,constraint10_grad10,constraint10_grad11]

function constraint11(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    ((((((((((((((((((((((((((((((((((((((((((((((((((((((((((-16384 * α1 .^ 7) .* γ1 + (28672 * α1 .^ 6) .* γ1) - (21504 * α1 .^ 5) .* γ1) + (8960 * α1 .^ 4) .* γ1) - (2240 * α1 .^ 3) .* γ1) + (336 * α1 .^ 2) .* γ1) - (28α1) .* γ1) - (16384 * α2 .^ 7) .* γ2) + (28672 * α2 .^ 6) .* γ2) - (21504 * α2 .^ 5) .* γ2) + (8960 * α2 .^ 4) .* γ2) - (2240 * α2 .^ 3) .* γ2) + (336 * α2 .^ 2) .* γ2) - (28α2) .* γ2) - (16384 * α3 .^ 7) .* γ3) + (28672 * α3 .^ 6) .* γ3) - (21504 * α3 .^ 5) .* γ3) + (8960 * α3 .^ 4) .* γ3) - (2240 * α3 .^ 3) .* γ3) + (336 * α3 .^ 2) .* γ3) - (28α3) .* γ3) - (16384 * α4 .^ 7) .* γ4) + (28672 * α4 .^ 6) .* γ4) - (21504 * α4 .^ 5) .* γ4) + (8960 * α4 .^ 4) .* γ4) - (2240 * α4 .^ 3) .* γ4) + (336 * α4 .^ 2) .* γ4) - (28α4) .* γ4) + (9792 * α5 .^ 7) .* γ5) - ((1664 * α5 .^ 6) .* α6) .* γ5) - (16720 * α5 .^ 6) .* γ5) - ((38976 * α5 .^ 5) .* α6 .^ 2) .* γ5) + ((21984 * α5 .^ 5) .* α6) .* γ5 + (9792 * α5 .^ 5) .* γ5) - ((29440 * α5 .^ 4) .* α6 .^ 3) .* γ5) + ((70800 * α5 .^ 4) .* α6 .^ 2) .* γ5) - ((31440 * α5 .^ 4) .* α6) .* γ5) - (1460 * α5 .^ 4) .* γ5) + ((3520 * α5 .^ 3) .* α6 .^ 4) .* γ5 + ((25920 * α5 .^ 3) .* α6 .^ 3) .* γ5) - ((45120 * α5 .^ 3) .* α6 .^ 2) .* γ5) + ((18000 * α5 .^ 3) .* α6) .* γ5) - (760 * α5 .^ 3) .* γ5) + ((6528 * α5 .^ 2) .* α6 .^ 5) .* γ5) - ((10800 * α5 .^ 2) .* α6 .^ 4) .* γ5) - ((4320 * α5 .^ 2) .* α6 .^ 3) .* γ5) + ((12360 * α5 .^ 2) .* α6 .^ 2) .* γ5) - ((4920 * α5 .^ 2) .* α6) .* γ5) + (360 * α5 .^ 2) .* γ5 + ((1088α5) .* α6 .^ 6) .* γ5) - ((4896α5) .* α6 .^ 5) .* γ5) + ((5760α5) .* α6 .^ 4) .* γ5) - ((1200α5) .* α6 .^ 3) .* γ5) - ((1320α5) .* α6 .^ 2) .* γ5) + ((624α5) .* α6) .* γ5) - (56α5) .* γ5) - (272 * α6 .^ 6) .* γ5) + (816 * α6 .^ 5) .* γ5) - (820 * α6 .^ 4) .* γ5) + (280 * α6 .^ 3) .* γ5 + (24 * α6 .^ 2) .* γ5) - (28α6) .* γ5) + γ1 + γ2 + γ3 + γ4 + 3γ5
end

function constraint11_grad1(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    ((((((-114688 * α1 .^ 6) .* γ1 + (172032 * α1 .^ 5) .* γ1) - (107520 * α1 .^ 4) .* γ1) + (35840 * α1 .^ 3) .* γ1) - (6720 * α1 .^ 2) .* γ1) + (672α1) .* γ1) - 28γ1
end

function constraint11_grad2(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    ((((((-114688 * α2 .^ 6) .* γ2 + (172032 * α2 .^ 5) .* γ2) - (107520 * α2 .^ 4) .* γ2) + (35840 * α2 .^ 3) .* γ2) - (6720 * α2 .^ 2) .* γ2) + (672α2) .* γ2) - 28γ2
end

function constraint11_grad3(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    ((((((-114688 * α3 .^ 6) .* γ3 + (172032 * α3 .^ 5) .* γ3) - (107520 * α3 .^ 4) .* γ3) + (35840 * α3 .^ 3) .* γ3) - (6720 * α3 .^ 2) .* γ3) + (672α3) .* γ3) - 28γ3
end

function constraint11_grad4(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    ((((((-114688 * α4 .^ 6) .* γ4 + (172032 * α4 .^ 5) .* γ4) - (107520 * α4 .^ 4) .* γ4) + (35840 * α4 .^ 3) .* γ4) - (6720 * α4 .^ 2) .* γ4) + (672α4) .* γ4) - 28γ4
end

function constraint11_grad5(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    ((((((((((((((((((((((((68544 * α5 .^ 6) .* γ5 - ((9984 * α5 .^ 5) .* α6) .* γ5) - (100320 * α5 .^ 5) .* γ5) - ((194880 * α5 .^ 4) .* α6 .^ 2) .* γ5) + ((109920 * α5 .^ 4) .* α6) .* γ5 + (48960 * α5 .^ 4) .* γ5) - ((117760 * α5 .^ 3) .* α6 .^ 3) .* γ5) + ((283200 * α5 .^ 3) .* α6 .^ 2) .* γ5) - ((125760 * α5 .^ 3) .* α6) .* γ5) - (5840 * α5 .^ 3) .* γ5) + ((10560 * α5 .^ 2) .* α6 .^ 4) .* γ5 + ((77760 * α5 .^ 2) .* α6 .^ 3) .* γ5) - ((135360 * α5 .^ 2) .* α6 .^ 2) .* γ5) + ((54000 * α5 .^ 2) .* α6) .* γ5) - (2280 * α5 .^ 2) .* γ5) + ((13056α5) .* α6 .^ 5) .* γ5) - ((21600α5) .* α6 .^ 4) .* γ5) - ((8640α5) .* α6 .^ 3) .* γ5) + ((24720α5) .* α6 .^ 2) .* γ5) - ((9840α5) .* α6) .* γ5) + (720α5) .* γ5 + (1088 * α6 .^ 6) .* γ5) - (4896 * α6 .^ 5) .* γ5) + (5760 * α6 .^ 4) .* γ5) - (1200 * α6 .^ 3) .* γ5) - (1320 * α6 .^ 2) .* γ5) + (624α6) .* γ5) - 56γ5
end

function constraint11_grad6(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    (((((((((((((((((((((((-1664 * α5 .^ 6) .* γ5 - ((77952 * α5 .^ 5) .* α6) .* γ5) + (21984 * α5 .^ 5) .* γ5) - ((88320 * α5 .^ 4) .* α6 .^ 2) .* γ5) + ((141600 * α5 .^ 4) .* α6) .* γ5) - (31440 * α5 .^ 4) .* γ5) + ((14080 * α5 .^ 3) .* α6 .^ 3) .* γ5 + ((77760 * α5 .^ 3) .* α6 .^ 2) .* γ5) - ((90240 * α5 .^ 3) .* α6) .* γ5) + (18000 * α5 .^ 3) .* γ5 + ((32640 * α5 .^ 2) .* α6 .^ 4) .* γ5) - ((43200 * α5 .^ 2) .* α6 .^ 3) .* γ5) - ((12960 * α5 .^ 2) .* α6 .^ 2) .* γ5) + ((24720 * α5 .^ 2) .* α6) .* γ5) - (4920 * α5 .^ 2) .* γ5) + ((6528α5) .* α6 .^ 5) .* γ5) - ((24480α5) .* α6 .^ 4) .* γ5) + ((23040α5) .* α6 .^ 3) .* γ5) - ((3600α5) .* α6 .^ 2) .* γ5) - ((2640α5) .* α6) .* γ5) + (624α5) .* γ5) - (1632 * α6 .^ 5) .* γ5) + (4080 * α6 .^ 4) .* γ5) - (3280 * α6 .^ 3) .* γ5) + (840 * α6 .^ 2) .* γ5 + (48α6) .* γ5) - 28γ5
end

function constraint11_grad7(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    ((((((-16384 * α1 .^ 7 + 28672 * α1 .^ 6) - 21504 * α1 .^ 5) + 8960 * α1 .^ 4) - 2240 * α1 .^ 3) + 336 * α1 .^ 2) - 28α1) + 1
end

function constraint11_grad8(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    ((((((-16384 * α2 .^ 7 + 28672 * α2 .^ 6) - 21504 * α2 .^ 5) + 8960 * α2 .^ 4) - 2240 * α2 .^ 3) + 336 * α2 .^ 2) - 28α2) + 1
end

function constraint11_grad9(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    ((((((-16384 * α3 .^ 7 + 28672 * α3 .^ 6) - 21504 * α3 .^ 5) + 8960 * α3 .^ 4) - 2240 * α3 .^ 3) + 336 * α3 .^ 2) - 28α3) + 1
end

function constraint11_grad10(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    ((((((-16384 * α4 .^ 7 + 28672 * α4 .^ 6) - 21504 * α4 .^ 5) + 8960 * α4 .^ 4) - 2240 * α4 .^ 3) + 336 * α4 .^ 2) - 28α4) + 1
end

function constraint11_grad11(α1, α2, α3, α4, α5, α6, γ1, γ2, γ3, γ4, γ5)
    (((((((((((((((((((((((((((((9792 * α5 .^ 7 - (1664 * α5 .^ 6) .* α6) - 16720 * α5 .^ 6) - (38976 * α5 .^ 5) .* α6 .^ 2) + (21984 * α5 .^ 5) .* α6 + 9792 * α5 .^ 5) - (29440 * α5 .^ 4) .* α6 .^ 3) + (70800 * α5 .^ 4) .* α6 .^ 2) - (31440 * α5 .^ 4) .* α6) - 1460 * α5 .^ 4) + (3520 * α5 .^ 3) .* α6 .^ 4 + (25920 * α5 .^ 3) .* α6 .^ 3) - (45120 * α5 .^ 3) .* α6 .^ 2) + (18000 * α5 .^ 3) .* α6) - 760 * α5 .^ 3) + (6528 * α5 .^ 2) .* α6 .^ 5) - (10800 * α5 .^ 2) .* α6 .^ 4) - (4320 * α5 .^ 2) .* α6 .^ 3) + (12360 * α5 .^ 2) .* α6 .^ 2) - (4920 * α5 .^ 2) .* α6) + 360 * α5 .^ 2 + (1088α5) .* α6 .^ 6) - (4896α5) .* α6 .^ 5) + (5760α5) .* α6 .^ 4) - (1200α5) .* α6 .^ 3) - (1320α5) .* α6 .^ 2) + (624α5) .* α6) - 56α5) - 272 * α6 .^ 6) + 816 * α6 .^ 5) - 820 * α6 .^ 4) + 280 * α6 .^ 3 + 24 * α6 .^ 2) - 28α6) + 3
end

constraint11_grad = [constraint11_grad1,constraint11_grad2,constraint11_grad3,constraint11_grad4,constraint11_grad5,constraint11_grad6,constraint11_grad7,constraint11_grad8,constraint11_grad9,constraint11_grad10,constraint11_grad11]

P28_model_j = JuliaModel(FunctionGradient(objective,objective_grad),
	[FunctionGradient(constraint1,constraint1_grad),
	 FunctionGradient(constraint2,constraint2_grad),
	 FunctionGradient(constraint3,constraint3_grad),
	 FunctionGradient(constraint4,constraint4_grad),
	 FunctionGradient(constraint5,constraint5_grad),
	 FunctionGradient(constraint6,constraint6_grad),
	 FunctionGradient(constraint7,constraint7_grad),
	 FunctionGradient(constraint8,constraint8_grad),
	 FunctionGradient(constraint9,constraint9_grad),
	 FunctionGradient(constraint10,constraint10_grad),
	 FunctionGradient(constraint11,constraint11_grad)],
	[0.05, 0.1, 0.15, 0.25, 0.2, 0.1, 0.03571428571428571, 0.03571428571428571, 0.03571428571428571, 0.03571428571428571, 0.03571428571428571],
	Parameter((6,5))
	)
 
