function objective(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    1.0
end

function objective_grad1(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    0
end

function objective_grad2(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    0
end

function objective_grad3(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    0
end

function objective_grad4(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    0
end

function objective_grad5(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    0
end

function objective_grad6(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    0
end

function objective_grad7(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    0
end

function objective_grad8(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    0
end

function objective_grad9(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    0
end

function objective_grad10(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    0
end

function objective_grad11(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    0
end

function objective_grad12(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    0
end

function objective_grad13(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    0
end

function objective_grad14(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    0
end

function objective_grad15(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    0
end

objective_grad = [objective_grad1,objective_grad2,objective_grad3,objective_grad4,objective_grad5,objective_grad6,objective_grad7,objective_grad8,objective_grad9,objective_grad10,objective_grad11,objective_grad12,objective_grad13,objective_grad14,objective_grad15]

function constraint1(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    ((((((-γ1 - 4γ2) - 4γ3) - 6γ4) - 6γ5) - 12γ6) - 12γ7) + 1
end

function constraint1_grad1(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    0
end

function constraint1_grad2(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    0
end

function constraint1_grad3(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    0
end

function constraint1_grad4(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    0
end

function constraint1_grad5(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    0
end

function constraint1_grad6(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    0
end

function constraint1_grad7(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    0
end

function constraint1_grad8(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    0
end

function constraint1_grad9(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    -1
end

function constraint1_grad10(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    -4
end

function constraint1_grad11(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    -4
end

function constraint1_grad12(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    -6
end

function constraint1_grad13(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    -6
end

function constraint1_grad14(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    -12
end

function constraint1_grad15(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    -12
end

constraint1_grad = [constraint1_grad1,constraint1_grad2,constraint1_grad3,constraint1_grad4,constraint1_grad5,constraint1_grad6,constraint1_grad7,constraint1_grad8,constraint1_grad9,constraint1_grad10,constraint1_grad11,constraint1_grad12,constraint1_grad13,constraint1_grad14,constraint1_grad15]

function constraint2(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    ((((((((((((((((((((((((-320 * α1 .^ 2) .* γ2 + (160α1) .* γ2) - (320 * α2 .^ 2) .* γ3) + (160α2) .* γ3) - (160 * α3 .^ 2) .* γ4) + (80α3) .* γ4) - (160 * α4 .^ 2) .* γ5) + (80α4) .* γ5) - (480 * α5 .^ 2) .* γ6) - ((320α5) .* α6) .* γ6) + (320α5) .* γ6) - (160 * α6 .^ 2) .* γ6) + (160α6) .* γ6) - (480 * α7 .^ 2) .* γ7) - ((320α7) .* α8) .* γ7) + (320α7) .* γ7) - (160 * α8 .^ 2) .* γ7) + (160α8) .* γ7) - 20γ2) - 20γ3) - 10γ4) - 10γ5) - 60γ6) - 60γ7) + 1
end

function constraint2_grad1(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    (-640α1) .* γ2 + 160γ2
end

function constraint2_grad2(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    (-640α2) .* γ3 + 160γ3
end

function constraint2_grad3(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    (-320α3) .* γ4 + 80γ4
end

function constraint2_grad4(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    (-320α4) .* γ5 + 80γ5
end

function constraint2_grad5(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    ((-960α5) .* γ6 - (320α6) .* γ6) + 320γ6
end

function constraint2_grad6(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    ((-320α5) .* γ6 - (320α6) .* γ6) + 160γ6
end

function constraint2_grad7(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    ((-960α7) .* γ7 - (320α8) .* γ7) + 320γ7
end

function constraint2_grad8(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    ((-320α7) .* γ7 - (320α8) .* γ7) + 160γ7
end

function constraint2_grad9(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    0
end

function constraint2_grad10(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    (-320 * α1 .^ 2 + 160α1) - 20
end

function constraint2_grad11(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    (-320 * α2 .^ 2 + 160α2) - 20
end

function constraint2_grad12(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    (-160 * α3 .^ 2 + 80α3) - 10
end

function constraint2_grad13(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    (-160 * α4 .^ 2 + 80α4) - 10
end

function constraint2_grad14(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    ((((-480 * α5 .^ 2 - (320α5) .* α6) + 320α5) - 160 * α6 .^ 2) + 160α6) - 60
end

function constraint2_grad15(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    ((((-480 * α7 .^ 2 - (320α7) .* α8) + 320α7) - 160 * α8 .^ 2) + 160α8) - 60
end

constraint2_grad = [constraint2_grad1,constraint2_grad2,constraint2_grad3,constraint2_grad4,constraint2_grad5,constraint2_grad6,constraint2_grad7,constraint2_grad8,constraint2_grad9,constraint2_grad10,constraint2_grad11,constraint2_grad12,constraint2_grad13,constraint2_grad14,constraint2_grad15]

function constraint3(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    (((((((((((((((((((((3840 * α1 .^ 3) .* γ2 - (2880 * α1 .^ 2) .* γ2) + (720α1) .* γ2 + (3840 * α2 .^ 3) .* γ3) - (2880 * α2 .^ 2) .* γ3) + (720α2) .* γ3 + (2880 * α5 .^ 3) .* γ6 + ((5760 * α5 .^ 2) .* α6) .* γ6) - (3600 * α5 .^ 2) .* γ6) + ((2880α5) .* α6 .^ 2) .* γ6) - ((4320α5) .* α6) .* γ6) + (1440α5) .* γ6) - (720 * α6 .^ 2) .* γ6) + (720α6) .* γ6 + (2880 * α7 .^ 3) .* γ7 + ((5760 * α7 .^ 2) .* α8) .* γ7) - (3600 * α7 .^ 2) .* γ7) + ((2880α7) .* α8 .^ 2) .* γ7) - ((4320α7) .* α8) .* γ7) + (1440α7) .* γ7) - (720 * α8 .^ 2) .* γ7) + (720α8) .* γ7) - 60γ2) - 60γ3) - 180γ6) - 180γ7) + 1
end

function constraint3_grad1(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    ((11520 * α1 .^ 2) .* γ2 - (5760α1) .* γ2) + 720γ2
end

function constraint3_grad2(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    ((11520 * α2 .^ 2) .* γ3 - (5760α2) .* γ3) + 720γ3
end

function constraint3_grad3(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    0
end

function constraint3_grad4(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    0
end

function constraint3_grad5(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    (((((8640 * α5 .^ 2) .* γ6 + ((11520α5) .* α6) .* γ6) - (7200α5) .* γ6) + (2880 * α6 .^ 2) .* γ6) - (4320α6) .* γ6) + 1440γ6
end

function constraint3_grad6(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    ((((5760 * α5 .^ 2) .* γ6 + ((5760α5) .* α6) .* γ6) - (4320α5) .* γ6) - (1440α6) .* γ6) + 720γ6
end

function constraint3_grad7(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    (((((8640 * α7 .^ 2) .* γ7 + ((11520α7) .* α8) .* γ7) - (7200α7) .* γ7) + (2880 * α8 .^ 2) .* γ7) - (4320α8) .* γ7) + 1440γ7
end

function constraint3_grad8(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    ((((5760 * α7 .^ 2) .* γ7 + ((5760α7) .* α8) .* γ7) - (4320α7) .* γ7) - (1440α8) .* γ7) + 720γ7
end

function constraint3_grad9(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    0
end

function constraint3_grad10(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    ((3840 * α1 .^ 3 - 2880 * α1 .^ 2) + 720α1) - 60
end

function constraint3_grad11(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    ((3840 * α2 .^ 3 - 2880 * α2 .^ 2) + 720α2) - 60
end

function constraint3_grad12(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    0
end

function constraint3_grad13(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    0
end

function constraint3_grad14(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    (((((((2880 * α5 .^ 3 + (5760 * α5 .^ 2) .* α6) - 3600 * α5 .^ 2) + (2880α5) .* α6 .^ 2) - (4320α5) .* α6) + 1440α5) - 720 * α6 .^ 2) + 720α6) - 180
end

function constraint3_grad15(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    (((((((2880 * α7 .^ 3 + (5760 * α7 .^ 2) .* α8) - 3600 * α7 .^ 2) + (2880α7) .* α8 .^ 2) - (4320α7) .* α8) + 1440α7) - 720 * α8 .^ 2) + 720α8) - 180
end

constraint3_grad = [constraint3_grad1,constraint3_grad2,constraint3_grad3,constraint3_grad4,constraint3_grad5,constraint3_grad6,constraint3_grad7,constraint3_grad8,constraint3_grad9,constraint3_grad10,constraint3_grad11,constraint3_grad12,constraint3_grad13,constraint3_grad14,constraint3_grad15]

function constraint4(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    ((((((((((((((((((((((((((((-13440 * α3 .^ 4) .* γ4 + (13440 * α3 .^ 3) .* γ4) - (5040 * α3 .^ 2) .* γ4) + (840α3) .* γ4) - (13440 * α4 .^ 4) .* γ5) + (13440 * α4 .^ 3) .* γ5) - (5040 * α4 .^ 2) .* γ5) + (840α4) .* γ5) - (15120 * α5 .^ 4) .* γ6) + ((20160 * α5 .^ 3) .* α6) .* γ6 + (10080 * α5 .^ 3) .* γ6 + ((3360 * α5 .^ 2) .* α6 .^ 2) .* γ6) - ((16800 * α5 .^ 2) .* α6) .* γ6) - (1680 * α5 .^ 2) .* γ6) - ((6720α5) .* α6 .^ 3) .* γ6) + ((3360α5) .* α6 .^ 2) .* γ6 + ((3360α5) .* α6) .* γ6) - (1680 * α6 .^ 4) .* γ6) + (3360 * α6 .^ 3) .* γ6) - (1680 * α6 .^ 2) .* γ6) - (15120 * α7 .^ 4) .* γ7) + ((20160 * α7 .^ 3) .* α8) .* γ7 + (10080 * α7 .^ 3) .* γ7 + ((3360 * α7 .^ 2) .* α8 .^ 2) .* γ7) - ((16800 * α7 .^ 2) .* α8) .* γ7) - (1680 * α7 .^ 2) .* γ7) - ((6720α7) .* α8 .^ 3) .* γ7) + ((3360α7) .* α8 .^ 2) .* γ7 + ((3360α7) .* α8) .* γ7) - (1680 * α8 .^ 4) .* γ7) + (3360 * α8 .^ 3) .* γ7) - (1680 * α8 .^ 2) .* γ7) - (105γ4) / 2) - (105γ5) / 2) + 1
end

function constraint4_grad1(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    0
end

function constraint4_grad2(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    0
end

function constraint4_grad3(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    (((-53760 * α3 .^ 3) .* γ4 + (40320 * α3 .^ 2) .* γ4) - (10080α3) .* γ4) + 840γ4
end

function constraint4_grad4(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    (((-53760 * α4 .^ 3) .* γ5 + (40320 * α4 .^ 2) .* γ5) - (10080α4) .* γ5) + 840γ5
end

function constraint4_grad5(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    (((((-60480 * α5 .^ 3) .* γ6 + ((60480 * α5 .^ 2) .* α6) .* γ6 + (30240 * α5 .^ 2) .* γ6 + ((6720α5) .* α6 .^ 2) .* γ6) - ((33600α5) .* α6) .* γ6) - (3360α5) .* γ6) - (6720 * α6 .^ 3) .* γ6) + (3360 * α6 .^ 2) .* γ6 + (3360α6) .* γ6
end

function constraint4_grad6(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    (((((((20160 * α5 .^ 3) .* γ6 + ((6720 * α5 .^ 2) .* α6) .* γ6) - (16800 * α5 .^ 2) .* γ6) - ((20160α5) .* α6 .^ 2) .* γ6) + ((6720α5) .* α6) .* γ6 + (3360α5) .* γ6) - (6720 * α6 .^ 3) .* γ6) + (10080 * α6 .^ 2) .* γ6) - (3360α6) .* γ6
end

function constraint4_grad7(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    (((((-60480 * α7 .^ 3) .* γ7 + ((60480 * α7 .^ 2) .* α8) .* γ7 + (30240 * α7 .^ 2) .* γ7 + ((6720α7) .* α8 .^ 2) .* γ7) - ((33600α7) .* α8) .* γ7) - (3360α7) .* γ7) - (6720 * α8 .^ 3) .* γ7) + (3360 * α8 .^ 2) .* γ7 + (3360α8) .* γ7
end

function constraint4_grad8(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    (((((((20160 * α7 .^ 3) .* γ7 + ((6720 * α7 .^ 2) .* α8) .* γ7) - (16800 * α7 .^ 2) .* γ7) - ((20160α7) .* α8 .^ 2) .* γ7) + ((6720α7) .* α8) .* γ7 + (3360α7) .* γ7) - (6720 * α8 .^ 3) .* γ7) + (10080 * α8 .^ 2) .* γ7) - (3360α8) .* γ7
end

function constraint4_grad9(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    0
end

function constraint4_grad10(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    0
end

function constraint4_grad11(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    0
end

function constraint4_grad12(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    (((-13440 * α3 .^ 4 + 13440 * α3 .^ 3) - 5040 * α3 .^ 2) + 840α3) - 105 / 2
end

function constraint4_grad13(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    (((-13440 * α4 .^ 4 + 13440 * α4 .^ 3) - 5040 * α4 .^ 2) + 840α4) - 105 / 2
end

function constraint4_grad14(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    (((((((-15120 * α5 .^ 4 + (20160 * α5 .^ 3) .* α6 + 10080 * α5 .^ 3 + (3360 * α5 .^ 2) .* α6 .^ 2) - (16800 * α5 .^ 2) .* α6) - 1680 * α5 .^ 2) - (6720α5) .* α6 .^ 3) + (3360α5) .* α6 .^ 2 + (3360α5) .* α6) - 1680 * α6 .^ 4) + 3360 * α6 .^ 3) - 1680 * α6 .^ 2
end

function constraint4_grad15(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    (((((((-15120 * α7 .^ 4 + (20160 * α7 .^ 3) .* α8 + 10080 * α7 .^ 3 + (3360 * α7 .^ 2) .* α8 .^ 2) - (16800 * α7 .^ 2) .* α8) - 1680 * α7 .^ 2) - (6720α7) .* α8 .^ 3) + (3360α7) .* α8 .^ 2 + (3360α7) .* α8) - 1680 * α8 .^ 4) + 3360 * α8 .^ 3) - 1680 * α8 .^ 2
end

constraint4_grad = [constraint4_grad1,constraint4_grad2,constraint4_grad3,constraint4_grad4,constraint4_grad5,constraint4_grad6,constraint4_grad7,constraint4_grad8,constraint4_grad9,constraint4_grad10,constraint4_grad11,constraint4_grad12,constraint4_grad13,constraint4_grad14,constraint4_grad15]

function constraint5(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    (((((((((((((((((((((((((((((((((((((((((((((256 * α1 .^ 4) .* γ2 - (256 * α1 .^ 3) .* γ2) + (96 * α1 .^ 2) .* γ2) - (16α1) .* γ2) + (256 * α2 .^ 4) .* γ3) - (256 * α2 .^ 3) .* γ3) + (96 * α2 .^ 2) .* γ3) - (16α2) .* γ3) - (160 * α3 .^ 4) .* γ4) + (160 * α3 .^ 3) .* γ4) - (60 * α3 .^ 2) .* γ4) + (10α3) .* γ4) - (160 * α4 .^ 4) .* γ5) + (160 * α4 .^ 3) .* γ5) - (60 * α4 .^ 2) .* γ5) + (10α4) .* γ5) - (36 * α5 .^ 4) .* γ6) + ((560 * α5 .^ 3) .* α6) .* γ6) - (104 * α5 .^ 3) .* γ6) + ((264 * α5 .^ 2) .* α6 .^ 2) .* γ6) - ((552 * α5 .^ 2) .* α6) .* γ6) + (108 * α5 .^ 2) .* γ6) - ((16α5) .* α6 .^ 3) .* γ6) - ((120α5) .* α6 .^ 2) .* γ6) + ((168α5) .* α6) .* γ6) - (32α5) .* γ6) - (4 * α6 .^ 4) .* γ6) + (8 * α6 .^ 3) .* γ6 + (12 * α6 .^ 2) .* γ6) - (16α6) .* γ6) - (36 * α7 .^ 4) .* γ7) + ((560 * α7 .^ 3) .* α8) .* γ7) - (104 * α7 .^ 3) .* γ7) + ((264 * α7 .^ 2) .* α8 .^ 2) .* γ7) - ((552 * α7 .^ 2) .* α8) .* γ7) + (108 * α7 .^ 2) .* γ7) - ((16α7) .* α8 .^ 3) .* γ7) - ((120α7) .* α8 .^ 2) .* γ7) + ((168α7) .* α8) .* γ7) - (32α7) .* γ7) - (4 * α8 .^ 4) .* γ7) + (8 * α8 .^ 3) .* γ7 + (12 * α8 .^ 2) .* γ7) - (16α8) .* γ7) + γ2 + γ3) - (5γ4) / 8) - (5γ5) / 8) + 3γ6 + 3γ7
end

function constraint5_grad1(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    (((1024 * α1 .^ 3) .* γ2 - (768 * α1 .^ 2) .* γ2) + (192α1) .* γ2) - 16γ2
end

function constraint5_grad2(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    (((1024 * α2 .^ 3) .* γ3 - (768 * α2 .^ 2) .* γ3) + (192α2) .* γ3) - 16γ3
end

function constraint5_grad3(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    (((-640 * α3 .^ 3) .* γ4 + (480 * α3 .^ 2) .* γ4) - (120α3) .* γ4) + 10γ4
end

function constraint5_grad4(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    (((-640 * α4 .^ 3) .* γ5 + (480 * α4 .^ 2) .* γ5) - (120α4) .* γ5) + 10γ5
end

function constraint5_grad5(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    (((((((((-144 * α5 .^ 3) .* γ6 + ((1680 * α5 .^ 2) .* α6) .* γ6) - (312 * α5 .^ 2) .* γ6) + ((528α5) .* α6 .^ 2) .* γ6) - ((1104α5) .* α6) .* γ6) + (216α5) .* γ6) - (16 * α6 .^ 3) .* γ6) - (120 * α6 .^ 2) .* γ6) + (168α6) .* γ6) - 32γ6
end

function constraint5_grad6(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    ((((((((560 * α5 .^ 3) .* γ6 + ((528 * α5 .^ 2) .* α6) .* γ6) - (552 * α5 .^ 2) .* γ6) - ((48α5) .* α6 .^ 2) .* γ6) - ((240α5) .* α6) .* γ6) + (168α5) .* γ6) - (16 * α6 .^ 3) .* γ6) + (24 * α6 .^ 2) .* γ6 + (24α6) .* γ6) - 16γ6
end

function constraint5_grad7(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    (((((((((-144 * α7 .^ 3) .* γ7 + ((1680 * α7 .^ 2) .* α8) .* γ7) - (312 * α7 .^ 2) .* γ7) + ((528α7) .* α8 .^ 2) .* γ7) - ((1104α7) .* α8) .* γ7) + (216α7) .* γ7) - (16 * α8 .^ 3) .* γ7) - (120 * α8 .^ 2) .* γ7) + (168α8) .* γ7) - 32γ7
end

function constraint5_grad8(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    ((((((((560 * α7 .^ 3) .* γ7 + ((528 * α7 .^ 2) .* α8) .* γ7) - (552 * α7 .^ 2) .* γ7) - ((48α7) .* α8 .^ 2) .* γ7) - ((240α7) .* α8) .* γ7) + (168α7) .* γ7) - (16 * α8 .^ 3) .* γ7) + (24 * α8 .^ 2) .* γ7 + (24α8) .* γ7) - 16γ7
end

function constraint5_grad9(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    0
end

function constraint5_grad10(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    (((256 * α1 .^ 4 - 256 * α1 .^ 3) + 96 * α1 .^ 2) - 16α1) + 1
end

function constraint5_grad11(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    (((256 * α2 .^ 4 - 256 * α2 .^ 3) + 96 * α2 .^ 2) - 16α2) + 1
end

function constraint5_grad12(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    (((-160 * α3 .^ 4 + 160 * α3 .^ 3) - 60 * α3 .^ 2) + 10α3) - 5 / 8
end

function constraint5_grad13(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    (((-160 * α4 .^ 4 + 160 * α4 .^ 3) - 60 * α4 .^ 2) + 10α4) - 5 / 8
end

function constraint5_grad14(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    ((((((((((((-36 * α5 .^ 4 + (560 * α5 .^ 3) .* α6) - 104 * α5 .^ 3) + (264 * α5 .^ 2) .* α6 .^ 2) - (552 * α5 .^ 2) .* α6) + 108 * α5 .^ 2) - (16α5) .* α6 .^ 3) - (120α5) .* α6 .^ 2) + (168α5) .* α6) - 32α5) - 4 * α6 .^ 4) + 8 * α6 .^ 3 + 12 * α6 .^ 2) - 16α6) + 3
end

function constraint5_grad15(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    ((((((((((((-36 * α7 .^ 4 + (560 * α7 .^ 3) .* α8) - 104 * α7 .^ 3) + (264 * α7 .^ 2) .* α8 .^ 2) - (552 * α7 .^ 2) .* α8) + 108 * α7 .^ 2) - (16α7) .* α8 .^ 3) - (120α7) .* α8 .^ 2) + (168α7) .* α8) - 32α7) - 4 * α8 .^ 4) + 8 * α8 .^ 3 + 12 * α8 .^ 2) - 16α8) + 3
end

constraint5_grad = [constraint5_grad1,constraint5_grad2,constraint5_grad3,constraint5_grad4,constraint5_grad5,constraint5_grad6,constraint5_grad7,constraint5_grad8,constraint5_grad9,constraint5_grad10,constraint5_grad11,constraint5_grad12,constraint5_grad13,constraint5_grad14,constraint5_grad15]

function constraint6(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    (((((((((((((((((((((((((((((((((((((((((((((143360 * α1 .^ 5) .* γ2 - (179200 * α1 .^ 4) .* γ2) + (89600 * α1 .^ 3) .* γ2) - (22400 * α1 .^ 2) .* γ2) + (2800α1) .* γ2 + (143360 * α2 .^ 5) .* γ3) - (179200 * α2 .^ 4) .* γ3) + (89600 * α2 .^ 3) .* γ3) - (22400 * α2 .^ 2) .* γ3) + (2800α2) .* γ3 + (53760 * α5 .^ 5) .* γ6 + ((143360 * α5 .^ 4) .* α6) .* γ6) - (103040 * α5 .^ 4) .* γ6) + ((143360 * α5 .^ 3) .* α6 .^ 2) .* γ6) - ((215040 * α5 .^ 3) .* α6) .* γ6) + (78400 * α5 .^ 3) .* γ6 + ((71680 * α5 .^ 2) .* α6 .^ 3) .* γ6) - ((161280 * α5 .^ 2) .* α6 .^ 2) .* γ6) + ((120960 * α5 .^ 2) .* α6) .* γ6) - (29680 * α5 .^ 2) .* γ6) + ((17920α5) .* α6 .^ 4) .* γ6) - ((53760α5) .* α6 .^ 3) .* γ6) + ((60480α5) .* α6 .^ 2) .* γ6) - ((30240α5) .* α6) .* γ6) + (5600α5) .* γ6) - (4480 * α6 .^ 4) .* γ6) + (8960 * α6 .^ 3) .* γ6) - (7280 * α6 .^ 2) .* γ6) + (2800α6) .* γ6 + (53760 * α7 .^ 5) .* γ7 + ((143360 * α7 .^ 4) .* α8) .* γ7) - (103040 * α7 .^ 4) .* γ7) + ((143360 * α7 .^ 3) .* α8 .^ 2) .* γ7) - ((215040 * α7 .^ 3) .* α8) .* γ7) + (78400 * α7 .^ 3) .* γ7 + ((71680 * α7 .^ 2) .* α8 .^ 3) .* γ7) - ((161280 * α7 .^ 2) .* α8 .^ 2) .* γ7) + ((120960 * α7 .^ 2) .* α8) .* γ7) - (29680 * α7 .^ 2) .* γ7) + ((17920α7) .* α8 .^ 4) .* γ7) - ((53760α7) .* α8 .^ 3) .* γ7) + ((60480α7) .* α8 .^ 2) .* γ7) - ((30240α7) .* α8) .* γ7) + (5600α7) .* γ7) - (4480 * α8 .^ 4) .* γ7) + (8960 * α8 .^ 3) .* γ7) - (7280 * α8 .^ 2) .* γ7) + (2800α8) .* γ7) - 140γ2) - 140γ3) - 420γ6) - 420γ7) + 1
end

function constraint6_grad1(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    ((((716800 * α1 .^ 4) .* γ2 - (716800 * α1 .^ 3) .* γ2) + (268800 * α1 .^ 2) .* γ2) - (44800α1) .* γ2) + 2800γ2
end

function constraint6_grad2(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    ((((716800 * α2 .^ 4) .* γ3 - (716800 * α2 .^ 3) .* γ3) + (268800 * α2 .^ 2) .* γ3) - (44800α2) .* γ3) + 2800γ3
end

function constraint6_grad3(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    0
end

function constraint6_grad4(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    0
end

function constraint6_grad5(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    (((((((((((((268800 * α5 .^ 4) .* γ6 + ((573440 * α5 .^ 3) .* α6) .* γ6) - (412160 * α5 .^ 3) .* γ6) + ((430080 * α5 .^ 2) .* α6 .^ 2) .* γ6) - ((645120 * α5 .^ 2) .* α6) .* γ6) + (235200 * α5 .^ 2) .* γ6 + ((143360α5) .* α6 .^ 3) .* γ6) - ((322560α5) .* α6 .^ 2) .* γ6) + ((241920α5) .* α6) .* γ6) - (59360α5) .* γ6) + (17920 * α6 .^ 4) .* γ6) - (53760 * α6 .^ 3) .* γ6) + (60480 * α6 .^ 2) .* γ6) - (30240α6) .* γ6) + 5600γ6
end

function constraint6_grad6(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    ((((((((((((143360 * α5 .^ 4) .* γ6 + ((286720 * α5 .^ 3) .* α6) .* γ6) - (215040 * α5 .^ 3) .* γ6) + ((215040 * α5 .^ 2) .* α6 .^ 2) .* γ6) - ((322560 * α5 .^ 2) .* α6) .* γ6) + (120960 * α5 .^ 2) .* γ6 + ((71680α5) .* α6 .^ 3) .* γ6) - ((161280α5) .* α6 .^ 2) .* γ6) + ((120960α5) .* α6) .* γ6) - (30240α5) .* γ6) - (17920 * α6 .^ 3) .* γ6) + (26880 * α6 .^ 2) .* γ6) - (14560α6) .* γ6) + 2800γ6
end

function constraint6_grad7(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    (((((((((((((268800 * α7 .^ 4) .* γ7 + ((573440 * α7 .^ 3) .* α8) .* γ7) - (412160 * α7 .^ 3) .* γ7) + ((430080 * α7 .^ 2) .* α8 .^ 2) .* γ7) - ((645120 * α7 .^ 2) .* α8) .* γ7) + (235200 * α7 .^ 2) .* γ7 + ((143360α7) .* α8 .^ 3) .* γ7) - ((322560α7) .* α8 .^ 2) .* γ7) + ((241920α7) .* α8) .* γ7) - (59360α7) .* γ7) + (17920 * α8 .^ 4) .* γ7) - (53760 * α8 .^ 3) .* γ7) + (60480 * α8 .^ 2) .* γ7) - (30240α8) .* γ7) + 5600γ7
end

function constraint6_grad8(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    ((((((((((((143360 * α7 .^ 4) .* γ7 + ((286720 * α7 .^ 3) .* α8) .* γ7) - (215040 * α7 .^ 3) .* γ7) + ((215040 * α7 .^ 2) .* α8 .^ 2) .* γ7) - ((322560 * α7 .^ 2) .* α8) .* γ7) + (120960 * α7 .^ 2) .* γ7 + ((71680α7) .* α8 .^ 3) .* γ7) - ((161280α7) .* α8 .^ 2) .* γ7) + ((120960α7) .* α8) .* γ7) - (30240α7) .* γ7) - (17920 * α8 .^ 3) .* γ7) + (26880 * α8 .^ 2) .* γ7) - (14560α8) .* γ7) + 2800γ7
end

function constraint6_grad9(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    0
end

function constraint6_grad10(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    ((((143360 * α1 .^ 5 - 179200 * α1 .^ 4) + 89600 * α1 .^ 3) - 22400 * α1 .^ 2) + 2800α1) - 140
end

function constraint6_grad11(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    ((((143360 * α2 .^ 5 - 179200 * α2 .^ 4) + 89600 * α2 .^ 3) - 22400 * α2 .^ 2) + 2800α2) - 140
end

function constraint6_grad12(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    0
end

function constraint6_grad13(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    0
end

function constraint6_grad14(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    (((((((((((((((((53760 * α5 .^ 5 + (143360 * α5 .^ 4) .* α6) - 103040 * α5 .^ 4) + (143360 * α5 .^ 3) .* α6 .^ 2) - (215040 * α5 .^ 3) .* α6) + 78400 * α5 .^ 3 + (71680 * α5 .^ 2) .* α6 .^ 3) - (161280 * α5 .^ 2) .* α6 .^ 2) + (120960 * α5 .^ 2) .* α6) - 29680 * α5 .^ 2) + (17920α5) .* α6 .^ 4) - (53760α5) .* α6 .^ 3) + (60480α5) .* α6 .^ 2) - (30240α5) .* α6) + 5600α5) - 4480 * α6 .^ 4) + 8960 * α6 .^ 3) - 7280 * α6 .^ 2) + 2800α6) - 420
end

function constraint6_grad15(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    (((((((((((((((((53760 * α7 .^ 5 + (143360 * α7 .^ 4) .* α8) - 103040 * α7 .^ 4) + (143360 * α7 .^ 3) .* α8 .^ 2) - (215040 * α7 .^ 3) .* α8) + 78400 * α7 .^ 3 + (71680 * α7 .^ 2) .* α8 .^ 3) - (161280 * α7 .^ 2) .* α8 .^ 2) + (120960 * α7 .^ 2) .* α8) - 29680 * α7 .^ 2) + (17920α7) .* α8 .^ 4) - (53760α7) .* α8 .^ 3) + (60480α7) .* α8 .^ 2) - (30240α7) .* α8) + 5600α7) - 4480 * α8 .^ 4) + 8960 * α8 .^ 3) - 7280 * α8 .^ 2) + 2800α8) - 420
end

constraint6_grad = [constraint6_grad1,constraint6_grad2,constraint6_grad3,constraint6_grad4,constraint6_grad5,constraint6_grad6,constraint6_grad7,constraint6_grad8,constraint6_grad9,constraint6_grad10,constraint6_grad11,constraint6_grad12,constraint6_grad13,constraint6_grad14,constraint6_grad15]

function constraint7(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    ((((((((((((((((((((((((((((((((((((((((((((((-544320 * α5 .^ 6) .* γ6 - ((362880 * α5 .^ 5) .* α6) .* γ6) + (907200 * α5 .^ 5) .* γ6 + ((1028160 * α5 .^ 4) .* α6 .^ 2) .* γ6) - ((60480 * α5 .^ 4) .* α6) .* γ6) - (559440 * α5 .^ 4) .* γ6) + ((725760 * α5 .^ 3) .* α6 .^ 3) .* γ6) - ((1572480 * α5 .^ 3) .* α6 .^ 2) .* γ6) + ((423360 * α5 .^ 3) .* α6) .* γ6 + (151200 * α5 .^ 3) .* γ6) - ((423360 * α5 .^ 2) .* α6 .^ 4) .* γ6) - ((120960 * α5 .^ 2) .* α6 .^ 3) .* γ6) + ((635040 * α5 .^ 2) .* α6 .^ 2) .* γ6) - ((211680 * α5 .^ 2) .* α6) .* γ6) - (15120 * α5 .^ 2) .* γ6) - ((362880α5) .* α6 .^ 5) .* γ6) + ((665280α5) .* α6 .^ 4) .* γ6) - ((302400α5) .* α6 .^ 3) .* γ6) - ((30240α5) .* α6 .^ 2) .* γ6) + ((30240α5) .* α6) .* γ6) - (60480 * α6 .^ 6) .* γ6) + (181440 * α6 .^ 5) .* γ6) - (196560 * α6 .^ 4) .* γ6) + (90720 * α6 .^ 3) .* γ6) - (15120 * α6 .^ 2) .* γ6) - (544320 * α7 .^ 6) .* γ7) - ((362880 * α7 .^ 5) .* α8) .* γ7) + (907200 * α7 .^ 5) .* γ7 + ((1028160 * α7 .^ 4) .* α8 .^ 2) .* γ7) - ((60480 * α7 .^ 4) .* α8) .* γ7) - (559440 * α7 .^ 4) .* γ7) + ((725760 * α7 .^ 3) .* α8 .^ 3) .* γ7) - ((1572480 * α7 .^ 3) .* α8 .^ 2) .* γ7) + ((423360 * α7 .^ 3) .* α8) .* γ7 + (151200 * α7 .^ 3) .* γ7) - ((423360 * α7 .^ 2) .* α8 .^ 4) .* γ7) - ((120960 * α7 .^ 2) .* α8 .^ 3) .* γ7) + ((635040 * α7 .^ 2) .* α8 .^ 2) .* γ7) - ((211680 * α7 .^ 2) .* α8) .* γ7) - (15120 * α7 .^ 2) .* γ7) - ((362880α7) .* α8 .^ 5) .* γ7) + ((665280α7) .* α8 .^ 4) .* γ7) - ((302400α7) .* α8 .^ 3) .* γ7) - ((30240α7) .* α8 .^ 2) .* γ7) + ((30240α7) .* α8) .* γ7) - (60480 * α8 .^ 6) .* γ7) + (181440 * α8 .^ 5) .* γ7) - (196560 * α8 .^ 4) .* γ7) + (90720 * α8 .^ 3) .* γ7) - (15120 * α8 .^ 2) .* γ7) + 1
end

function constraint7_grad1(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    0
end

function constraint7_grad2(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    0
end

function constraint7_grad3(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    0
end

function constraint7_grad4(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    0
end

function constraint7_grad5(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    (((((((((((((((((-3265920 * α5 .^ 5) .* γ6 - ((1814400 * α5 .^ 4) .* α6) .* γ6) + (4536000 * α5 .^ 4) .* γ6 + ((4112640 * α5 .^ 3) .* α6 .^ 2) .* γ6) - ((241920 * α5 .^ 3) .* α6) .* γ6) - (2237760 * α5 .^ 3) .* γ6) + ((2177280 * α5 .^ 2) .* α6 .^ 3) .* γ6) - ((4717440 * α5 .^ 2) .* α6 .^ 2) .* γ6) + ((1270080 * α5 .^ 2) .* α6) .* γ6 + (453600 * α5 .^ 2) .* γ6) - ((846720α5) .* α6 .^ 4) .* γ6) - ((241920α5) .* α6 .^ 3) .* γ6) + ((1270080α5) .* α6 .^ 2) .* γ6) - ((423360α5) .* α6) .* γ6) - (30240α5) .* γ6) - (362880 * α6 .^ 5) .* γ6) + (665280 * α6 .^ 4) .* γ6) - (302400 * α6 .^ 3) .* γ6) - (30240 * α6 .^ 2) .* γ6) + (30240α6) .* γ6
end

function constraint7_grad6(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    (((((((((((((((((((-362880 * α5 .^ 5) .* γ6 + ((2056320 * α5 .^ 4) .* α6) .* γ6) - (60480 * α5 .^ 4) .* γ6) + ((2177280 * α5 .^ 3) .* α6 .^ 2) .* γ6) - ((3144960 * α5 .^ 3) .* α6) .* γ6) + (423360 * α5 .^ 3) .* γ6) - ((1693440 * α5 .^ 2) .* α6 .^ 3) .* γ6) - ((362880 * α5 .^ 2) .* α6 .^ 2) .* γ6) + ((1270080 * α5 .^ 2) .* α6) .* γ6) - (211680 * α5 .^ 2) .* γ6) - ((1814400α5) .* α6 .^ 4) .* γ6) + ((2661120α5) .* α6 .^ 3) .* γ6) - ((907200α5) .* α6 .^ 2) .* γ6) - ((60480α5) .* α6) .* γ6) + (30240α5) .* γ6) - (362880 * α6 .^ 5) .* γ6) + (907200 * α6 .^ 4) .* γ6) - (786240 * α6 .^ 3) .* γ6) + (272160 * α6 .^ 2) .* γ6) - (30240α6) .* γ6
end

function constraint7_grad7(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    (((((((((((((((((-3265920 * α7 .^ 5) .* γ7 - ((1814400 * α7 .^ 4) .* α8) .* γ7) + (4536000 * α7 .^ 4) .* γ7 + ((4112640 * α7 .^ 3) .* α8 .^ 2) .* γ7) - ((241920 * α7 .^ 3) .* α8) .* γ7) - (2237760 * α7 .^ 3) .* γ7) + ((2177280 * α7 .^ 2) .* α8 .^ 3) .* γ7) - ((4717440 * α7 .^ 2) .* α8 .^ 2) .* γ7) + ((1270080 * α7 .^ 2) .* α8) .* γ7 + (453600 * α7 .^ 2) .* γ7) - ((846720α7) .* α8 .^ 4) .* γ7) - ((241920α7) .* α8 .^ 3) .* γ7) + ((1270080α7) .* α8 .^ 2) .* γ7) - ((423360α7) .* α8) .* γ7) - (30240α7) .* γ7) - (362880 * α8 .^ 5) .* γ7) + (665280 * α8 .^ 4) .* γ7) - (302400 * α8 .^ 3) .* γ7) - (30240 * α8 .^ 2) .* γ7) + (30240α8) .* γ7
end

function constraint7_grad8(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    (((((((((((((((((((-362880 * α7 .^ 5) .* γ7 + ((2056320 * α7 .^ 4) .* α8) .* γ7) - (60480 * α7 .^ 4) .* γ7) + ((2177280 * α7 .^ 3) .* α8 .^ 2) .* γ7) - ((3144960 * α7 .^ 3) .* α8) .* γ7) + (423360 * α7 .^ 3) .* γ7) - ((1693440 * α7 .^ 2) .* α8 .^ 3) .* γ7) - ((362880 * α7 .^ 2) .* α8 .^ 2) .* γ7) + ((1270080 * α7 .^ 2) .* α8) .* γ7) - (211680 * α7 .^ 2) .* γ7) - ((1814400α7) .* α8 .^ 4) .* γ7) + ((2661120α7) .* α8 .^ 3) .* γ7) - ((907200α7) .* α8 .^ 2) .* γ7) - ((60480α7) .* α8) .* γ7) + (30240α7) .* γ7) - (362880 * α8 .^ 5) .* γ7) + (907200 * α8 .^ 4) .* γ7) - (786240 * α8 .^ 3) .* γ7) + (272160 * α8 .^ 2) .* γ7) - (30240α8) .* γ7
end

function constraint7_grad9(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    0
end

function constraint7_grad10(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    0
end

function constraint7_grad11(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    0
end

function constraint7_grad12(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    0
end

function constraint7_grad13(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    0
end

function constraint7_grad14(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    (((((((((((((((((((((-544320 * α5 .^ 6 - (362880 * α5 .^ 5) .* α6) + 907200 * α5 .^ 5 + (1028160 * α5 .^ 4) .* α6 .^ 2) - (60480 * α5 .^ 4) .* α6) - 559440 * α5 .^ 4) + (725760 * α5 .^ 3) .* α6 .^ 3) - (1572480 * α5 .^ 3) .* α6 .^ 2) + (423360 * α5 .^ 3) .* α6 + 151200 * α5 .^ 3) - (423360 * α5 .^ 2) .* α6 .^ 4) - (120960 * α5 .^ 2) .* α6 .^ 3) + (635040 * α5 .^ 2) .* α6 .^ 2) - (211680 * α5 .^ 2) .* α6) - 15120 * α5 .^ 2) - (362880α5) .* α6 .^ 5) + (665280α5) .* α6 .^ 4) - (302400α5) .* α6 .^ 3) - (30240α5) .* α6 .^ 2) + (30240α5) .* α6) - 60480 * α6 .^ 6) + 181440 * α6 .^ 5) - 196560 * α6 .^ 4) + 90720 * α6 .^ 3) - 15120 * α6 .^ 2
end

function constraint7_grad15(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    (((((((((((((((((((((-544320 * α7 .^ 6 - (362880 * α7 .^ 5) .* α8) + 907200 * α7 .^ 5 + (1028160 * α7 .^ 4) .* α8 .^ 2) - (60480 * α7 .^ 4) .* α8) - 559440 * α7 .^ 4) + (725760 * α7 .^ 3) .* α8 .^ 3) - (1572480 * α7 .^ 3) .* α8 .^ 2) + (423360 * α7 .^ 3) .* α8 + 151200 * α7 .^ 3) - (423360 * α7 .^ 2) .* α8 .^ 4) - (120960 * α7 .^ 2) .* α8 .^ 3) + (635040 * α7 .^ 2) .* α8 .^ 2) - (211680 * α7 .^ 2) .* α8) - 15120 * α7 .^ 2) - (362880α7) .* α8 .^ 5) + (665280α7) .* α8 .^ 4) - (302400α7) .* α8 .^ 3) - (30240α7) .* α8 .^ 2) + (30240α7) .* α8) - 60480 * α8 .^ 6) + 181440 * α8 .^ 5) - 196560 * α8 .^ 4) + 90720 * α8 .^ 3) - 15120 * α8 .^ 2
end

constraint7_grad = [constraint7_grad1,constraint7_grad2,constraint7_grad3,constraint7_grad4,constraint7_grad5,constraint7_grad6,constraint7_grad7,constraint7_grad8,constraint7_grad9,constraint7_grad10,constraint7_grad11,constraint7_grad12,constraint7_grad13,constraint7_grad14,constraint7_grad15]

function constraint8(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    ((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((4096 * α1 .^ 6) .* γ2 - (6144 * α1 .^ 5) .* γ2) + (3840 * α1 .^ 4) .* γ2) - (1280 * α1 .^ 3) .* γ2) + (240 * α1 .^ 2) .* γ2) - (24α1) .* γ2) + (4096 * α2 .^ 6) .* γ3) - (6144 * α2 .^ 5) .* γ3) + (3840 * α2 .^ 4) .* γ3) - (1280 * α2 .^ 3) .* γ3) + (240 * α2 .^ 2) .* γ3) - (24α2) .* γ3) - (1680 * α5 .^ 6) .* γ6) + ((1440 * α5 .^ 5) .* α6) .* γ6 + (2160 * α5 .^ 5) .* γ6 + ((9232 * α5 .^ 4) .* α6 .^ 2) .* γ6) - ((6416 * α5 .^ 4) .* α6) .* γ6) - (548 * α5 .^ 4) .* γ6) + ((6336 * α5 .^ 3) .* α6 .^ 3) .* γ6) - ((13984 * α5 .^ 3) .* α6 .^ 2) .* γ6) + ((6704 * α5 .^ 3) .* α6) .* γ6) - (376 * α5 .^ 3) .* γ6) - ((1136 * α5 .^ 2) .* α6 .^ 4) .* γ6) - ((3616 * α5 .^ 2) .* α6 .^ 3) .* γ6) + ((6600 * α5 .^ 2) .* α6 .^ 2) .* γ6) - ((2776 * α5 .^ 2) .* α6) .* γ6) + (244 * α5 .^ 2) .* γ6) - ((1632α5) .* α6 .^ 5) .* γ6) + ((2608α5) .* α6 .^ 4) .* γ6) - ((400α5) .* α6 .^ 3) .* γ6) - ((1000α5) .* α6 .^ 2) .* γ6) + ((472α5) .* α6) .* γ6) - (48α5) .* γ6) - (272 * α6 .^ 6) .* γ6) + (816 * α6 .^ 5) .* γ6) - (836 * α6 .^ 4) .* γ6) + (312 * α6 .^ 3) .* γ6 + (4 * α6 .^ 2) .* γ6) - (24α6) .* γ6) - (1680 * α7 .^ 6) .* γ7) + ((1440 * α7 .^ 5) .* α8) .* γ7 + (2160 * α7 .^ 5) .* γ7 + ((9232 * α7 .^ 4) .* α8 .^ 2) .* γ7) - ((6416 * α7 .^ 4) .* α8) .* γ7) - (548 * α7 .^ 4) .* γ7) + ((6336 * α7 .^ 3) .* α8 .^ 3) .* γ7) - ((13984 * α7 .^ 3) .* α8 .^ 2) .* γ7) + ((6704 * α7 .^ 3) .* α8) .* γ7) - (376 * α7 .^ 3) .* γ7) - ((1136 * α7 .^ 2) .* α8 .^ 4) .* γ7) - ((3616 * α7 .^ 2) .* α8 .^ 3) .* γ7) + ((6600 * α7 .^ 2) .* α8 .^ 2) .* γ7) - ((2776 * α7 .^ 2) .* α8) .* γ7) + (244 * α7 .^ 2) .* γ7) - ((1632α7) .* α8 .^ 5) .* γ7) + ((2608α7) .* α8 .^ 4) .* γ7) - ((400α7) .* α8 .^ 3) .* γ7) - ((1000α7) .* α8 .^ 2) .* γ7) + ((472α7) .* α8) .* γ7) - (48α7) .* γ7) - (272 * α8 .^ 6) .* γ7) + (816 * α8 .^ 5) .* γ7) - (836 * α8 .^ 4) .* γ7) + (312 * α8 .^ 3) .* γ7 + (4 * α8 .^ 2) .* γ7) - (24α8) .* γ7) + γ2 + γ3 + 3γ6 + 3γ7
end

function constraint8_grad1(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    (((((24576 * α1 .^ 5) .* γ2 - (30720 * α1 .^ 4) .* γ2) + (15360 * α1 .^ 3) .* γ2) - (3840 * α1 .^ 2) .* γ2) + (480α1) .* γ2) - 24γ2
end

function constraint8_grad2(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    (((((24576 * α2 .^ 5) .* γ3 - (30720 * α2 .^ 4) .* γ3) + (15360 * α2 .^ 3) .* γ3) - (3840 * α2 .^ 2) .* γ3) + (480α2) .* γ3) - 24γ3
end

function constraint8_grad3(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    0
end

function constraint8_grad4(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    0
end

function constraint8_grad5(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    ((((((((((((((((((-10080 * α5 .^ 5) .* γ6 + ((7200 * α5 .^ 4) .* α6) .* γ6 + (10800 * α5 .^ 4) .* γ6 + ((36928 * α5 .^ 3) .* α6 .^ 2) .* γ6) - ((25664 * α5 .^ 3) .* α6) .* γ6) - (2192 * α5 .^ 3) .* γ6) + ((19008 * α5 .^ 2) .* α6 .^ 3) .* γ6) - ((41952 * α5 .^ 2) .* α6 .^ 2) .* γ6) + ((20112 * α5 .^ 2) .* α6) .* γ6) - (1128 * α5 .^ 2) .* γ6) - ((2272α5) .* α6 .^ 4) .* γ6) - ((7232α5) .* α6 .^ 3) .* γ6) + ((13200α5) .* α6 .^ 2) .* γ6) - ((5552α5) .* α6) .* γ6) + (488α5) .* γ6) - (1632 * α6 .^ 5) .* γ6) + (2608 * α6 .^ 4) .* γ6) - (400 * α6 .^ 3) .* γ6) - (1000 * α6 .^ 2) .* γ6) + (472α6) .* γ6) - 48γ6
end

function constraint8_grad6(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    (((((((((((((((((((1440 * α5 .^ 5) .* γ6 + ((18464 * α5 .^ 4) .* α6) .* γ6) - (6416 * α5 .^ 4) .* γ6) + ((19008 * α5 .^ 3) .* α6 .^ 2) .* γ6) - ((27968 * α5 .^ 3) .* α6) .* γ6) + (6704 * α5 .^ 3) .* γ6) - ((4544 * α5 .^ 2) .* α6 .^ 3) .* γ6) - ((10848 * α5 .^ 2) .* α6 .^ 2) .* γ6) + ((13200 * α5 .^ 2) .* α6) .* γ6) - (2776 * α5 .^ 2) .* γ6) - ((8160α5) .* α6 .^ 4) .* γ6) + ((10432α5) .* α6 .^ 3) .* γ6) - ((1200α5) .* α6 .^ 2) .* γ6) - ((2000α5) .* α6) .* γ6) + (472α5) .* γ6) - (1632 * α6 .^ 5) .* γ6) + (4080 * α6 .^ 4) .* γ6) - (3344 * α6 .^ 3) .* γ6) + (936 * α6 .^ 2) .* γ6 + (8α6) .* γ6) - 24γ6
end

function constraint8_grad7(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    ((((((((((((((((((-10080 * α7 .^ 5) .* γ7 + ((7200 * α7 .^ 4) .* α8) .* γ7 + (10800 * α7 .^ 4) .* γ7 + ((36928 * α7 .^ 3) .* α8 .^ 2) .* γ7) - ((25664 * α7 .^ 3) .* α8) .* γ7) - (2192 * α7 .^ 3) .* γ7) + ((19008 * α7 .^ 2) .* α8 .^ 3) .* γ7) - ((41952 * α7 .^ 2) .* α8 .^ 2) .* γ7) + ((20112 * α7 .^ 2) .* α8) .* γ7) - (1128 * α7 .^ 2) .* γ7) - ((2272α7) .* α8 .^ 4) .* γ7) - ((7232α7) .* α8 .^ 3) .* γ7) + ((13200α7) .* α8 .^ 2) .* γ7) - ((5552α7) .* α8) .* γ7) + (488α7) .* γ7) - (1632 * α8 .^ 5) .* γ7) + (2608 * α8 .^ 4) .* γ7) - (400 * α8 .^ 3) .* γ7) - (1000 * α8 .^ 2) .* γ7) + (472α8) .* γ7) - 48γ7
end

function constraint8_grad8(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    (((((((((((((((((((1440 * α7 .^ 5) .* γ7 + ((18464 * α7 .^ 4) .* α8) .* γ7) - (6416 * α7 .^ 4) .* γ7) + ((19008 * α7 .^ 3) .* α8 .^ 2) .* γ7) - ((27968 * α7 .^ 3) .* α8) .* γ7) + (6704 * α7 .^ 3) .* γ7) - ((4544 * α7 .^ 2) .* α8 .^ 3) .* γ7) - ((10848 * α7 .^ 2) .* α8 .^ 2) .* γ7) + ((13200 * α7 .^ 2) .* α8) .* γ7) - (2776 * α7 .^ 2) .* γ7) - ((8160α7) .* α8 .^ 4) .* γ7) + ((10432α7) .* α8 .^ 3) .* γ7) - ((1200α7) .* α8 .^ 2) .* γ7) - ((2000α7) .* α8) .* γ7) + (472α7) .* γ7) - (1632 * α8 .^ 5) .* γ7) + (4080 * α8 .^ 4) .* γ7) - (3344 * α8 .^ 3) .* γ7) + (936 * α8 .^ 2) .* γ7 + (8α8) .* γ7) - 24γ7
end

function constraint8_grad9(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    0
end

function constraint8_grad10(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    (((((4096 * α1 .^ 6 - 6144 * α1 .^ 5) + 3840 * α1 .^ 4) - 1280 * α1 .^ 3) + 240 * α1 .^ 2) - 24α1) + 1
end

function constraint8_grad11(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    (((((4096 * α2 .^ 6 - 6144 * α2 .^ 5) + 3840 * α2 .^ 4) - 1280 * α2 .^ 3) + 240 * α2 .^ 2) - 24α2) + 1
end

function constraint8_grad12(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    0
end

function constraint8_grad13(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    0
end

function constraint8_grad14(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    (((((((((((((((((((((((-1680 * α5 .^ 6 + (1440 * α5 .^ 5) .* α6 + 2160 * α5 .^ 5 + (9232 * α5 .^ 4) .* α6 .^ 2) - (6416 * α5 .^ 4) .* α6) - 548 * α5 .^ 4) + (6336 * α5 .^ 3) .* α6 .^ 3) - (13984 * α5 .^ 3) .* α6 .^ 2) + (6704 * α5 .^ 3) .* α6) - 376 * α5 .^ 3) - (1136 * α5 .^ 2) .* α6 .^ 4) - (3616 * α5 .^ 2) .* α6 .^ 3) + (6600 * α5 .^ 2) .* α6 .^ 2) - (2776 * α5 .^ 2) .* α6) + 244 * α5 .^ 2) - (1632α5) .* α6 .^ 5) + (2608α5) .* α6 .^ 4) - (400α5) .* α6 .^ 3) - (1000α5) .* α6 .^ 2) + (472α5) .* α6) - 48α5) - 272 * α6 .^ 6) + 816 * α6 .^ 5) - 836 * α6 .^ 4) + 312 * α6 .^ 3 + 4 * α6 .^ 2) - 24α6) + 3
end

function constraint8_grad15(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    (((((((((((((((((((((((-1680 * α7 .^ 6 + (1440 * α7 .^ 5) .* α8 + 2160 * α7 .^ 5 + (9232 * α7 .^ 4) .* α8 .^ 2) - (6416 * α7 .^ 4) .* α8) - 548 * α7 .^ 4) + (6336 * α7 .^ 3) .* α8 .^ 3) - (13984 * α7 .^ 3) .* α8 .^ 2) + (6704 * α7 .^ 3) .* α8) - 376 * α7 .^ 3) - (1136 * α7 .^ 2) .* α8 .^ 4) - (3616 * α7 .^ 2) .* α8 .^ 3) + (6600 * α7 .^ 2) .* α8 .^ 2) - (2776 * α7 .^ 2) .* α8) + 244 * α7 .^ 2) - (1632α7) .* α8 .^ 5) + (2608α7) .* α8 .^ 4) - (400α7) .* α8 .^ 3) - (1000α7) .* α8 .^ 2) + (472α7) .* α8) - 48α7) - 272 * α8 .^ 6) + 816 * α8 .^ 5) - 836 * α8 .^ 4) + 312 * α8 .^ 3 + 4 * α8 .^ 2) - 24α8) + 3
end

constraint8_grad = [constraint8_grad1,constraint8_grad2,constraint8_grad3,constraint8_grad4,constraint8_grad5,constraint8_grad6,constraint8_grad7,constraint8_grad8,constraint8_grad9,constraint8_grad10,constraint8_grad11,constraint8_grad12,constraint8_grad13,constraint8_grad14,constraint8_grad15]

function constraint9(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    ((((((((((((((((((((((((((((((((((((((((((((((((((((((((4096 * α3 .^ 6) .* γ4 - (6144 * α3 .^ 5) .* γ4) + (3840 * α3 .^ 4) .* γ4) - (1280 * α3 .^ 3) .* γ4) + (240 * α3 .^ 2) .* γ4) - (24α3) .* γ4) + (4096 * α4 .^ 6) .* γ5) - (6144 * α4 .^ 5) .* γ5) + (3840 * α4 .^ 4) .* γ5) - (1280 * α4 .^ 3) .* γ5) + (240 * α4 .^ 2) .* γ5) - (24α4) .* γ5) - (1152 * α5 .^ 6) .* γ6) - ((9984 * α5 .^ 5) .* α6) .* γ6) + (4224 * α5 .^ 5) .* γ6 + ((9856 * α5 .^ 4) .* α6 .^ 2) .* γ6 + ((7552 * α5 .^ 4) .* α6) .* γ6) - (3584 * α5 .^ 4) .* γ6) + ((9728 * α5 .^ 3) .* α6 .^ 3) .* γ6) - ((17152 * α5 .^ 3) .* α6 .^ 2) .* γ6) + ((512 * α5 .^ 3) .* α6) .* γ6 + (1152 * α5 .^ 3) .* γ6) - ((3968 * α5 .^ 2) .* α6 .^ 4) .* γ6) - ((3328 * α5 .^ 2) .* α6 .^ 3) .* γ6) + ((7680 * α5 .^ 2) .* α6 .^ 2) .* γ6) - ((1408 * α5 .^ 2) .* α6) .* γ6) - (128 * α5 .^ 2) .* γ6) - ((3840α5) .* α6 .^ 5) .* γ6) + ((6784α5) .* α6 .^ 4) .* γ6) - ((2560α5) .* α6 .^ 3) .* γ6) - ((640α5) .* α6 .^ 2) .* γ6) + ((256α5) .* α6) .* γ6) - (640 * α6 .^ 6) .* γ6) + (1920 * α6 .^ 5) .* γ6) - (2048 * α6 .^ 4) .* γ6) + (896 * α6 .^ 3) .* γ6) - (128 * α6 .^ 2) .* γ6) - (1152 * α7 .^ 6) .* γ7) - ((9984 * α7 .^ 5) .* α8) .* γ7) + (4224 * α7 .^ 5) .* γ7 + ((9856 * α7 .^ 4) .* α8 .^ 2) .* γ7 + ((7552 * α7 .^ 4) .* α8) .* γ7) - (3584 * α7 .^ 4) .* γ7) + ((9728 * α7 .^ 3) .* α8 .^ 3) .* γ7) - ((17152 * α7 .^ 3) .* α8 .^ 2) .* γ7) + ((512 * α7 .^ 3) .* α8) .* γ7 + (1152 * α7 .^ 3) .* γ7) - ((3968 * α7 .^ 2) .* α8 .^ 4) .* γ7) - ((3328 * α7 .^ 2) .* α8 .^ 3) .* γ7) + ((7680 * α7 .^ 2) .* α8 .^ 2) .* γ7) - ((1408 * α7 .^ 2) .* α8) .* γ7) - (128 * α7 .^ 2) .* γ7) - ((3840α7) .* α8 .^ 5) .* γ7) + ((6784α7) .* α8 .^ 4) .* γ7) - ((2560α7) .* α8 .^ 3) .* γ7) - ((640α7) .* α8 .^ 2) .* γ7) + ((256α7) .* α8) .* γ7) - (640 * α8 .^ 6) .* γ7) + (1920 * α8 .^ 5) .* γ7) - (2048 * α8 .^ 4) .* γ7) + (896 * α8 .^ 3) .* γ7) - (128 * α8 .^ 2) .* γ7) + γ4 + γ5
end

function constraint9_grad1(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    0
end

function constraint9_grad2(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    0
end

function constraint9_grad3(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    (((((24576 * α3 .^ 5) .* γ4 - (30720 * α3 .^ 4) .* γ4) + (15360 * α3 .^ 3) .* γ4) - (3840 * α3 .^ 2) .* γ4) + (480α3) .* γ4) - 24γ4
end

function constraint9_grad4(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    (((((24576 * α4 .^ 5) .* γ5 - (30720 * α4 .^ 4) .* γ5) + (15360 * α4 .^ 3) .* γ5) - (3840 * α4 .^ 2) .* γ5) + (480α4) .* γ5) - 24γ5
end

function constraint9_grad5(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    ((((((((((((((((-6912 * α5 .^ 5) .* γ6 - ((49920 * α5 .^ 4) .* α6) .* γ6) + (21120 * α5 .^ 4) .* γ6 + ((39424 * α5 .^ 3) .* α6 .^ 2) .* γ6 + ((30208 * α5 .^ 3) .* α6) .* γ6) - (14336 * α5 .^ 3) .* γ6) + ((29184 * α5 .^ 2) .* α6 .^ 3) .* γ6) - ((51456 * α5 .^ 2) .* α6 .^ 2) .* γ6) + ((1536 * α5 .^ 2) .* α6) .* γ6 + (3456 * α5 .^ 2) .* γ6) - ((7936α5) .* α6 .^ 4) .* γ6) - ((6656α5) .* α6 .^ 3) .* γ6) + ((15360α5) .* α6 .^ 2) .* γ6) - ((2816α5) .* α6) .* γ6) - (256α5) .* γ6) - (3840 * α6 .^ 5) .* γ6) + (6784 * α6 .^ 4) .* γ6) - (2560 * α6 .^ 3) .* γ6) - (640 * α6 .^ 2) .* γ6) + (256α6) .* γ6
end

function constraint9_grad6(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    (((((((((((((((((-9984 * α5 .^ 5) .* γ6 + ((19712 * α5 .^ 4) .* α6) .* γ6 + (7552 * α5 .^ 4) .* γ6 + ((29184 * α5 .^ 3) .* α6 .^ 2) .* γ6) - ((34304 * α5 .^ 3) .* α6) .* γ6) + (512 * α5 .^ 3) .* γ6) - ((15872 * α5 .^ 2) .* α6 .^ 3) .* γ6) - ((9984 * α5 .^ 2) .* α6 .^ 2) .* γ6) + ((15360 * α5 .^ 2) .* α6) .* γ6) - (1408 * α5 .^ 2) .* γ6) - ((19200α5) .* α6 .^ 4) .* γ6) + ((27136α5) .* α6 .^ 3) .* γ6) - ((7680α5) .* α6 .^ 2) .* γ6) - ((1280α5) .* α6) .* γ6) + (256α5) .* γ6) - (3840 * α6 .^ 5) .* γ6) + (9600 * α6 .^ 4) .* γ6) - (8192 * α6 .^ 3) .* γ6) + (2688 * α6 .^ 2) .* γ6) - (256α6) .* γ6
end

function constraint9_grad7(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    ((((((((((((((((-6912 * α7 .^ 5) .* γ7 - ((49920 * α7 .^ 4) .* α8) .* γ7) + (21120 * α7 .^ 4) .* γ7 + ((39424 * α7 .^ 3) .* α8 .^ 2) .* γ7 + ((30208 * α7 .^ 3) .* α8) .* γ7) - (14336 * α7 .^ 3) .* γ7) + ((29184 * α7 .^ 2) .* α8 .^ 3) .* γ7) - ((51456 * α7 .^ 2) .* α8 .^ 2) .* γ7) + ((1536 * α7 .^ 2) .* α8) .* γ7 + (3456 * α7 .^ 2) .* γ7) - ((7936α7) .* α8 .^ 4) .* γ7) - ((6656α7) .* α8 .^ 3) .* γ7) + ((15360α7) .* α8 .^ 2) .* γ7) - ((2816α7) .* α8) .* γ7) - (256α7) .* γ7) - (3840 * α8 .^ 5) .* γ7) + (6784 * α8 .^ 4) .* γ7) - (2560 * α8 .^ 3) .* γ7) - (640 * α8 .^ 2) .* γ7) + (256α8) .* γ7
end

function constraint9_grad8(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    (((((((((((((((((-9984 * α7 .^ 5) .* γ7 + ((19712 * α7 .^ 4) .* α8) .* γ7 + (7552 * α7 .^ 4) .* γ7 + ((29184 * α7 .^ 3) .* α8 .^ 2) .* γ7) - ((34304 * α7 .^ 3) .* α8) .* γ7) + (512 * α7 .^ 3) .* γ7) - ((15872 * α7 .^ 2) .* α8 .^ 3) .* γ7) - ((9984 * α7 .^ 2) .* α8 .^ 2) .* γ7) + ((15360 * α7 .^ 2) .* α8) .* γ7) - (1408 * α7 .^ 2) .* γ7) - ((19200α7) .* α8 .^ 4) .* γ7) + ((27136α7) .* α8 .^ 3) .* γ7) - ((7680α7) .* α8 .^ 2) .* γ7) - ((1280α7) .* α8) .* γ7) + (256α7) .* γ7) - (3840 * α8 .^ 5) .* γ7) + (9600 * α8 .^ 4) .* γ7) - (8192 * α8 .^ 3) .* γ7) + (2688 * α8 .^ 2) .* γ7) - (256α8) .* γ7
end

function constraint9_grad9(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    0
end

function constraint9_grad10(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    0
end

function constraint9_grad11(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    0
end

function constraint9_grad12(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    (((((4096 * α3 .^ 6 - 6144 * α3 .^ 5) + 3840 * α3 .^ 4) - 1280 * α3 .^ 3) + 240 * α3 .^ 2) - 24α3) + 1
end

function constraint9_grad13(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    (((((4096 * α4 .^ 6 - 6144 * α4 .^ 5) + 3840 * α4 .^ 4) - 1280 * α4 .^ 3) + 240 * α4 .^ 2) - 24α4) + 1
end

function constraint9_grad14(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    ((((((((((((((((((((-1152 * α5 .^ 6 - (9984 * α5 .^ 5) .* α6) + 4224 * α5 .^ 5 + (9856 * α5 .^ 4) .* α6 .^ 2 + (7552 * α5 .^ 4) .* α6) - 3584 * α5 .^ 4) + (9728 * α5 .^ 3) .* α6 .^ 3) - (17152 * α5 .^ 3) .* α6 .^ 2) + (512 * α5 .^ 3) .* α6 + 1152 * α5 .^ 3) - (3968 * α5 .^ 2) .* α6 .^ 4) - (3328 * α5 .^ 2) .* α6 .^ 3) + (7680 * α5 .^ 2) .* α6 .^ 2) - (1408 * α5 .^ 2) .* α6) - 128 * α5 .^ 2) - (3840α5) .* α6 .^ 5) + (6784α5) .* α6 .^ 4) - (2560α5) .* α6 .^ 3) - (640α5) .* α6 .^ 2) + (256α5) .* α6) - 640 * α6 .^ 6) + 1920 * α6 .^ 5) - 2048 * α6 .^ 4) + 896 * α6 .^ 3) - 128 * α6 .^ 2
end

function constraint9_grad15(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    ((((((((((((((((((((-1152 * α7 .^ 6 - (9984 * α7 .^ 5) .* α8) + 4224 * α7 .^ 5 + (9856 * α7 .^ 4) .* α8 .^ 2 + (7552 * α7 .^ 4) .* α8) - 3584 * α7 .^ 4) + (9728 * α7 .^ 3) .* α8 .^ 3) - (17152 * α7 .^ 3) .* α8 .^ 2) + (512 * α7 .^ 3) .* α8 + 1152 * α7 .^ 3) - (3968 * α7 .^ 2) .* α8 .^ 4) - (3328 * α7 .^ 2) .* α8 .^ 3) + (7680 * α7 .^ 2) .* α8 .^ 2) - (1408 * α7 .^ 2) .* α8) - 128 * α7 .^ 2) - (3840α7) .* α8 .^ 5) + (6784α7) .* α8 .^ 4) - (2560α7) .* α8 .^ 3) - (640α7) .* α8 .^ 2) + (256α7) .* α8) - 640 * α8 .^ 6) + 1920 * α8 .^ 5) - 2048 * α8 .^ 4) + 896 * α8 .^ 3) - 128 * α8 .^ 2
end

constraint9_grad = [constraint9_grad1,constraint9_grad2,constraint9_grad3,constraint9_grad4,constraint9_grad5,constraint9_grad6,constraint9_grad7,constraint9_grad8,constraint9_grad9,constraint9_grad10,constraint9_grad11,constraint9_grad12,constraint9_grad13,constraint9_grad14,constraint9_grad15]

function constraint10(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    (((((((((((((((((((((((((((((((((((((((((((((((((((((3628800 * α5 .^ 7) .* γ6 + ((2419200 * α5 .^ 6) .* α6) .* γ6) - (6955200 * α5 .^ 6) .* γ6) - ((6854400 * α5 .^ 5) .* α6 .^ 2) .* γ6) - ((201600 * α5 .^ 5) .* α6) .* γ6) + (5241600 * α5 .^ 5) .* γ6) - ((4838400 * α5 .^ 4) .* α6 .^ 3) .* γ6) + ((12196800 * α5 .^ 4) .* α6 .^ 2) .* γ6) - ((2923200 * α5 .^ 4) .* α6) .* γ6) - (1940400 * α5 .^ 4) .* γ6) + ((2822400 * α5 .^ 3) .* α6 .^ 4) .* γ6 + ((2016000 * α5 .^ 3) .* α6 .^ 3) .* γ6) - ((6854400 * α5 .^ 3) .* α6 .^ 2) .* γ6) + ((2116800 * α5 .^ 3) .* α6) .* γ6 + (352800 * α5 .^ 3) .* γ6 + ((2419200 * α5 .^ 2) .* α6 .^ 5) .* γ6) - ((5140800 * α5 .^ 2) .* α6 .^ 4) .* γ6) + ((1814400 * α5 .^ 2) .* α6 .^ 3) .* γ6 + ((1260000 * α5 .^ 2) .* α6 .^ 2) .* γ6) - ((554400 * α5 .^ 2) .* α6) .* γ6) - (25200 * α5 .^ 2) .* γ6) + ((403200α5) .* α6 .^ 6) .* γ6) - ((1814400α5) .* α6 .^ 5) .* γ6) + ((2419200α5) .* α6 .^ 4) .* γ6) - ((1108800α5) .* α6 .^ 3) .* γ6) + ((50400α5) .* α6 .^ 2) .* γ6 + ((50400α5) .* α6) .* γ6) - (100800 * α6 .^ 6) .* γ6) + (302400 * α6 .^ 5) .* γ6) - (327600 * α6 .^ 4) .* γ6) + (151200 * α6 .^ 3) .* γ6) - (25200 * α6 .^ 2) .* γ6) + (3628800 * α7 .^ 7) .* γ7 + ((2419200 * α7 .^ 6) .* α8) .* γ7) - (6955200 * α7 .^ 6) .* γ7) - ((6854400 * α7 .^ 5) .* α8 .^ 2) .* γ7) - ((201600 * α7 .^ 5) .* α8) .* γ7) + (5241600 * α7 .^ 5) .* γ7) - ((4838400 * α7 .^ 4) .* α8 .^ 3) .* γ7) + ((12196800 * α7 .^ 4) .* α8 .^ 2) .* γ7) - ((2923200 * α7 .^ 4) .* α8) .* γ7) - (1940400 * α7 .^ 4) .* γ7) + ((2822400 * α7 .^ 3) .* α8 .^ 4) .* γ7 + ((2016000 * α7 .^ 3) .* α8 .^ 3) .* γ7) - ((6854400 * α7 .^ 3) .* α8 .^ 2) .* γ7) + ((2116800 * α7 .^ 3) .* α8) .* γ7 + (352800 * α7 .^ 3) .* γ7 + ((2419200 * α7 .^ 2) .* α8 .^ 5) .* γ7) - ((5140800 * α7 .^ 2) .* α8 .^ 4) .* γ7) + ((1814400 * α7 .^ 2) .* α8 .^ 3) .* γ7 + ((1260000 * α7 .^ 2) .* α8 .^ 2) .* γ7) - ((554400 * α7 .^ 2) .* α8) .* γ7) - (25200 * α7 .^ 2) .* γ7) + ((403200α7) .* α8 .^ 6) .* γ7) - ((1814400α7) .* α8 .^ 5) .* γ7) + ((2419200α7) .* α8 .^ 4) .* γ7) - ((1108800α7) .* α8 .^ 3) .* γ7) + ((50400α7) .* α8 .^ 2) .* γ7 + ((50400α7) .* α8) .* γ7) - (100800 * α8 .^ 6) .* γ7) + (302400 * α8 .^ 5) .* γ7) - (327600 * α8 .^ 4) .* γ7) + (151200 * α8 .^ 3) .* γ7) - (25200 * α8 .^ 2) .* γ7) + 1
end

function constraint10_grad1(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    0
end

function constraint10_grad2(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    0
end

function constraint10_grad3(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    0
end

function constraint10_grad4(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    0
end

function constraint10_grad5(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    (((((((((((((((((((((25401600 * α5 .^ 6) .* γ6 + ((14515200 * α5 .^ 5) .* α6) .* γ6) - (41731200 * α5 .^ 5) .* γ6) - ((34272000 * α5 .^ 4) .* α6 .^ 2) .* γ6) - ((1008000 * α5 .^ 4) .* α6) .* γ6) + (26208000 * α5 .^ 4) .* γ6) - ((19353600 * α5 .^ 3) .* α6 .^ 3) .* γ6) + ((48787200 * α5 .^ 3) .* α6 .^ 2) .* γ6) - ((11692800 * α5 .^ 3) .* α6) .* γ6) - (7761600 * α5 .^ 3) .* γ6) + ((8467200 * α5 .^ 2) .* α6 .^ 4) .* γ6 + ((6048000 * α5 .^ 2) .* α6 .^ 3) .* γ6) - ((20563200 * α5 .^ 2) .* α6 .^ 2) .* γ6) + ((6350400 * α5 .^ 2) .* α6) .* γ6 + (1058400 * α5 .^ 2) .* γ6 + ((4838400α5) .* α6 .^ 5) .* γ6) - ((10281600α5) .* α6 .^ 4) .* γ6) + ((3628800α5) .* α6 .^ 3) .* γ6 + ((2520000α5) .* α6 .^ 2) .* γ6) - ((1108800α5) .* α6) .* γ6) - (50400α5) .* γ6) + (403200 * α6 .^ 6) .* γ6) - (1814400 * α6 .^ 5) .* γ6) + (2419200 * α6 .^ 4) .* γ6) - (1108800 * α6 .^ 3) .* γ6) + (50400 * α6 .^ 2) .* γ6 + (50400α6) .* γ6
end

function constraint10_grad6(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    (((((((((((((((((((((2419200 * α5 .^ 6) .* γ6 - ((13708800 * α5 .^ 5) .* α6) .* γ6) - (201600 * α5 .^ 5) .* γ6) - ((14515200 * α5 .^ 4) .* α6 .^ 2) .* γ6) + ((24393600 * α5 .^ 4) .* α6) .* γ6) - (2923200 * α5 .^ 4) .* γ6) + ((11289600 * α5 .^ 3) .* α6 .^ 3) .* γ6 + ((6048000 * α5 .^ 3) .* α6 .^ 2) .* γ6) - ((13708800 * α5 .^ 3) .* α6) .* γ6) + (2116800 * α5 .^ 3) .* γ6 + ((12096000 * α5 .^ 2) .* α6 .^ 4) .* γ6) - ((20563200 * α5 .^ 2) .* α6 .^ 3) .* γ6) + ((5443200 * α5 .^ 2) .* α6 .^ 2) .* γ6 + ((2520000 * α5 .^ 2) .* α6) .* γ6) - (554400 * α5 .^ 2) .* γ6) + ((2419200α5) .* α6 .^ 5) .* γ6) - ((9072000α5) .* α6 .^ 4) .* γ6) + ((9676800α5) .* α6 .^ 3) .* γ6) - ((3326400α5) .* α6 .^ 2) .* γ6) + ((100800α5) .* α6) .* γ6 + (50400α5) .* γ6) - (604800 * α6 .^ 5) .* γ6) + (1512000 * α6 .^ 4) .* γ6) - (1310400 * α6 .^ 3) .* γ6) + (453600 * α6 .^ 2) .* γ6) - (50400α6) .* γ6
end

function constraint10_grad7(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    (((((((((((((((((((((25401600 * α7 .^ 6) .* γ7 + ((14515200 * α7 .^ 5) .* α8) .* γ7) - (41731200 * α7 .^ 5) .* γ7) - ((34272000 * α7 .^ 4) .* α8 .^ 2) .* γ7) - ((1008000 * α7 .^ 4) .* α8) .* γ7) + (26208000 * α7 .^ 4) .* γ7) - ((19353600 * α7 .^ 3) .* α8 .^ 3) .* γ7) + ((48787200 * α7 .^ 3) .* α8 .^ 2) .* γ7) - ((11692800 * α7 .^ 3) .* α8) .* γ7) - (7761600 * α7 .^ 3) .* γ7) + ((8467200 * α7 .^ 2) .* α8 .^ 4) .* γ7 + ((6048000 * α7 .^ 2) .* α8 .^ 3) .* γ7) - ((20563200 * α7 .^ 2) .* α8 .^ 2) .* γ7) + ((6350400 * α7 .^ 2) .* α8) .* γ7 + (1058400 * α7 .^ 2) .* γ7 + ((4838400α7) .* α8 .^ 5) .* γ7) - ((10281600α7) .* α8 .^ 4) .* γ7) + ((3628800α7) .* α8 .^ 3) .* γ7 + ((2520000α7) .* α8 .^ 2) .* γ7) - ((1108800α7) .* α8) .* γ7) - (50400α7) .* γ7) + (403200 * α8 .^ 6) .* γ7) - (1814400 * α8 .^ 5) .* γ7) + (2419200 * α8 .^ 4) .* γ7) - (1108800 * α8 .^ 3) .* γ7) + (50400 * α8 .^ 2) .* γ7 + (50400α8) .* γ7
end

function constraint10_grad8(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    (((((((((((((((((((((2419200 * α7 .^ 6) .* γ7 - ((13708800 * α7 .^ 5) .* α8) .* γ7) - (201600 * α7 .^ 5) .* γ7) - ((14515200 * α7 .^ 4) .* α8 .^ 2) .* γ7) + ((24393600 * α7 .^ 4) .* α8) .* γ7) - (2923200 * α7 .^ 4) .* γ7) + ((11289600 * α7 .^ 3) .* α8 .^ 3) .* γ7 + ((6048000 * α7 .^ 3) .* α8 .^ 2) .* γ7) - ((13708800 * α7 .^ 3) .* α8) .* γ7) + (2116800 * α7 .^ 3) .* γ7 + ((12096000 * α7 .^ 2) .* α8 .^ 4) .* γ7) - ((20563200 * α7 .^ 2) .* α8 .^ 3) .* γ7) + ((5443200 * α7 .^ 2) .* α8 .^ 2) .* γ7 + ((2520000 * α7 .^ 2) .* α8) .* γ7) - (554400 * α7 .^ 2) .* γ7) + ((2419200α7) .* α8 .^ 5) .* γ7) - ((9072000α7) .* α8 .^ 4) .* γ7) + ((9676800α7) .* α8 .^ 3) .* γ7) - ((3326400α7) .* α8 .^ 2) .* γ7) + ((100800α7) .* α8) .* γ7 + (50400α7) .* γ7) - (604800 * α8 .^ 5) .* γ7) + (1512000 * α8 .^ 4) .* γ7) - (1310400 * α8 .^ 3) .* γ7) + (453600 * α8 .^ 2) .* γ7) - (50400α8) .* γ7
end

function constraint10_grad9(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    0
end

function constraint10_grad10(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    0
end

function constraint10_grad11(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    0
end

function constraint10_grad12(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    0
end

function constraint10_grad13(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    0
end

function constraint10_grad14(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    (((((((((((((((((((((((((3628800 * α5 .^ 7 + (2419200 * α5 .^ 6) .* α6) - 6955200 * α5 .^ 6) - (6854400 * α5 .^ 5) .* α6 .^ 2) - (201600 * α5 .^ 5) .* α6) + 5241600 * α5 .^ 5) - (4838400 * α5 .^ 4) .* α6 .^ 3) + (12196800 * α5 .^ 4) .* α6 .^ 2) - (2923200 * α5 .^ 4) .* α6) - 1940400 * α5 .^ 4) + (2822400 * α5 .^ 3) .* α6 .^ 4 + (2016000 * α5 .^ 3) .* α6 .^ 3) - (6854400 * α5 .^ 3) .* α6 .^ 2) + (2116800 * α5 .^ 3) .* α6 + 352800 * α5 .^ 3 + (2419200 * α5 .^ 2) .* α6 .^ 5) - (5140800 * α5 .^ 2) .* α6 .^ 4) + (1814400 * α5 .^ 2) .* α6 .^ 3 + (1260000 * α5 .^ 2) .* α6 .^ 2) - (554400 * α5 .^ 2) .* α6) - 25200 * α5 .^ 2) + (403200α5) .* α6 .^ 6) - (1814400α5) .* α6 .^ 5) + (2419200α5) .* α6 .^ 4) - (1108800α5) .* α6 .^ 3) + (50400α5) .* α6 .^ 2 + (50400α5) .* α6) - 100800 * α6 .^ 6) + 302400 * α6 .^ 5) - 327600 * α6 .^ 4) + 151200 * α6 .^ 3) - 25200 * α6 .^ 2
end

function constraint10_grad15(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    (((((((((((((((((((((((((3628800 * α7 .^ 7 + (2419200 * α7 .^ 6) .* α8) - 6955200 * α7 .^ 6) - (6854400 * α7 .^ 5) .* α8 .^ 2) - (201600 * α7 .^ 5) .* α8) + 5241600 * α7 .^ 5) - (4838400 * α7 .^ 4) .* α8 .^ 3) + (12196800 * α7 .^ 4) .* α8 .^ 2) - (2923200 * α7 .^ 4) .* α8) - 1940400 * α7 .^ 4) + (2822400 * α7 .^ 3) .* α8 .^ 4 + (2016000 * α7 .^ 3) .* α8 .^ 3) - (6854400 * α7 .^ 3) .* α8 .^ 2) + (2116800 * α7 .^ 3) .* α8 + 352800 * α7 .^ 3 + (2419200 * α7 .^ 2) .* α8 .^ 5) - (5140800 * α7 .^ 2) .* α8 .^ 4) + (1814400 * α7 .^ 2) .* α8 .^ 3 + (1260000 * α7 .^ 2) .* α8 .^ 2) - (554400 * α7 .^ 2) .* α8) - 25200 * α7 .^ 2) + (403200α7) .* α8 .^ 6) - (1814400α7) .* α8 .^ 5) + (2419200α7) .* α8 .^ 4) - (1108800α7) .* α8 .^ 3) + (50400α7) .* α8 .^ 2 + (50400α7) .* α8) - 100800 * α8 .^ 6) + 302400 * α8 .^ 5) - 327600 * α8 .^ 4) + 151200 * α8 .^ 3) - 25200 * α8 .^ 2
end

constraint10_grad = [constraint10_grad1,constraint10_grad2,constraint10_grad3,constraint10_grad4,constraint10_grad5,constraint10_grad6,constraint10_grad7,constraint10_grad8,constraint10_grad9,constraint10_grad10,constraint10_grad11,constraint10_grad12,constraint10_grad13,constraint10_grad14,constraint10_grad15]

function constraint11(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    ((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((-16384 * α1 .^ 7) .* γ2 + (28672 * α1 .^ 6) .* γ2) - (21504 * α1 .^ 5) .* γ2) + (8960 * α1 .^ 4) .* γ2) - (2240 * α1 .^ 3) .* γ2) + (336 * α1 .^ 2) .* γ2) - (28α1) .* γ2) - (16384 * α2 .^ 7) .* γ3) + (28672 * α2 .^ 6) .* γ3) - (21504 * α2 .^ 5) .* γ3) + (8960 * α2 .^ 4) .* γ3) - (2240 * α2 .^ 3) .* γ3) + (336 * α2 .^ 2) .* γ3) - (28α2) .* γ3) + (9792 * α5 .^ 7) .* γ6) - ((1664 * α5 .^ 6) .* α6) .* γ6) - (16720 * α5 .^ 6) .* γ6) - ((38976 * α5 .^ 5) .* α6 .^ 2) .* γ6) + ((21984 * α5 .^ 5) .* α6) .* γ6 + (9792 * α5 .^ 5) .* γ6) - ((29440 * α5 .^ 4) .* α6 .^ 3) .* γ6) + ((70800 * α5 .^ 4) .* α6 .^ 2) .* γ6) - ((31440 * α5 .^ 4) .* α6) .* γ6) - (1460 * α5 .^ 4) .* γ6) + ((3520 * α5 .^ 3) .* α6 .^ 4) .* γ6 + ((25920 * α5 .^ 3) .* α6 .^ 3) .* γ6) - ((45120 * α5 .^ 3) .* α6 .^ 2) .* γ6) + ((18000 * α5 .^ 3) .* α6) .* γ6) - (760 * α5 .^ 3) .* γ6) + ((6528 * α5 .^ 2) .* α6 .^ 5) .* γ6) - ((10800 * α5 .^ 2) .* α6 .^ 4) .* γ6) - ((4320 * α5 .^ 2) .* α6 .^ 3) .* γ6) + ((12360 * α5 .^ 2) .* α6 .^ 2) .* γ6) - ((4920 * α5 .^ 2) .* α6) .* γ6) + (360 * α5 .^ 2) .* γ6 + ((1088α5) .* α6 .^ 6) .* γ6) - ((4896α5) .* α6 .^ 5) .* γ6) + ((5760α5) .* α6 .^ 4) .* γ6) - ((1200α5) .* α6 .^ 3) .* γ6) - ((1320α5) .* α6 .^ 2) .* γ6) + ((624α5) .* α6) .* γ6) - (56α5) .* γ6) - (272 * α6 .^ 6) .* γ6) + (816 * α6 .^ 5) .* γ6) - (820 * α6 .^ 4) .* γ6) + (280 * α6 .^ 3) .* γ6 + (24 * α6 .^ 2) .* γ6) - (28α6) .* γ6) + (9792 * α7 .^ 7) .* γ7) - ((1664 * α7 .^ 6) .* α8) .* γ7) - (16720 * α7 .^ 6) .* γ7) - ((38976 * α7 .^ 5) .* α8 .^ 2) .* γ7) + ((21984 * α7 .^ 5) .* α8) .* γ7 + (9792 * α7 .^ 5) .* γ7) - ((29440 * α7 .^ 4) .* α8 .^ 3) .* γ7) + ((70800 * α7 .^ 4) .* α8 .^ 2) .* γ7) - ((31440 * α7 .^ 4) .* α8) .* γ7) - (1460 * α7 .^ 4) .* γ7) + ((3520 * α7 .^ 3) .* α8 .^ 4) .* γ7 + ((25920 * α7 .^ 3) .* α8 .^ 3) .* γ7) - ((45120 * α7 .^ 3) .* α8 .^ 2) .* γ7) + ((18000 * α7 .^ 3) .* α8) .* γ7) - (760 * α7 .^ 3) .* γ7) + ((6528 * α7 .^ 2) .* α8 .^ 5) .* γ7) - ((10800 * α7 .^ 2) .* α8 .^ 4) .* γ7) - ((4320 * α7 .^ 2) .* α8 .^ 3) .* γ7) + ((12360 * α7 .^ 2) .* α8 .^ 2) .* γ7) - ((4920 * α7 .^ 2) .* α8) .* γ7) + (360 * α7 .^ 2) .* γ7 + ((1088α7) .* α8 .^ 6) .* γ7) - ((4896α7) .* α8 .^ 5) .* γ7) + ((5760α7) .* α8 .^ 4) .* γ7) - ((1200α7) .* α8 .^ 3) .* γ7) - ((1320α7) .* α8 .^ 2) .* γ7) + ((624α7) .* α8) .* γ7) - (56α7) .* γ7) - (272 * α8 .^ 6) .* γ7) + (816 * α8 .^ 5) .* γ7) - (820 * α8 .^ 4) .* γ7) + (280 * α8 .^ 3) .* γ7 + (24 * α8 .^ 2) .* γ7) - (28α8) .* γ7) + γ2 + γ3 + 3γ6 + 3γ7
end

function constraint11_grad1(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    ((((((-114688 * α1 .^ 6) .* γ2 + (172032 * α1 .^ 5) .* γ2) - (107520 * α1 .^ 4) .* γ2) + (35840 * α1 .^ 3) .* γ2) - (6720 * α1 .^ 2) .* γ2) + (672α1) .* γ2) - 28γ2
end

function constraint11_grad2(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    ((((((-114688 * α2 .^ 6) .* γ3 + (172032 * α2 .^ 5) .* γ3) - (107520 * α2 .^ 4) .* γ3) + (35840 * α2 .^ 3) .* γ3) - (6720 * α2 .^ 2) .* γ3) + (672α2) .* γ3) - 28γ3
end

function constraint11_grad3(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    0
end

function constraint11_grad4(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    0
end

function constraint11_grad5(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    ((((((((((((((((((((((((68544 * α5 .^ 6) .* γ6 - ((9984 * α5 .^ 5) .* α6) .* γ6) - (100320 * α5 .^ 5) .* γ6) - ((194880 * α5 .^ 4) .* α6 .^ 2) .* γ6) + ((109920 * α5 .^ 4) .* α6) .* γ6 + (48960 * α5 .^ 4) .* γ6) - ((117760 * α5 .^ 3) .* α6 .^ 3) .* γ6) + ((283200 * α5 .^ 3) .* α6 .^ 2) .* γ6) - ((125760 * α5 .^ 3) .* α6) .* γ6) - (5840 * α5 .^ 3) .* γ6) + ((10560 * α5 .^ 2) .* α6 .^ 4) .* γ6 + ((77760 * α5 .^ 2) .* α6 .^ 3) .* γ6) - ((135360 * α5 .^ 2) .* α6 .^ 2) .* γ6) + ((54000 * α5 .^ 2) .* α6) .* γ6) - (2280 * α5 .^ 2) .* γ6) + ((13056α5) .* α6 .^ 5) .* γ6) - ((21600α5) .* α6 .^ 4) .* γ6) - ((8640α5) .* α6 .^ 3) .* γ6) + ((24720α5) .* α6 .^ 2) .* γ6) - ((9840α5) .* α6) .* γ6) + (720α5) .* γ6 + (1088 * α6 .^ 6) .* γ6) - (4896 * α6 .^ 5) .* γ6) + (5760 * α6 .^ 4) .* γ6) - (1200 * α6 .^ 3) .* γ6) - (1320 * α6 .^ 2) .* γ6) + (624α6) .* γ6) - 56γ6
end

function constraint11_grad6(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    (((((((((((((((((((((((-1664 * α5 .^ 6) .* γ6 - ((77952 * α5 .^ 5) .* α6) .* γ6) + (21984 * α5 .^ 5) .* γ6) - ((88320 * α5 .^ 4) .* α6 .^ 2) .* γ6) + ((141600 * α5 .^ 4) .* α6) .* γ6) - (31440 * α5 .^ 4) .* γ6) + ((14080 * α5 .^ 3) .* α6 .^ 3) .* γ6 + ((77760 * α5 .^ 3) .* α6 .^ 2) .* γ6) - ((90240 * α5 .^ 3) .* α6) .* γ6) + (18000 * α5 .^ 3) .* γ6 + ((32640 * α5 .^ 2) .* α6 .^ 4) .* γ6) - ((43200 * α5 .^ 2) .* α6 .^ 3) .* γ6) - ((12960 * α5 .^ 2) .* α6 .^ 2) .* γ6) + ((24720 * α5 .^ 2) .* α6) .* γ6) - (4920 * α5 .^ 2) .* γ6) + ((6528α5) .* α6 .^ 5) .* γ6) - ((24480α5) .* α6 .^ 4) .* γ6) + ((23040α5) .* α6 .^ 3) .* γ6) - ((3600α5) .* α6 .^ 2) .* γ6) - ((2640α5) .* α6) .* γ6) + (624α5) .* γ6) - (1632 * α6 .^ 5) .* γ6) + (4080 * α6 .^ 4) .* γ6) - (3280 * α6 .^ 3) .* γ6) + (840 * α6 .^ 2) .* γ6 + (48α6) .* γ6) - 28γ6
end

function constraint11_grad7(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    ((((((((((((((((((((((((68544 * α7 .^ 6) .* γ7 - ((9984 * α7 .^ 5) .* α8) .* γ7) - (100320 * α7 .^ 5) .* γ7) - ((194880 * α7 .^ 4) .* α8 .^ 2) .* γ7) + ((109920 * α7 .^ 4) .* α8) .* γ7 + (48960 * α7 .^ 4) .* γ7) - ((117760 * α7 .^ 3) .* α8 .^ 3) .* γ7) + ((283200 * α7 .^ 3) .* α8 .^ 2) .* γ7) - ((125760 * α7 .^ 3) .* α8) .* γ7) - (5840 * α7 .^ 3) .* γ7) + ((10560 * α7 .^ 2) .* α8 .^ 4) .* γ7 + ((77760 * α7 .^ 2) .* α8 .^ 3) .* γ7) - ((135360 * α7 .^ 2) .* α8 .^ 2) .* γ7) + ((54000 * α7 .^ 2) .* α8) .* γ7) - (2280 * α7 .^ 2) .* γ7) + ((13056α7) .* α8 .^ 5) .* γ7) - ((21600α7) .* α8 .^ 4) .* γ7) - ((8640α7) .* α8 .^ 3) .* γ7) + ((24720α7) .* α8 .^ 2) .* γ7) - ((9840α7) .* α8) .* γ7) + (720α7) .* γ7 + (1088 * α8 .^ 6) .* γ7) - (4896 * α8 .^ 5) .* γ7) + (5760 * α8 .^ 4) .* γ7) - (1200 * α8 .^ 3) .* γ7) - (1320 * α8 .^ 2) .* γ7) + (624α8) .* γ7) - 56γ7
end

function constraint11_grad8(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    (((((((((((((((((((((((-1664 * α7 .^ 6) .* γ7 - ((77952 * α7 .^ 5) .* α8) .* γ7) + (21984 * α7 .^ 5) .* γ7) - ((88320 * α7 .^ 4) .* α8 .^ 2) .* γ7) + ((141600 * α7 .^ 4) .* α8) .* γ7) - (31440 * α7 .^ 4) .* γ7) + ((14080 * α7 .^ 3) .* α8 .^ 3) .* γ7 + ((77760 * α7 .^ 3) .* α8 .^ 2) .* γ7) - ((90240 * α7 .^ 3) .* α8) .* γ7) + (18000 * α7 .^ 3) .* γ7 + ((32640 * α7 .^ 2) .* α8 .^ 4) .* γ7) - ((43200 * α7 .^ 2) .* α8 .^ 3) .* γ7) - ((12960 * α7 .^ 2) .* α8 .^ 2) .* γ7) + ((24720 * α7 .^ 2) .* α8) .* γ7) - (4920 * α7 .^ 2) .* γ7) + ((6528α7) .* α8 .^ 5) .* γ7) - ((24480α7) .* α8 .^ 4) .* γ7) + ((23040α7) .* α8 .^ 3) .* γ7) - ((3600α7) .* α8 .^ 2) .* γ7) - ((2640α7) .* α8) .* γ7) + (624α7) .* γ7) - (1632 * α8 .^ 5) .* γ7) + (4080 * α8 .^ 4) .* γ7) - (3280 * α8 .^ 3) .* γ7) + (840 * α8 .^ 2) .* γ7 + (48α8) .* γ7) - 28γ7
end

function constraint11_grad9(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    0
end

function constraint11_grad10(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    ((((((-16384 * α1 .^ 7 + 28672 * α1 .^ 6) - 21504 * α1 .^ 5) + 8960 * α1 .^ 4) - 2240 * α1 .^ 3) + 336 * α1 .^ 2) - 28α1) + 1
end

function constraint11_grad11(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    ((((((-16384 * α2 .^ 7 + 28672 * α2 .^ 6) - 21504 * α2 .^ 5) + 8960 * α2 .^ 4) - 2240 * α2 .^ 3) + 336 * α2 .^ 2) - 28α2) + 1
end

function constraint11_grad12(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    0
end

function constraint11_grad13(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    0
end

function constraint11_grad14(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    (((((((((((((((((((((((((((((9792 * α5 .^ 7 - (1664 * α5 .^ 6) .* α6) - 16720 * α5 .^ 6) - (38976 * α5 .^ 5) .* α6 .^ 2) + (21984 * α5 .^ 5) .* α6 + 9792 * α5 .^ 5) - (29440 * α5 .^ 4) .* α6 .^ 3) + (70800 * α5 .^ 4) .* α6 .^ 2) - (31440 * α5 .^ 4) .* α6) - 1460 * α5 .^ 4) + (3520 * α5 .^ 3) .* α6 .^ 4 + (25920 * α5 .^ 3) .* α6 .^ 3) - (45120 * α5 .^ 3) .* α6 .^ 2) + (18000 * α5 .^ 3) .* α6) - 760 * α5 .^ 3) + (6528 * α5 .^ 2) .* α6 .^ 5) - (10800 * α5 .^ 2) .* α6 .^ 4) - (4320 * α5 .^ 2) .* α6 .^ 3) + (12360 * α5 .^ 2) .* α6 .^ 2) - (4920 * α5 .^ 2) .* α6) + 360 * α5 .^ 2 + (1088α5) .* α6 .^ 6) - (4896α5) .* α6 .^ 5) + (5760α5) .* α6 .^ 4) - (1200α5) .* α6 .^ 3) - (1320α5) .* α6 .^ 2) + (624α5) .* α6) - 56α5) - 272 * α6 .^ 6) + 816 * α6 .^ 5) - 820 * α6 .^ 4) + 280 * α6 .^ 3 + 24 * α6 .^ 2) - 28α6) + 3
end

function constraint11_grad15(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    (((((((((((((((((((((((((((((9792 * α7 .^ 7 - (1664 * α7 .^ 6) .* α8) - 16720 * α7 .^ 6) - (38976 * α7 .^ 5) .* α8 .^ 2) + (21984 * α7 .^ 5) .* α8 + 9792 * α7 .^ 5) - (29440 * α7 .^ 4) .* α8 .^ 3) + (70800 * α7 .^ 4) .* α8 .^ 2) - (31440 * α7 .^ 4) .* α8) - 1460 * α7 .^ 4) + (3520 * α7 .^ 3) .* α8 .^ 4 + (25920 * α7 .^ 3) .* α8 .^ 3) - (45120 * α7 .^ 3) .* α8 .^ 2) + (18000 * α7 .^ 3) .* α8) - 760 * α7 .^ 3) + (6528 * α7 .^ 2) .* α8 .^ 5) - (10800 * α7 .^ 2) .* α8 .^ 4) - (4320 * α7 .^ 2) .* α8 .^ 3) + (12360 * α7 .^ 2) .* α8 .^ 2) - (4920 * α7 .^ 2) .* α8) + 360 * α7 .^ 2 + (1088α7) .* α8 .^ 6) - (4896α7) .* α8 .^ 5) + (5760α7) .* α8 .^ 4) - (1200α7) .* α8 .^ 3) - (1320α7) .* α8 .^ 2) + (624α7) .* α8) - 56α7) - 272 * α8 .^ 6) + 816 * α8 .^ 5) - 820 * α8 .^ 4) + 280 * α8 .^ 3 + 24 * α8 .^ 2) - 28α8) + 3
end

constraint11_grad = [constraint11_grad1,constraint11_grad2,constraint11_grad3,constraint11_grad4,constraint11_grad5,constraint11_grad6,constraint11_grad7,constraint11_grad8,constraint11_grad9,constraint11_grad10,constraint11_grad11,constraint11_grad12,constraint11_grad13,constraint11_grad14,constraint11_grad15]

function constraint12(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    ((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((-29937600 * α5 .^ 8) .* γ6 + (59875200 * α5 .^ 7) .* γ6 + ((79833600 * α5 .^ 6) .* α6 .^ 2) .* γ6) - ((39916800 * α5 .^ 6) .* α6) .* γ6) - (47401200 * α5 .^ 6) .* γ6) + ((8870400 * α5 .^ 5) .* α6 .^ 3) .* γ6) - ((126403200 * α5 .^ 5) .* α6 .^ 2) .* γ6) + ((61538400 * α5 .^ 5) .* α6) .* γ6 + (18572400 * α5 .^ 5) .* γ6) - ((68745600 * α5 .^ 4) .* α6 .^ 4) .* γ6) + ((57657600 * α5 .^ 4) .* α6 .^ 3) .* γ6 + ((57380400 * α5 .^ 4) .* α6 .^ 2) .* γ6) - ((35204400 * α5 .^ 4) .* α6) .* γ6) - (3603600 * α5 .^ 4) .* γ6) - ((17740800 * α5 .^ 3) .* α6 .^ 5) .* γ6) + ((90921600 * α5 .^ 3) .* α6 .^ 4) .* γ6) - ((74289600 * α5 .^ 3) .* α6 .^ 3) .* γ6) - ((554400 * α5 .^ 3) .* α6 .^ 2) .* γ6) + ((8870400 * α5 .^ 3) .* α6) .* γ6 + (277200 * α5 .^ 3) .* γ6 + ((17740800 * α5 .^ 2) .* α6 .^ 6) .* γ6) - ((13305600 * α5 .^ 2) .* α6 .^ 5) .* γ6) - ((25779600 * α5 .^ 2) .* α6 .^ 4) .* γ6) + ((27165600 * α5 .^ 2) .* α6 .^ 3) .* γ6) - ((4989600 * α5 .^ 2) .* α6 .^ 2) .* γ6) - ((831600 * α5 .^ 2) .* α6) .* γ6) + ((8870400α5) .* α6 .^ 7) .* γ6) - ((24393600α5) .* α6 .^ 6) .* γ6) + ((21621600α5) .* α6 .^ 5) .* γ6) - ((4712400α5) .* α6 .^ 4) .* γ6) - ((2217600α5) .* α6 .^ 3) .* γ6) + ((831600α5) .* α6 .^ 2) .* γ6 + (1108800 * α6 .^ 8) .* γ6) - (4435200 * α6 .^ 7) .* γ6) + (6930000 * α6 .^ 6) .* γ6) - (5266800 * α6 .^ 5) .* γ6) + (1940400 * α6 .^ 4) .* γ6) - (277200 * α6 .^ 3) .* γ6) - (29937600 * α7 .^ 8) .* γ7) + (59875200 * α7 .^ 7) .* γ7 + ((79833600 * α7 .^ 6) .* α8 .^ 2) .* γ7) - ((39916800 * α7 .^ 6) .* α8) .* γ7) - (47401200 * α7 .^ 6) .* γ7) + ((8870400 * α7 .^ 5) .* α8 .^ 3) .* γ7) - ((126403200 * α7 .^ 5) .* α8 .^ 2) .* γ7) + ((61538400 * α7 .^ 5) .* α8) .* γ7 + (18572400 * α7 .^ 5) .* γ7) - ((68745600 * α7 .^ 4) .* α8 .^ 4) .* γ7) + ((57657600 * α7 .^ 4) .* α8 .^ 3) .* γ7 + ((57380400 * α7 .^ 4) .* α8 .^ 2) .* γ7) - ((35204400 * α7 .^ 4) .* α8) .* γ7) - (3603600 * α7 .^ 4) .* γ7) - ((17740800 * α7 .^ 3) .* α8 .^ 5) .* γ7) + ((90921600 * α7 .^ 3) .* α8 .^ 4) .* γ7) - ((74289600 * α7 .^ 3) .* α8 .^ 3) .* γ7) - ((554400 * α7 .^ 3) .* α8 .^ 2) .* γ7) + ((8870400 * α7 .^ 3) .* α8) .* γ7 + (277200 * α7 .^ 3) .* γ7 + ((17740800 * α7 .^ 2) .* α8 .^ 6) .* γ7) - ((13305600 * α7 .^ 2) .* α8 .^ 5) .* γ7) - ((25779600 * α7 .^ 2) .* α8 .^ 4) .* γ7) + ((27165600 * α7 .^ 2) .* α8 .^ 3) .* γ7) - ((4989600 * α7 .^ 2) .* α8 .^ 2) .* γ7) - ((831600 * α7 .^ 2) .* α8) .* γ7) + ((8870400α7) .* α8 .^ 7) .* γ7) - ((24393600α7) .* α8 .^ 6) .* γ7) + ((21621600α7) .* α8 .^ 5) .* γ7) - ((4712400α7) .* α8 .^ 4) .* γ7) - ((2217600α7) .* α8 .^ 3) .* γ7) + ((831600α7) .* α8 .^ 2) .* γ7 + (1108800 * α8 .^ 8) .* γ7) - (4435200 * α8 .^ 7) .* γ7) + (6930000 * α8 .^ 6) .* γ7) - (5266800 * α8 .^ 5) .* γ7) + (1940400 * α8 .^ 4) .* γ7) - (277200 * α8 .^ 3) .* γ7) + 1
end

function constraint12_grad1(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    0
end

function constraint12_grad2(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    0
end

function constraint12_grad3(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    0
end

function constraint12_grad4(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    0
end

function constraint12_grad5(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    ((((((((((((((((((((((((((-239500800 * α5 .^ 7) .* γ6 + (419126400 * α5 .^ 6) .* γ6 + ((479001600 * α5 .^ 5) .* α6 .^ 2) .* γ6) - ((239500800 * α5 .^ 5) .* α6) .* γ6) - (284407200 * α5 .^ 5) .* γ6) + ((44352000 * α5 .^ 4) .* α6 .^ 3) .* γ6) - ((632016000 * α5 .^ 4) .* α6 .^ 2) .* γ6) + ((307692000 * α5 .^ 4) .* α6) .* γ6 + (92862000 * α5 .^ 4) .* γ6) - ((274982400 * α5 .^ 3) .* α6 .^ 4) .* γ6) + ((230630400 * α5 .^ 3) .* α6 .^ 3) .* γ6 + ((229521600 * α5 .^ 3) .* α6 .^ 2) .* γ6) - ((140817600 * α5 .^ 3) .* α6) .* γ6) - (14414400 * α5 .^ 3) .* γ6) - ((53222400 * α5 .^ 2) .* α6 .^ 5) .* γ6) + ((272764800 * α5 .^ 2) .* α6 .^ 4) .* γ6) - ((222868800 * α5 .^ 2) .* α6 .^ 3) .* γ6) - ((1663200 * α5 .^ 2) .* α6 .^ 2) .* γ6) + ((26611200 * α5 .^ 2) .* α6) .* γ6 + (831600 * α5 .^ 2) .* γ6 + ((35481600α5) .* α6 .^ 6) .* γ6) - ((26611200α5) .* α6 .^ 5) .* γ6) - ((51559200α5) .* α6 .^ 4) .* γ6) + ((54331200α5) .* α6 .^ 3) .* γ6) - ((9979200α5) .* α6 .^ 2) .* γ6) - ((1663200α5) .* α6) .* γ6) + (8870400 * α6 .^ 7) .* γ6) - (24393600 * α6 .^ 6) .* γ6) + (21621600 * α6 .^ 5) .* γ6) - (4712400 * α6 .^ 4) .* γ6) - (2217600 * α6 .^ 3) .* γ6) + (831600 * α6 .^ 2) .* γ6
end

function constraint12_grad6(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    (((((((((((((((((((((((((((((159667200 * α5 .^ 6) .* α6) .* γ6 - (39916800 * α5 .^ 6) .* γ6) + ((26611200 * α5 .^ 5) .* α6 .^ 2) .* γ6) - ((252806400 * α5 .^ 5) .* α6) .* γ6) + (61538400 * α5 .^ 5) .* γ6) - ((274982400 * α5 .^ 4) .* α6 .^ 3) .* γ6) + ((172972800 * α5 .^ 4) .* α6 .^ 2) .* γ6 + ((114760800 * α5 .^ 4) .* α6) .* γ6) - (35204400 * α5 .^ 4) .* γ6) - ((88704000 * α5 .^ 3) .* α6 .^ 4) .* γ6) + ((363686400 * α5 .^ 3) .* α6 .^ 3) .* γ6) - ((222868800 * α5 .^ 3) .* α6 .^ 2) .* γ6) - ((1108800 * α5 .^ 3) .* α6) .* γ6) + (8870400 * α5 .^ 3) .* γ6 + ((106444800 * α5 .^ 2) .* α6 .^ 5) .* γ6) - ((66528000 * α5 .^ 2) .* α6 .^ 4) .* γ6) - ((103118400 * α5 .^ 2) .* α6 .^ 3) .* γ6) + ((81496800 * α5 .^ 2) .* α6 .^ 2) .* γ6) - ((9979200 * α5 .^ 2) .* α6) .* γ6) - (831600 * α5 .^ 2) .* γ6) + ((62092800α5) .* α6 .^ 6) .* γ6) - ((146361600α5) .* α6 .^ 5) .* γ6) + ((108108000α5) .* α6 .^ 4) .* γ6) - ((18849600α5) .* α6 .^ 3) .* γ6) - ((6652800α5) .* α6 .^ 2) .* γ6) + ((1663200α5) .* α6) .* γ6 + (8870400 * α6 .^ 7) .* γ6) - (31046400 * α6 .^ 6) .* γ6) + (41580000 * α6 .^ 5) .* γ6) - (26334000 * α6 .^ 4) .* γ6) + (7761600 * α6 .^ 3) .* γ6) - (831600 * α6 .^ 2) .* γ6
end

function constraint12_grad7(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    ((((((((((((((((((((((((((-239500800 * α7 .^ 7) .* γ7 + (419126400 * α7 .^ 6) .* γ7 + ((479001600 * α7 .^ 5) .* α8 .^ 2) .* γ7) - ((239500800 * α7 .^ 5) .* α8) .* γ7) - (284407200 * α7 .^ 5) .* γ7) + ((44352000 * α7 .^ 4) .* α8 .^ 3) .* γ7) - ((632016000 * α7 .^ 4) .* α8 .^ 2) .* γ7) + ((307692000 * α7 .^ 4) .* α8) .* γ7 + (92862000 * α7 .^ 4) .* γ7) - ((274982400 * α7 .^ 3) .* α8 .^ 4) .* γ7) + ((230630400 * α7 .^ 3) .* α8 .^ 3) .* γ7 + ((229521600 * α7 .^ 3) .* α8 .^ 2) .* γ7) - ((140817600 * α7 .^ 3) .* α8) .* γ7) - (14414400 * α7 .^ 3) .* γ7) - ((53222400 * α7 .^ 2) .* α8 .^ 5) .* γ7) + ((272764800 * α7 .^ 2) .* α8 .^ 4) .* γ7) - ((222868800 * α7 .^ 2) .* α8 .^ 3) .* γ7) - ((1663200 * α7 .^ 2) .* α8 .^ 2) .* γ7) + ((26611200 * α7 .^ 2) .* α8) .* γ7 + (831600 * α7 .^ 2) .* γ7 + ((35481600α7) .* α8 .^ 6) .* γ7) - ((26611200α7) .* α8 .^ 5) .* γ7) - ((51559200α7) .* α8 .^ 4) .* γ7) + ((54331200α7) .* α8 .^ 3) .* γ7) - ((9979200α7) .* α8 .^ 2) .* γ7) - ((1663200α7) .* α8) .* γ7) + (8870400 * α8 .^ 7) .* γ7) - (24393600 * α8 .^ 6) .* γ7) + (21621600 * α8 .^ 5) .* γ7) - (4712400 * α8 .^ 4) .* γ7) - (2217600 * α8 .^ 3) .* γ7) + (831600 * α8 .^ 2) .* γ7
end

function constraint12_grad8(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    (((((((((((((((((((((((((((((159667200 * α7 .^ 6) .* α8) .* γ7 - (39916800 * α7 .^ 6) .* γ7) + ((26611200 * α7 .^ 5) .* α8 .^ 2) .* γ7) - ((252806400 * α7 .^ 5) .* α8) .* γ7) + (61538400 * α7 .^ 5) .* γ7) - ((274982400 * α7 .^ 4) .* α8 .^ 3) .* γ7) + ((172972800 * α7 .^ 4) .* α8 .^ 2) .* γ7 + ((114760800 * α7 .^ 4) .* α8) .* γ7) - (35204400 * α7 .^ 4) .* γ7) - ((88704000 * α7 .^ 3) .* α8 .^ 4) .* γ7) + ((363686400 * α7 .^ 3) .* α8 .^ 3) .* γ7) - ((222868800 * α7 .^ 3) .* α8 .^ 2) .* γ7) - ((1108800 * α7 .^ 3) .* α8) .* γ7) + (8870400 * α7 .^ 3) .* γ7 + ((106444800 * α7 .^ 2) .* α8 .^ 5) .* γ7) - ((66528000 * α7 .^ 2) .* α8 .^ 4) .* γ7) - ((103118400 * α7 .^ 2) .* α8 .^ 3) .* γ7) + ((81496800 * α7 .^ 2) .* α8 .^ 2) .* γ7) - ((9979200 * α7 .^ 2) .* α8) .* γ7) - (831600 * α7 .^ 2) .* γ7) + ((62092800α7) .* α8 .^ 6) .* γ7) - ((146361600α7) .* α8 .^ 5) .* γ7) + ((108108000α7) .* α8 .^ 4) .* γ7) - ((18849600α7) .* α8 .^ 3) .* γ7) - ((6652800α7) .* α8 .^ 2) .* γ7) + ((1663200α7) .* α8) .* γ7 + (8870400 * α8 .^ 7) .* γ7) - (31046400 * α8 .^ 6) .* γ7) + (41580000 * α8 .^ 5) .* γ7) - (26334000 * α8 .^ 4) .* γ7) + (7761600 * α8 .^ 3) .* γ7) - (831600 * α8 .^ 2) .* γ7
end

function constraint12_grad9(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    0
end

function constraint12_grad10(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    0
end

function constraint12_grad11(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    0
end

function constraint12_grad12(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    0
end

function constraint12_grad13(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    0
end

function constraint12_grad14(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    ((((((((((((((((((((((((((((((-29937600 * α5 .^ 8 + 59875200 * α5 .^ 7 + (79833600 * α5 .^ 6) .* α6 .^ 2) - (39916800 * α5 .^ 6) .* α6) - 47401200 * α5 .^ 6) + (8870400 * α5 .^ 5) .* α6 .^ 3) - (126403200 * α5 .^ 5) .* α6 .^ 2) + (61538400 * α5 .^ 5) .* α6 + 18572400 * α5 .^ 5) - (68745600 * α5 .^ 4) .* α6 .^ 4) + (57657600 * α5 .^ 4) .* α6 .^ 3 + (57380400 * α5 .^ 4) .* α6 .^ 2) - (35204400 * α5 .^ 4) .* α6) - 3603600 * α5 .^ 4) - (17740800 * α5 .^ 3) .* α6 .^ 5) + (90921600 * α5 .^ 3) .* α6 .^ 4) - (74289600 * α5 .^ 3) .* α6 .^ 3) - (554400 * α5 .^ 3) .* α6 .^ 2) + (8870400 * α5 .^ 3) .* α6 + 277200 * α5 .^ 3 + (17740800 * α5 .^ 2) .* α6 .^ 6) - (13305600 * α5 .^ 2) .* α6 .^ 5) - (25779600 * α5 .^ 2) .* α6 .^ 4) + (27165600 * α5 .^ 2) .* α6 .^ 3) - (4989600 * α5 .^ 2) .* α6 .^ 2) - (831600 * α5 .^ 2) .* α6) + (8870400α5) .* α6 .^ 7) - (24393600α5) .* α6 .^ 6) + (21621600α5) .* α6 .^ 5) - (4712400α5) .* α6 .^ 4) - (2217600α5) .* α6 .^ 3) + (831600α5) .* α6 .^ 2 + 1108800 * α6 .^ 8) - 4435200 * α6 .^ 7) + 6930000 * α6 .^ 6) - 5266800 * α6 .^ 5) + 1940400 * α6 .^ 4) - 277200 * α6 .^ 3
end

function constraint12_grad15(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    ((((((((((((((((((((((((((((((-29937600 * α7 .^ 8 + 59875200 * α7 .^ 7 + (79833600 * α7 .^ 6) .* α8 .^ 2) - (39916800 * α7 .^ 6) .* α8) - 47401200 * α7 .^ 6) + (8870400 * α7 .^ 5) .* α8 .^ 3) - (126403200 * α7 .^ 5) .* α8 .^ 2) + (61538400 * α7 .^ 5) .* α8 + 18572400 * α7 .^ 5) - (68745600 * α7 .^ 4) .* α8 .^ 4) + (57657600 * α7 .^ 4) .* α8 .^ 3 + (57380400 * α7 .^ 4) .* α8 .^ 2) - (35204400 * α7 .^ 4) .* α8) - 3603600 * α7 .^ 4) - (17740800 * α7 .^ 3) .* α8 .^ 5) + (90921600 * α7 .^ 3) .* α8 .^ 4) - (74289600 * α7 .^ 3) .* α8 .^ 3) - (554400 * α7 .^ 3) .* α8 .^ 2) + (8870400 * α7 .^ 3) .* α8 + 277200 * α7 .^ 3 + (17740800 * α7 .^ 2) .* α8 .^ 6) - (13305600 * α7 .^ 2) .* α8 .^ 5) - (25779600 * α7 .^ 2) .* α8 .^ 4) + (27165600 * α7 .^ 2) .* α8 .^ 3) - (4989600 * α7 .^ 2) .* α8 .^ 2) - (831600 * α7 .^ 2) .* α8) + (8870400α7) .* α8 .^ 7) - (24393600α7) .* α8 .^ 6) + (21621600α7) .* α8 .^ 5) - (4712400α7) .* α8 .^ 4) - (2217600α7) .* α8 .^ 3) + (831600α7) .* α8 .^ 2 + 1108800 * α8 .^ 8) - 4435200 * α8 .^ 7) + 6930000 * α8 .^ 6) - 5266800 * α8 .^ 5) + 1940400 * α8 .^ 4) - 277200 * α8 .^ 3
end

constraint12_grad = [constraint12_grad1,constraint12_grad2,constraint12_grad3,constraint12_grad4,constraint12_grad5,constraint12_grad6,constraint12_grad7,constraint12_grad8,constraint12_grad9,constraint12_grad10,constraint12_grad11,constraint12_grad12,constraint12_grad13,constraint12_grad14,constraint12_grad15]

function constraint13(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    ((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((65536 * α1 .^ 8) .* γ2 - (131072 * α1 .^ 7) .* γ2) + (114688 * α1 .^ 6) .* γ2) - (57344 * α1 .^ 5) .* γ2) + (17920 * α1 .^ 4) .* γ2) - (3584 * α1 .^ 3) .* γ2) + (448 * α1 .^ 2) .* γ2) - (32α1) .* γ2) + (65536 * α2 .^ 8) .* γ3) - (131072 * α2 .^ 7) .* γ3) + (114688 * α2 .^ 6) .* γ3) - (57344 * α2 .^ 5) .* γ3) + (17920 * α2 .^ 4) .* γ3) - (3584 * α2 .^ 3) .* γ3) + (448 * α2 .^ 2) .* γ3) - (32α2) .* γ3) + (167568 * α5 .^ 8) .* γ6) - ((198656 * α5 .^ 7) .* α6) .* γ6) - (285472 * α5 .^ 7) .* γ6) - ((640384 * α5 .^ 6) .* α6 .^ 2) .* γ6) + ((667840 * α5 .^ 6) .* α6) .* γ6 + (166308 * α5 .^ 6) .* γ6 + ((363136 * α5 .^ 5) .* α6 .^ 3) .* γ6 + ((688224 * α5 .^ 5) .* α6 .^ 2) .* γ6) - ((672936 * α5 .^ 5) .* α6) .* γ6) - (27076 * α5 .^ 5) .* γ6) + ((923296 * α5 .^ 4) .* α6 .^ 4) .* γ6) - ((1377216 * α5 .^ 4) .* α6 .^ 3) .* γ6) + ((86316 * α5 .^ 4) .* α6 .^ 2) .* γ6 + ((266004 * α5 .^ 4) .* α6) .* γ6) - (8164 * α5 .^ 4) .* γ6) + ((82688 * α5 .^ 3) .* α6 .^ 5) .* γ6) - ((1026656 * α5 .^ 3) .* α6 .^ 4) .* γ6) + ((1201936 * α5 .^ 3) .* α6 .^ 3) .* γ6) - ((329256 * α5 .^ 3) .* α6 .^ 2) .* γ6) - ((25344 * α5 .^ 3) .* α6) .* γ6) + (2900 * α5 .^ 3) .* γ6) - ((333568 * α5 .^ 2) .* α6 .^ 6) .* γ6) + ((438336 * α5 .^ 2) .* α6 .^ 5) .* γ6 + ((111036 * α5 .^ 2) .* α6 .^ 4) .* γ6) - ((337496 * α5 .^ 2) .* α6 .^ 3) .* γ6) + ((125016 * α5 .^ 2) .* α6 .^ 2) .* γ6) - ((8700 * α5 .^ 2) .* α6) .* γ6) - ((148864α5) .* α6 .^ 7) .* γ6) + ((427296α5) .* α6 .^ 6) .* γ6) - ((430056α5) .* α6 .^ 5) .* γ6) + ((160684α5) .* α6 .^ 4) .* γ6 + ((2016α5) .* α6 .^ 3) .* γ6) - ((12804α5) .* α6 .^ 2) .* γ6) + ((1792α5) .* α6) .* γ6) - (64α5) .* γ6) - (18608 * α6 .^ 8) .* γ6) + (74432 * α6 .^ 7) .* γ6) - (118540 * α6 .^ 6) .* γ6) + (95108 * α6 .^ 5) .* γ6) - (39764 * α6 .^ 4) .* γ6) + (7852 * α6 .^ 3) .* γ6) - (448 * α6 .^ 2) .* γ6) - (32α6) .* γ6) + (167568 * α7 .^ 8) .* γ7) - ((198656 * α7 .^ 7) .* α8) .* γ7) - (285472 * α7 .^ 7) .* γ7) - ((640384 * α7 .^ 6) .* α8 .^ 2) .* γ7) + ((667840 * α7 .^ 6) .* α8) .* γ7 + (166308 * α7 .^ 6) .* γ7 + ((363136 * α7 .^ 5) .* α8 .^ 3) .* γ7 + ((688224 * α7 .^ 5) .* α8 .^ 2) .* γ7) - ((672936 * α7 .^ 5) .* α8) .* γ7) - (27076 * α7 .^ 5) .* γ7) + ((923296 * α7 .^ 4) .* α8 .^ 4) .* γ7) - ((1377216 * α7 .^ 4) .* α8 .^ 3) .* γ7) + ((86316 * α7 .^ 4) .* α8 .^ 2) .* γ7 + ((266004 * α7 .^ 4) .* α8) .* γ7) - (8164 * α7 .^ 4) .* γ7) + ((82688 * α7 .^ 3) .* α8 .^ 5) .* γ7) - ((1026656 * α7 .^ 3) .* α8 .^ 4) .* γ7) + ((1201936 * α7 .^ 3) .* α8 .^ 3) .* γ7) - ((329256 * α7 .^ 3) .* α8 .^ 2) .* γ7) - ((25344 * α7 .^ 3) .* α8) .* γ7) + (2900 * α7 .^ 3) .* γ7) - ((333568 * α7 .^ 2) .* α8 .^ 6) .* γ7) + ((438336 * α7 .^ 2) .* α8 .^ 5) .* γ7 + ((111036 * α7 .^ 2) .* α8 .^ 4) .* γ7) - ((337496 * α7 .^ 2) .* α8 .^ 3) .* γ7) + ((125016 * α7 .^ 2) .* α8 .^ 2) .* γ7) - ((8700 * α7 .^ 2) .* α8) .* γ7) - ((148864α7) .* α8 .^ 7) .* γ7) + ((427296α7) .* α8 .^ 6) .* γ7) - ((430056α7) .* α8 .^ 5) .* γ7) + ((160684α7) .* α8 .^ 4) .* γ7 + ((2016α7) .* α8 .^ 3) .* γ7) - ((12804α7) .* α8 .^ 2) .* γ7) + ((1792α7) .* α8) .* γ7) - (64α7) .* γ7) - (18608 * α8 .^ 8) .* γ7) + (74432 * α8 .^ 7) .* γ7) - (118540 * α8 .^ 6) .* γ7) + (95108 * α8 .^ 5) .* γ7) - (39764 * α8 .^ 4) .* γ7) + (7852 * α8 .^ 3) .* γ7) - (448 * α8 .^ 2) .* γ7) - (32α8) .* γ7) + γ2 + γ3 + 3γ6 + 3γ7
end

function constraint13_grad1(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    (((((((524288 * α1 .^ 7) .* γ2 - (917504 * α1 .^ 6) .* γ2) + (688128 * α1 .^ 5) .* γ2) - (286720 * α1 .^ 4) .* γ2) + (71680 * α1 .^ 3) .* γ2) - (10752 * α1 .^ 2) .* γ2) + (896α1) .* γ2) - 32γ2
end

function constraint13_grad2(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    (((((((524288 * α2 .^ 7) .* γ3 - (917504 * α2 .^ 6) .* γ3) + (688128 * α2 .^ 5) .* γ3) - (286720 * α2 .^ 4) .* γ3) + (71680 * α2 .^ 3) .* γ3) - (10752 * α2 .^ 2) .* γ3) + (896α2) .* γ3) - 32γ3
end

function constraint13_grad3(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    0
end

function constraint13_grad4(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    0
end

function constraint13_grad5(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    ((((((((((((((((((((((((((((1340544 * α5 .^ 7) .* γ6 - ((1390592 * α5 .^ 6) .* α6) .* γ6) - (1998304 * α5 .^ 6) .* γ6) - ((3842304 * α5 .^ 5) .* α6 .^ 2) .* γ6) + ((4007040 * α5 .^ 5) .* α6) .* γ6 + (997848 * α5 .^ 5) .* γ6 + ((1815680 * α5 .^ 4) .* α6 .^ 3) .* γ6 + ((3441120 * α5 .^ 4) .* α6 .^ 2) .* γ6) - ((3364680 * α5 .^ 4) .* α6) .* γ6) - (135380 * α5 .^ 4) .* γ6) + ((3693184 * α5 .^ 3) .* α6 .^ 4) .* γ6) - ((5508864 * α5 .^ 3) .* α6 .^ 3) .* γ6) + ((345264 * α5 .^ 3) .* α6 .^ 2) .* γ6 + ((1064016 * α5 .^ 3) .* α6) .* γ6) - (32656 * α5 .^ 3) .* γ6) + ((248064 * α5 .^ 2) .* α6 .^ 5) .* γ6) - ((3079968 * α5 .^ 2) .* α6 .^ 4) .* γ6) + ((3605808 * α5 .^ 2) .* α6 .^ 3) .* γ6) - ((987768 * α5 .^ 2) .* α6 .^ 2) .* γ6) - ((76032 * α5 .^ 2) .* α6) .* γ6) + (8700 * α5 .^ 2) .* γ6) - ((667136α5) .* α6 .^ 6) .* γ6) + ((876672α5) .* α6 .^ 5) .* γ6 + ((222072α5) .* α6 .^ 4) .* γ6) - ((674992α5) .* α6 .^ 3) .* γ6) + ((250032α5) .* α6 .^ 2) .* γ6) - ((17400α5) .* α6) .* γ6) - (148864 * α6 .^ 7) .* γ6) + (427296 * α6 .^ 6) .* γ6) - (430056 * α6 .^ 5) .* γ6) + (160684 * α6 .^ 4) .* γ6 + (2016 * α6 .^ 3) .* γ6) - (12804 * α6 .^ 2) .* γ6) + (1792α6) .* γ6) - 64γ6
end

function constraint13_grad6(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    (((((((((((((((((((((((((((((-198656 * α5 .^ 7) .* γ6 - ((1280768 * α5 .^ 6) .* α6) .* γ6) + (667840 * α5 .^ 6) .* γ6 + ((1089408 * α5 .^ 5) .* α6 .^ 2) .* γ6 + ((1376448 * α5 .^ 5) .* α6) .* γ6) - (672936 * α5 .^ 5) .* γ6) + ((3693184 * α5 .^ 4) .* α6 .^ 3) .* γ6) - ((4131648 * α5 .^ 4) .* α6 .^ 2) .* γ6) + ((172632 * α5 .^ 4) .* α6) .* γ6 + (266004 * α5 .^ 4) .* γ6 + ((413440 * α5 .^ 3) .* α6 .^ 4) .* γ6) - ((4106624 * α5 .^ 3) .* α6 .^ 3) .* γ6) + ((3605808 * α5 .^ 3) .* α6 .^ 2) .* γ6) - ((658512 * α5 .^ 3) .* α6) .* γ6) - (25344 * α5 .^ 3) .* γ6) - ((2001408 * α5 .^ 2) .* α6 .^ 5) .* γ6) + ((2191680 * α5 .^ 2) .* α6 .^ 4) .* γ6 + ((444144 * α5 .^ 2) .* α6 .^ 3) .* γ6) - ((1012488 * α5 .^ 2) .* α6 .^ 2) .* γ6) + ((250032 * α5 .^ 2) .* α6) .* γ6) - (8700 * α5 .^ 2) .* γ6) - ((1042048α5) .* α6 .^ 6) .* γ6) + ((2563776α5) .* α6 .^ 5) .* γ6) - ((2150280α5) .* α6 .^ 4) .* γ6) + ((642736α5) .* α6 .^ 3) .* γ6 + ((6048α5) .* α6 .^ 2) .* γ6) - ((25608α5) .* α6) .* γ6) + (1792α5) .* γ6) - (148864 * α6 .^ 7) .* γ6) + (521024 * α6 .^ 6) .* γ6) - (711240 * α6 .^ 5) .* γ6) + (475540 * α6 .^ 4) .* γ6) - (159056 * α6 .^ 3) .* γ6) + (23556 * α6 .^ 2) .* γ6) - (896α6) .* γ6) - 32γ6
end

function constraint13_grad7(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    ((((((((((((((((((((((((((((1340544 * α7 .^ 7) .* γ7 - ((1390592 * α7 .^ 6) .* α8) .* γ7) - (1998304 * α7 .^ 6) .* γ7) - ((3842304 * α7 .^ 5) .* α8 .^ 2) .* γ7) + ((4007040 * α7 .^ 5) .* α8) .* γ7 + (997848 * α7 .^ 5) .* γ7 + ((1815680 * α7 .^ 4) .* α8 .^ 3) .* γ7 + ((3441120 * α7 .^ 4) .* α8 .^ 2) .* γ7) - ((3364680 * α7 .^ 4) .* α8) .* γ7) - (135380 * α7 .^ 4) .* γ7) + ((3693184 * α7 .^ 3) .* α8 .^ 4) .* γ7) - ((5508864 * α7 .^ 3) .* α8 .^ 3) .* γ7) + ((345264 * α7 .^ 3) .* α8 .^ 2) .* γ7 + ((1064016 * α7 .^ 3) .* α8) .* γ7) - (32656 * α7 .^ 3) .* γ7) + ((248064 * α7 .^ 2) .* α8 .^ 5) .* γ7) - ((3079968 * α7 .^ 2) .* α8 .^ 4) .* γ7) + ((3605808 * α7 .^ 2) .* α8 .^ 3) .* γ7) - ((987768 * α7 .^ 2) .* α8 .^ 2) .* γ7) - ((76032 * α7 .^ 2) .* α8) .* γ7) + (8700 * α7 .^ 2) .* γ7) - ((667136α7) .* α8 .^ 6) .* γ7) + ((876672α7) .* α8 .^ 5) .* γ7 + ((222072α7) .* α8 .^ 4) .* γ7) - ((674992α7) .* α8 .^ 3) .* γ7) + ((250032α7) .* α8 .^ 2) .* γ7) - ((17400α7) .* α8) .* γ7) - (148864 * α8 .^ 7) .* γ7) + (427296 * α8 .^ 6) .* γ7) - (430056 * α8 .^ 5) .* γ7) + (160684 * α8 .^ 4) .* γ7 + (2016 * α8 .^ 3) .* γ7) - (12804 * α8 .^ 2) .* γ7) + (1792α8) .* γ7) - 64γ7
end

function constraint13_grad8(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    (((((((((((((((((((((((((((((-198656 * α7 .^ 7) .* γ7 - ((1280768 * α7 .^ 6) .* α8) .* γ7) + (667840 * α7 .^ 6) .* γ7 + ((1089408 * α7 .^ 5) .* α8 .^ 2) .* γ7 + ((1376448 * α7 .^ 5) .* α8) .* γ7) - (672936 * α7 .^ 5) .* γ7) + ((3693184 * α7 .^ 4) .* α8 .^ 3) .* γ7) - ((4131648 * α7 .^ 4) .* α8 .^ 2) .* γ7) + ((172632 * α7 .^ 4) .* α8) .* γ7 + (266004 * α7 .^ 4) .* γ7 + ((413440 * α7 .^ 3) .* α8 .^ 4) .* γ7) - ((4106624 * α7 .^ 3) .* α8 .^ 3) .* γ7) + ((3605808 * α7 .^ 3) .* α8 .^ 2) .* γ7) - ((658512 * α7 .^ 3) .* α8) .* γ7) - (25344 * α7 .^ 3) .* γ7) - ((2001408 * α7 .^ 2) .* α8 .^ 5) .* γ7) + ((2191680 * α7 .^ 2) .* α8 .^ 4) .* γ7 + ((444144 * α7 .^ 2) .* α8 .^ 3) .* γ7) - ((1012488 * α7 .^ 2) .* α8 .^ 2) .* γ7) + ((250032 * α7 .^ 2) .* α8) .* γ7) - (8700 * α7 .^ 2) .* γ7) - ((1042048α7) .* α8 .^ 6) .* γ7) + ((2563776α7) .* α8 .^ 5) .* γ7) - ((2150280α7) .* α8 .^ 4) .* γ7) + ((642736α7) .* α8 .^ 3) .* γ7 + ((6048α7) .* α8 .^ 2) .* γ7) - ((25608α7) .* α8) .* γ7) + (1792α7) .* γ7) - (148864 * α8 .^ 7) .* γ7) + (521024 * α8 .^ 6) .* γ7) - (711240 * α8 .^ 5) .* γ7) + (475540 * α8 .^ 4) .* γ7) - (159056 * α8 .^ 3) .* γ7) + (23556 * α8 .^ 2) .* γ7) - (896α8) .* γ7) - 32γ7
end

function constraint13_grad9(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    0
end

function constraint13_grad10(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    (((((((65536 * α1 .^ 8 - 131072 * α1 .^ 7) + 114688 * α1 .^ 6) - 57344 * α1 .^ 5) + 17920 * α1 .^ 4) - 3584 * α1 .^ 3) + 448 * α1 .^ 2) - 32α1) + 1
end

function constraint13_grad11(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    (((((((65536 * α2 .^ 8 - 131072 * α2 .^ 7) + 114688 * α2 .^ 6) - 57344 * α2 .^ 5) + 17920 * α2 .^ 4) - 3584 * α2 .^ 3) + 448 * α2 .^ 2) - 32α2) + 1
end

function constraint13_grad12(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    0
end

function constraint13_grad13(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    0
end

function constraint13_grad14(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    ((((((((((((((((((((((((((((((((((((167568 * α5 .^ 8 - (198656 * α5 .^ 7) .* α6) - 285472 * α5 .^ 7) - (640384 * α5 .^ 6) .* α6 .^ 2) + (667840 * α5 .^ 6) .* α6 + 166308 * α5 .^ 6 + (363136 * α5 .^ 5) .* α6 .^ 3 + (688224 * α5 .^ 5) .* α6 .^ 2) - (672936 * α5 .^ 5) .* α6) - 27076 * α5 .^ 5) + (923296 * α5 .^ 4) .* α6 .^ 4) - (1377216 * α5 .^ 4) .* α6 .^ 3) + (86316 * α5 .^ 4) .* α6 .^ 2 + (266004 * α5 .^ 4) .* α6) - 8164 * α5 .^ 4) + (82688 * α5 .^ 3) .* α6 .^ 5) - (1026656 * α5 .^ 3) .* α6 .^ 4) + (1201936 * α5 .^ 3) .* α6 .^ 3) - (329256 * α5 .^ 3) .* α6 .^ 2) - (25344 * α5 .^ 3) .* α6) + 2900 * α5 .^ 3) - (333568 * α5 .^ 2) .* α6 .^ 6) + (438336 * α5 .^ 2) .* α6 .^ 5 + (111036 * α5 .^ 2) .* α6 .^ 4) - (337496 * α5 .^ 2) .* α6 .^ 3) + (125016 * α5 .^ 2) .* α6 .^ 2) - (8700 * α5 .^ 2) .* α6) - (148864α5) .* α6 .^ 7) + (427296α5) .* α6 .^ 6) - (430056α5) .* α6 .^ 5) + (160684α5) .* α6 .^ 4 + (2016α5) .* α6 .^ 3) - (12804α5) .* α6 .^ 2) + (1792α5) .* α6) - 64α5) - 18608 * α6 .^ 8) + 74432 * α6 .^ 7) - 118540 * α6 .^ 6) + 95108 * α6 .^ 5) - 39764 * α6 .^ 4) + 7852 * α6 .^ 3) - 448 * α6 .^ 2) - 32α6) + 3
end

function constraint13_grad15(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    ((((((((((((((((((((((((((((((((((((167568 * α7 .^ 8 - (198656 * α7 .^ 7) .* α8) - 285472 * α7 .^ 7) - (640384 * α7 .^ 6) .* α8 .^ 2) + (667840 * α7 .^ 6) .* α8 + 166308 * α7 .^ 6 + (363136 * α7 .^ 5) .* α8 .^ 3 + (688224 * α7 .^ 5) .* α8 .^ 2) - (672936 * α7 .^ 5) .* α8) - 27076 * α7 .^ 5) + (923296 * α7 .^ 4) .* α8 .^ 4) - (1377216 * α7 .^ 4) .* α8 .^ 3) + (86316 * α7 .^ 4) .* α8 .^ 2 + (266004 * α7 .^ 4) .* α8) - 8164 * α7 .^ 4) + (82688 * α7 .^ 3) .* α8 .^ 5) - (1026656 * α7 .^ 3) .* α8 .^ 4) + (1201936 * α7 .^ 3) .* α8 .^ 3) - (329256 * α7 .^ 3) .* α8 .^ 2) - (25344 * α7 .^ 3) .* α8) + 2900 * α7 .^ 3) - (333568 * α7 .^ 2) .* α8 .^ 6) + (438336 * α7 .^ 2) .* α8 .^ 5 + (111036 * α7 .^ 2) .* α8 .^ 4) - (337496 * α7 .^ 2) .* α8 .^ 3) + (125016 * α7 .^ 2) .* α8 .^ 2) - (8700 * α7 .^ 2) .* α8) - (148864α7) .* α8 .^ 7) + (427296α7) .* α8 .^ 6) - (430056α7) .* α8 .^ 5) + (160684α7) .* α8 .^ 4 + (2016α7) .* α8 .^ 3) - (12804α7) .* α8 .^ 2) + (1792α7) .* α8) - 64α7) - 18608 * α8 .^ 8) + 74432 * α8 .^ 7) - 118540 * α8 .^ 6) + 95108 * α8 .^ 5) - 39764 * α8 .^ 4) + 7852 * α8 .^ 3) - 448 * α8 .^ 2) - 32α8) + 3
end

constraint13_grad = [constraint13_grad1,constraint13_grad2,constraint13_grad3,constraint13_grad4,constraint13_grad5,constraint13_grad6,constraint13_grad7,constraint13_grad8,constraint13_grad9,constraint13_grad10,constraint13_grad11,constraint13_grad12,constraint13_grad13,constraint13_grad14,constraint13_grad15]

function constraint14(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    ((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((65536 * α3 .^ 8) .* γ4 - (131072 * α3 .^ 7) .* γ4) + (114688 * α3 .^ 6) .* γ4) - (57344 * α3 .^ 5) .* γ4) + (17920 * α3 .^ 4) .* γ4) - (3584 * α3 .^ 3) .* γ4) + (448 * α3 .^ 2) .* γ4) - (32α3) .* γ4) + (65536 * α4 .^ 8) .* γ5) - (131072 * α4 .^ 7) .* γ5) + (114688 * α4 .^ 6) .* γ5) - (57344 * α4 .^ 5) .* γ5) + (17920 * α4 .^ 4) .* γ5) - (3584 * α4 .^ 3) .* γ5) + (448 * α4 .^ 2) .* γ5) - (32α4) .* γ5) - (124416 * α5 .^ 8) .* γ6) - ((110592 * α5 .^ 7) .* α6) .* γ6) + (276480 * α5 .^ 7) .* γ6 + ((497664 * α5 .^ 6) .* α6 .^ 2) .* γ6) - ((55296 * α5 .^ 6) .* α6) .* γ6) - (235008 * α5 .^ 6) .* γ6) + ((110592 * α5 .^ 5) .* α6 .^ 3) .* γ6) - ((829440 * α5 .^ 5) .* α6 .^ 2) .* γ6) + ((248832 * α5 .^ 5) .* α6) .* γ6 + (96768 * α5 .^ 5) .* γ6) - ((418816 * α5 .^ 4) .* α6 .^ 4) .* γ6) + ((280576 * α5 .^ 4) .* α6 .^ 3) .* γ6 + ((413184 * α5 .^ 4) .* α6 .^ 2) .* γ6) - ((172544 * α5 .^ 4) .* α6) .* γ6) - (19456 * α5 .^ 4) .* γ6) - ((118784 * α5 .^ 3) .* α6 .^ 5) .* γ6) + ((567296 * α5 .^ 3) .* α6 .^ 4) .* γ6) - ((423936 * α5 .^ 3) .* α6 .^ 3) .* γ6) - ((31744 * α5 .^ 3) .* α6 .^ 2) .* γ6) + ((47104 * α5 .^ 3) .* α6) .* γ6 + (1536 * α5 .^ 3) .* γ6 + ((104448 * α5 .^ 2) .* α6 .^ 6) .* γ6) - ((67584 * α5 .^ 2) .* α6 .^ 5) .* γ6) - ((170496 * α5 .^ 2) .* α6 .^ 4) .* γ6) + ((162816 * α5 .^ 2) .* α6 .^ 3) .* γ6) - ((24576 * α5 .^ 2) .* α6 .^ 2) .* γ6) - ((4608 * α5 .^ 2) .* α6) .* γ6) + ((53248α5) .* α6 .^ 7) .* γ6) - ((145408α5) .* α6 .^ 6) .* γ6) + ((125952α5) .* α6 .^ 5) .* γ6) - ((24064α5) .* α6 .^ 4) .* γ6) - ((14336α5) .* α6 .^ 3) .* γ6) + ((4608α5) .* α6 .^ 2) .* γ6 + (6656 * α6 .^ 8) .* γ6) - (26624 * α6 .^ 7) .* γ6) + (41472 * α6 .^ 6) .* γ6) - (31232 * α6 .^ 5) .* γ6) + (11264 * α6 .^ 4) .* γ6) - (1536 * α6 .^ 3) .* γ6) - (124416 * α7 .^ 8) .* γ7) - ((110592 * α7 .^ 7) .* α8) .* γ7) + (276480 * α7 .^ 7) .* γ7 + ((497664 * α7 .^ 6) .* α8 .^ 2) .* γ7) - ((55296 * α7 .^ 6) .* α8) .* γ7) - (235008 * α7 .^ 6) .* γ7) + ((110592 * α7 .^ 5) .* α8 .^ 3) .* γ7) - ((829440 * α7 .^ 5) .* α8 .^ 2) .* γ7) + ((248832 * α7 .^ 5) .* α8) .* γ7 + (96768 * α7 .^ 5) .* γ7) - ((418816 * α7 .^ 4) .* α8 .^ 4) .* γ7) + ((280576 * α7 .^ 4) .* α8 .^ 3) .* γ7 + ((413184 * α7 .^ 4) .* α8 .^ 2) .* γ7) - ((172544 * α7 .^ 4) .* α8) .* γ7) - (19456 * α7 .^ 4) .* γ7) - ((118784 * α7 .^ 3) .* α8 .^ 5) .* γ7) + ((567296 * α7 .^ 3) .* α8 .^ 4) .* γ7) - ((423936 * α7 .^ 3) .* α8 .^ 3) .* γ7) - ((31744 * α7 .^ 3) .* α8 .^ 2) .* γ7) + ((47104 * α7 .^ 3) .* α8) .* γ7 + (1536 * α7 .^ 3) .* γ7 + ((104448 * α7 .^ 2) .* α8 .^ 6) .* γ7) - ((67584 * α7 .^ 2) .* α8 .^ 5) .* γ7) - ((170496 * α7 .^ 2) .* α8 .^ 4) .* γ7) + ((162816 * α7 .^ 2) .* α8 .^ 3) .* γ7) - ((24576 * α7 .^ 2) .* α8 .^ 2) .* γ7) - ((4608 * α7 .^ 2) .* α8) .* γ7) + ((53248α7) .* α8 .^ 7) .* γ7) - ((145408α7) .* α8 .^ 6) .* γ7) + ((125952α7) .* α8 .^ 5) .* γ7) - ((24064α7) .* α8 .^ 4) .* γ7) - ((14336α7) .* α8 .^ 3) .* γ7) + ((4608α7) .* α8 .^ 2) .* γ7 + (6656 * α8 .^ 8) .* γ7) - (26624 * α8 .^ 7) .* γ7) + (41472 * α8 .^ 6) .* γ7) - (31232 * α8 .^ 5) .* γ7) + (11264 * α8 .^ 4) .* γ7) - (1536 * α8 .^ 3) .* γ7) + γ4 + γ5
end

function constraint14_grad1(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    0
end

function constraint14_grad2(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    0
end

function constraint14_grad3(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    (((((((524288 * α3 .^ 7) .* γ4 - (917504 * α3 .^ 6) .* γ4) + (688128 * α3 .^ 5) .* γ4) - (286720 * α3 .^ 4) .* γ4) + (71680 * α3 .^ 3) .* γ4) - (10752 * α3 .^ 2) .* γ4) + (896α3) .* γ4) - 32γ4
end

function constraint14_grad4(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    (((((((524288 * α4 .^ 7) .* γ5 - (917504 * α4 .^ 6) .* γ5) + (688128 * α4 .^ 5) .* γ5) - (286720 * α4 .^ 4) .* γ5) + (71680 * α4 .^ 3) .* γ5) - (10752 * α4 .^ 2) .* γ5) + (896α4) .* γ5) - 32γ5
end

function constraint14_grad5(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    (((((((((((((((((((((((((((-995328 * α5 .^ 7) .* γ6 - ((774144 * α5 .^ 6) .* α6) .* γ6) + (1935360 * α5 .^ 6) .* γ6 + ((2985984 * α5 .^ 5) .* α6 .^ 2) .* γ6) - ((331776 * α5 .^ 5) .* α6) .* γ6) - (1410048 * α5 .^ 5) .* γ6) + ((552960 * α5 .^ 4) .* α6 .^ 3) .* γ6) - ((4147200 * α5 .^ 4) .* α6 .^ 2) .* γ6) + ((1244160 * α5 .^ 4) .* α6) .* γ6 + (483840 * α5 .^ 4) .* γ6) - ((1675264 * α5 .^ 3) .* α6 .^ 4) .* γ6) + ((1122304 * α5 .^ 3) .* α6 .^ 3) .* γ6 + ((1652736 * α5 .^ 3) .* α6 .^ 2) .* γ6) - ((690176 * α5 .^ 3) .* α6) .* γ6) - (77824 * α5 .^ 3) .* γ6) - ((356352 * α5 .^ 2) .* α6 .^ 5) .* γ6) + ((1701888 * α5 .^ 2) .* α6 .^ 4) .* γ6) - ((1271808 * α5 .^ 2) .* α6 .^ 3) .* γ6) - ((95232 * α5 .^ 2) .* α6 .^ 2) .* γ6) + ((141312 * α5 .^ 2) .* α6) .* γ6 + (4608 * α5 .^ 2) .* γ6 + ((208896α5) .* α6 .^ 6) .* γ6) - ((135168α5) .* α6 .^ 5) .* γ6) - ((340992α5) .* α6 .^ 4) .* γ6) + ((325632α5) .* α6 .^ 3) .* γ6) - ((49152α5) .* α6 .^ 2) .* γ6) - ((9216α5) .* α6) .* γ6) + (53248 * α6 .^ 7) .* γ6) - (145408 * α6 .^ 6) .* γ6) + (125952 * α6 .^ 5) .* γ6) - (24064 * α6 .^ 4) .* γ6) - (14336 * α6 .^ 3) .* γ6) + (4608 * α6 .^ 2) .* γ6
end

function constraint14_grad6(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    (((((((((((((((((((((((((((((-110592 * α5 .^ 7) .* γ6 + ((995328 * α5 .^ 6) .* α6) .* γ6) - (55296 * α5 .^ 6) .* γ6) + ((331776 * α5 .^ 5) .* α6 .^ 2) .* γ6) - ((1658880 * α5 .^ 5) .* α6) .* γ6) + (248832 * α5 .^ 5) .* γ6) - ((1675264 * α5 .^ 4) .* α6 .^ 3) .* γ6) + ((841728 * α5 .^ 4) .* α6 .^ 2) .* γ6 + ((826368 * α5 .^ 4) .* α6) .* γ6) - (172544 * α5 .^ 4) .* γ6) - ((593920 * α5 .^ 3) .* α6 .^ 4) .* γ6) + ((2269184 * α5 .^ 3) .* α6 .^ 3) .* γ6) - ((1271808 * α5 .^ 3) .* α6 .^ 2) .* γ6) - ((63488 * α5 .^ 3) .* α6) .* γ6) + (47104 * α5 .^ 3) .* γ6 + ((626688 * α5 .^ 2) .* α6 .^ 5) .* γ6) - ((337920 * α5 .^ 2) .* α6 .^ 4) .* γ6) - ((681984 * α5 .^ 2) .* α6 .^ 3) .* γ6) + ((488448 * α5 .^ 2) .* α6 .^ 2) .* γ6) - ((49152 * α5 .^ 2) .* α6) .* γ6) - (4608 * α5 .^ 2) .* γ6) + ((372736α5) .* α6 .^ 6) .* γ6) - ((872448α5) .* α6 .^ 5) .* γ6) + ((629760α5) .* α6 .^ 4) .* γ6) - ((96256α5) .* α6 .^ 3) .* γ6) - ((43008α5) .* α6 .^ 2) .* γ6) + ((9216α5) .* α6) .* γ6 + (53248 * α6 .^ 7) .* γ6) - (186368 * α6 .^ 6) .* γ6) + (248832 * α6 .^ 5) .* γ6) - (156160 * α6 .^ 4) .* γ6) + (45056 * α6 .^ 3) .* γ6) - (4608 * α6 .^ 2) .* γ6
end

function constraint14_grad7(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    (((((((((((((((((((((((((((-995328 * α7 .^ 7) .* γ7 - ((774144 * α7 .^ 6) .* α8) .* γ7) + (1935360 * α7 .^ 6) .* γ7 + ((2985984 * α7 .^ 5) .* α8 .^ 2) .* γ7) - ((331776 * α7 .^ 5) .* α8) .* γ7) - (1410048 * α7 .^ 5) .* γ7) + ((552960 * α7 .^ 4) .* α8 .^ 3) .* γ7) - ((4147200 * α7 .^ 4) .* α8 .^ 2) .* γ7) + ((1244160 * α7 .^ 4) .* α8) .* γ7 + (483840 * α7 .^ 4) .* γ7) - ((1675264 * α7 .^ 3) .* α8 .^ 4) .* γ7) + ((1122304 * α7 .^ 3) .* α8 .^ 3) .* γ7 + ((1652736 * α7 .^ 3) .* α8 .^ 2) .* γ7) - ((690176 * α7 .^ 3) .* α8) .* γ7) - (77824 * α7 .^ 3) .* γ7) - ((356352 * α7 .^ 2) .* α8 .^ 5) .* γ7) + ((1701888 * α7 .^ 2) .* α8 .^ 4) .* γ7) - ((1271808 * α7 .^ 2) .* α8 .^ 3) .* γ7) - ((95232 * α7 .^ 2) .* α8 .^ 2) .* γ7) + ((141312 * α7 .^ 2) .* α8) .* γ7 + (4608 * α7 .^ 2) .* γ7 + ((208896α7) .* α8 .^ 6) .* γ7) - ((135168α7) .* α8 .^ 5) .* γ7) - ((340992α7) .* α8 .^ 4) .* γ7) + ((325632α7) .* α8 .^ 3) .* γ7) - ((49152α7) .* α8 .^ 2) .* γ7) - ((9216α7) .* α8) .* γ7) + (53248 * α8 .^ 7) .* γ7) - (145408 * α8 .^ 6) .* γ7) + (125952 * α8 .^ 5) .* γ7) - (24064 * α8 .^ 4) .* γ7) - (14336 * α8 .^ 3) .* γ7) + (4608 * α8 .^ 2) .* γ7
end

function constraint14_grad8(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    (((((((((((((((((((((((((((((-110592 * α7 .^ 7) .* γ7 + ((995328 * α7 .^ 6) .* α8) .* γ7) - (55296 * α7 .^ 6) .* γ7) + ((331776 * α7 .^ 5) .* α8 .^ 2) .* γ7) - ((1658880 * α7 .^ 5) .* α8) .* γ7) + (248832 * α7 .^ 5) .* γ7) - ((1675264 * α7 .^ 4) .* α8 .^ 3) .* γ7) + ((841728 * α7 .^ 4) .* α8 .^ 2) .* γ7 + ((826368 * α7 .^ 4) .* α8) .* γ7) - (172544 * α7 .^ 4) .* γ7) - ((593920 * α7 .^ 3) .* α8 .^ 4) .* γ7) + ((2269184 * α7 .^ 3) .* α8 .^ 3) .* γ7) - ((1271808 * α7 .^ 3) .* α8 .^ 2) .* γ7) - ((63488 * α7 .^ 3) .* α8) .* γ7) + (47104 * α7 .^ 3) .* γ7 + ((626688 * α7 .^ 2) .* α8 .^ 5) .* γ7) - ((337920 * α7 .^ 2) .* α8 .^ 4) .* γ7) - ((681984 * α7 .^ 2) .* α8 .^ 3) .* γ7) + ((488448 * α7 .^ 2) .* α8 .^ 2) .* γ7) - ((49152 * α7 .^ 2) .* α8) .* γ7) - (4608 * α7 .^ 2) .* γ7) + ((372736α7) .* α8 .^ 6) .* γ7) - ((872448α7) .* α8 .^ 5) .* γ7) + ((629760α7) .* α8 .^ 4) .* γ7) - ((96256α7) .* α8 .^ 3) .* γ7) - ((43008α7) .* α8 .^ 2) .* γ7) + ((9216α7) .* α8) .* γ7 + (53248 * α8 .^ 7) .* γ7) - (186368 * α8 .^ 6) .* γ7) + (248832 * α8 .^ 5) .* γ7) - (156160 * α8 .^ 4) .* γ7) + (45056 * α8 .^ 3) .* γ7) - (4608 * α8 .^ 2) .* γ7
end

function constraint14_grad9(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    0
end

function constraint14_grad10(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    0
end

function constraint14_grad11(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    0
end

function constraint14_grad12(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    (((((((65536 * α3 .^ 8 - 131072 * α3 .^ 7) + 114688 * α3 .^ 6) - 57344 * α3 .^ 5) + 17920 * α3 .^ 4) - 3584 * α3 .^ 3) + 448 * α3 .^ 2) - 32α3) + 1
end

function constraint14_grad13(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    (((((((65536 * α4 .^ 8 - 131072 * α4 .^ 7) + 114688 * α4 .^ 6) - 57344 * α4 .^ 5) + 17920 * α4 .^ 4) - 3584 * α4 .^ 3) + 448 * α4 .^ 2) - 32α4) + 1
end

function constraint14_grad14(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    (((((((((((((((((((((((((((((((-124416 * α5 .^ 8 - (110592 * α5 .^ 7) .* α6) + 276480 * α5 .^ 7 + (497664 * α5 .^ 6) .* α6 .^ 2) - (55296 * α5 .^ 6) .* α6) - 235008 * α5 .^ 6) + (110592 * α5 .^ 5) .* α6 .^ 3) - (829440 * α5 .^ 5) .* α6 .^ 2) + (248832 * α5 .^ 5) .* α6 + 96768 * α5 .^ 5) - (418816 * α5 .^ 4) .* α6 .^ 4) + (280576 * α5 .^ 4) .* α6 .^ 3 + (413184 * α5 .^ 4) .* α6 .^ 2) - (172544 * α5 .^ 4) .* α6) - 19456 * α5 .^ 4) - (118784 * α5 .^ 3) .* α6 .^ 5) + (567296 * α5 .^ 3) .* α6 .^ 4) - (423936 * α5 .^ 3) .* α6 .^ 3) - (31744 * α5 .^ 3) .* α6 .^ 2) + (47104 * α5 .^ 3) .* α6 + 1536 * α5 .^ 3 + (104448 * α5 .^ 2) .* α6 .^ 6) - (67584 * α5 .^ 2) .* α6 .^ 5) - (170496 * α5 .^ 2) .* α6 .^ 4) + (162816 * α5 .^ 2) .* α6 .^ 3) - (24576 * α5 .^ 2) .* α6 .^ 2) - (4608 * α5 .^ 2) .* α6) + (53248α5) .* α6 .^ 7) - (145408α5) .* α6 .^ 6) + (125952α5) .* α6 .^ 5) - (24064α5) .* α6 .^ 4) - (14336α5) .* α6 .^ 3) + (4608α5) .* α6 .^ 2 + 6656 * α6 .^ 8) - 26624 * α6 .^ 7) + 41472 * α6 .^ 6) - 31232 * α6 .^ 5) + 11264 * α6 .^ 4) - 1536 * α6 .^ 3
end

function constraint14_grad15(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    (((((((((((((((((((((((((((((((-124416 * α7 .^ 8 - (110592 * α7 .^ 7) .* α8) + 276480 * α7 .^ 7 + (497664 * α7 .^ 6) .* α8 .^ 2) - (55296 * α7 .^ 6) .* α8) - 235008 * α7 .^ 6) + (110592 * α7 .^ 5) .* α8 .^ 3) - (829440 * α7 .^ 5) .* α8 .^ 2) + (248832 * α7 .^ 5) .* α8 + 96768 * α7 .^ 5) - (418816 * α7 .^ 4) .* α8 .^ 4) + (280576 * α7 .^ 4) .* α8 .^ 3 + (413184 * α7 .^ 4) .* α8 .^ 2) - (172544 * α7 .^ 4) .* α8) - 19456 * α7 .^ 4) - (118784 * α7 .^ 3) .* α8 .^ 5) + (567296 * α7 .^ 3) .* α8 .^ 4) - (423936 * α7 .^ 3) .* α8 .^ 3) - (31744 * α7 .^ 3) .* α8 .^ 2) + (47104 * α7 .^ 3) .* α8 + 1536 * α7 .^ 3 + (104448 * α7 .^ 2) .* α8 .^ 6) - (67584 * α7 .^ 2) .* α8 .^ 5) - (170496 * α7 .^ 2) .* α8 .^ 4) + (162816 * α7 .^ 2) .* α8 .^ 3) - (24576 * α7 .^ 2) .* α8 .^ 2) - (4608 * α7 .^ 2) .* α8) + (53248α7) .* α8 .^ 7) - (145408α7) .* α8 .^ 6) + (125952α7) .* α8 .^ 5) - (24064α7) .* α8 .^ 4) - (14336α7) .* α8 .^ 3) + (4608α7) .* α8 .^ 2 + 6656 * α8 .^ 8) - 26624 * α8 .^ 7) + 41472 * α8 .^ 6) - 31232 * α8 .^ 5) + 11264 * α8 .^ 4) - 1536 * α8 .^ 3
end

constraint14_grad = [constraint14_grad1,constraint14_grad2,constraint14_grad3,constraint14_grad4,constraint14_grad5,constraint14_grad6,constraint14_grad7,constraint14_grad8,constraint14_grad9,constraint14_grad10,constraint14_grad11,constraint14_grad12,constraint14_grad13,constraint14_grad14,constraint14_grad15]

function constraint15(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    (((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((-396 * α5 .^ 8) .* γ6 + ((384 * α5 .^ 7) .* α6) .* γ6 + (696 * α5 .^ 7) .* γ6 + ((1504 * α5 .^ 6) .* α6 .^ 2) .* γ6) - ((1424 * α5 .^ 6) .* α6) .* γ6) - (431 * α5 .^ 6) .* γ6) - ((480 * α5 .^ 5) .* α6 .^ 3) .* γ6) - ((1896 * α5 .^ 5) .* α6 .^ 2) .* γ6) + ((1542 * α5 .^ 5) .* α6) .* γ6 + (87 * α5 .^ 5) .* γ6) - ((1784 * α5 .^ 4) .* α6 .^ 4) .* γ6) + ((2384 * α5 .^ 4) .* α6 .^ 3) .* γ6 + ((291 * α5 .^ 4) .* α6 .^ 2) .* γ6) - ((691 * α5 .^ 4) .* α6) .* γ6) + (16 * α5 .^ 4) .* γ6) - ((192 * α5 .^ 3) .* α6 .^ 5) .* γ6) + ((2024 * α5 .^ 3) .* α6 .^ 4) .* γ6) - ((2204 * α5 .^ 3) .* α6 .^ 3) .* γ6) + ((454 * α5 .^ 3) .* α6 .^ 2) .* γ6 + ((116 * α5 .^ 3) .* α6) .* γ6) - (9 * α5 .^ 3) .* γ6) + ((640 * α5 .^ 2) .* α6 .^ 6) .* γ6) - ((816 * α5 .^ 2) .* α6 .^ 5) .* γ6) - ((249 * α5 .^ 2) .* α6 .^ 4) .* γ6) + ((634 * α5 .^ 2) .* α6 .^ 3) .* γ6) - ((204 * α5 .^ 2) .* α6 .^ 2) .* γ6) + ((3 * α5 .^ 2) .* α6) .* γ6 + α5 .^ 2 .* γ6 + ((288α5) .* α6 .^ 7) .* γ6) - ((824α5) .* α6 .^ 6) .* γ6) + ((822α5) .* α6 .^ 5) .* γ6) - ((301α5) .* α6 .^ 4) .* γ6) - ((4α5) .* α6 .^ 3) .* γ6) + ((21α5) .* α6 .^ 2) .* γ6) - ((2α5) .* α6) .* γ6) + (36 * α6 .^ 8) .* γ6) - (144 * α6 .^ 7) .* γ6) + (229 * α6 .^ 6) .* γ6) - (183 * α6 .^ 5) .* γ6) + (76 * α6 .^ 4) .* γ6) - (15 * α6 .^ 3) .* γ6) + α6 .^ 2 .* γ6) - (396 * α7 .^ 8) .* γ7) + ((384 * α7 .^ 7) .* α8) .* γ7 + (696 * α7 .^ 7) .* γ7 + ((1504 * α7 .^ 6) .* α8 .^ 2) .* γ7) - ((1424 * α7 .^ 6) .* α8) .* γ7) - (431 * α7 .^ 6) .* γ7) - ((480 * α7 .^ 5) .* α8 .^ 3) .* γ7) - ((1896 * α7 .^ 5) .* α8 .^ 2) .* γ7) + ((1542 * α7 .^ 5) .* α8) .* γ7 + (87 * α7 .^ 5) .* γ7) - ((1784 * α7 .^ 4) .* α8 .^ 4) .* γ7) + ((2384 * α7 .^ 4) .* α8 .^ 3) .* γ7 + ((291 * α7 .^ 4) .* α8 .^ 2) .* γ7) - ((691 * α7 .^ 4) .* α8) .* γ7) + (16 * α7 .^ 4) .* γ7) - ((192 * α7 .^ 3) .* α8 .^ 5) .* γ7) + ((2024 * α7 .^ 3) .* α8 .^ 4) .* γ7) - ((2204 * α7 .^ 3) .* α8 .^ 3) .* γ7) + ((454 * α7 .^ 3) .* α8 .^ 2) .* γ7 + ((116 * α7 .^ 3) .* α8) .* γ7) - (9 * α7 .^ 3) .* γ7) + ((640 * α7 .^ 2) .* α8 .^ 6) .* γ7) - ((816 * α7 .^ 2) .* α8 .^ 5) .* γ7) - ((249 * α7 .^ 2) .* α8 .^ 4) .* γ7) + ((634 * α7 .^ 2) .* α8 .^ 3) .* γ7) - ((204 * α7 .^ 2) .* α8 .^ 2) .* γ7) + ((3 * α7 .^ 2) .* α8) .* γ7 + α7 .^ 2 .* γ7 + ((288α7) .* α8 .^ 7) .* γ7) - ((824α7) .* α8 .^ 6) .* γ7) + ((822α7) .* α8 .^ 5) .* γ7) - ((301α7) .* α8 .^ 4) .* γ7) - ((4α7) .* α8 .^ 3) .* γ7) + ((21α7) .* α8 .^ 2) .* γ7) - ((2α7) .* α8) .* γ7) + (36 * α8 .^ 8) .* γ7) - (144 * α8 .^ 7) .* γ7) + (229 * α8 .^ 6) .* γ7) - (183 * α8 .^ 5) .* γ7) + (76 * α8 .^ 4) .* γ7) - (15 * α8 .^ 3) .* γ7) + α8 .^ 2 .* γ7
end

function constraint15_grad1(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    0
end

function constraint15_grad2(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    0
end

function constraint15_grad3(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    0
end

function constraint15_grad4(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    0
end

function constraint15_grad5(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    (((((((((((((((((((((((((((-3168 * α5 .^ 7) .* γ6 + ((2688 * α5 .^ 6) .* α6) .* γ6 + (4872 * α5 .^ 6) .* γ6 + ((9024 * α5 .^ 5) .* α6 .^ 2) .* γ6) - ((8544 * α5 .^ 5) .* α6) .* γ6) - (2586 * α5 .^ 5) .* γ6) - ((2400 * α5 .^ 4) .* α6 .^ 3) .* γ6) - ((9480 * α5 .^ 4) .* α6 .^ 2) .* γ6) + ((7710 * α5 .^ 4) .* α6) .* γ6 + (435 * α5 .^ 4) .* γ6) - ((7136 * α5 .^ 3) .* α6 .^ 4) .* γ6) + ((9536 * α5 .^ 3) .* α6 .^ 3) .* γ6 + ((1164 * α5 .^ 3) .* α6 .^ 2) .* γ6) - ((2764 * α5 .^ 3) .* α6) .* γ6) + (64 * α5 .^ 3) .* γ6) - ((576 * α5 .^ 2) .* α6 .^ 5) .* γ6) + ((6072 * α5 .^ 2) .* α6 .^ 4) .* γ6) - ((6612 * α5 .^ 2) .* α6 .^ 3) .* γ6) + ((1362 * α5 .^ 2) .* α6 .^ 2) .* γ6 + ((348 * α5 .^ 2) .* α6) .* γ6) - (27 * α5 .^ 2) .* γ6) + ((1280α5) .* α6 .^ 6) .* γ6) - ((1632α5) .* α6 .^ 5) .* γ6) - ((498α5) .* α6 .^ 4) .* γ6) + ((1268α5) .* α6 .^ 3) .* γ6) - ((408α5) .* α6 .^ 2) .* γ6) + ((6α5) .* α6) .* γ6 + (2α5) .* γ6 + (288 * α6 .^ 7) .* γ6) - (824 * α6 .^ 6) .* γ6) + (822 * α6 .^ 5) .* γ6) - (301 * α6 .^ 4) .* γ6) - (4 * α6 .^ 3) .* γ6) + (21 * α6 .^ 2) .* γ6) - (2α6) .* γ6
end

function constraint15_grad6(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    ((((((((((((((((((((((((((((((384 * α5 .^ 7) .* γ6 + ((3008 * α5 .^ 6) .* α6) .* γ6) - (1424 * α5 .^ 6) .* γ6) - ((1440 * α5 .^ 5) .* α6 .^ 2) .* γ6) - ((3792 * α5 .^ 5) .* α6) .* γ6) + (1542 * α5 .^ 5) .* γ6) - ((7136 * α5 .^ 4) .* α6 .^ 3) .* γ6) + ((7152 * α5 .^ 4) .* α6 .^ 2) .* γ6 + ((582 * α5 .^ 4) .* α6) .* γ6) - (691 * α5 .^ 4) .* γ6) - ((960 * α5 .^ 3) .* α6 .^ 4) .* γ6) + ((8096 * α5 .^ 3) .* α6 .^ 3) .* γ6) - ((6612 * α5 .^ 3) .* α6 .^ 2) .* γ6) + ((908 * α5 .^ 3) .* α6) .* γ6 + (116 * α5 .^ 3) .* γ6 + ((3840 * α5 .^ 2) .* α6 .^ 5) .* γ6) - ((4080 * α5 .^ 2) .* α6 .^ 4) .* γ6) - ((996 * α5 .^ 2) .* α6 .^ 3) .* γ6) + ((1902 * α5 .^ 2) .* α6 .^ 2) .* γ6) - ((408 * α5 .^ 2) .* α6) .* γ6) + (3 * α5 .^ 2) .* γ6 + ((2016α5) .* α6 .^ 6) .* γ6) - ((4944α5) .* α6 .^ 5) .* γ6) + ((4110α5) .* α6 .^ 4) .* γ6) - ((1204α5) .* α6 .^ 3) .* γ6) - ((12α5) .* α6 .^ 2) .* γ6) + ((42α5) .* α6) .* γ6) - (2α5) .* γ6) + (288 * α6 .^ 7) .* γ6) - (1008 * α6 .^ 6) .* γ6) + (1374 * α6 .^ 5) .* γ6) - (915 * α6 .^ 4) .* γ6) + (304 * α6 .^ 3) .* γ6) - (45 * α6 .^ 2) .* γ6) + (2α6) .* γ6
end

function constraint15_grad7(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    (((((((((((((((((((((((((((-3168 * α7 .^ 7) .* γ7 + ((2688 * α7 .^ 6) .* α8) .* γ7 + (4872 * α7 .^ 6) .* γ7 + ((9024 * α7 .^ 5) .* α8 .^ 2) .* γ7) - ((8544 * α7 .^ 5) .* α8) .* γ7) - (2586 * α7 .^ 5) .* γ7) - ((2400 * α7 .^ 4) .* α8 .^ 3) .* γ7) - ((9480 * α7 .^ 4) .* α8 .^ 2) .* γ7) + ((7710 * α7 .^ 4) .* α8) .* γ7 + (435 * α7 .^ 4) .* γ7) - ((7136 * α7 .^ 3) .* α8 .^ 4) .* γ7) + ((9536 * α7 .^ 3) .* α8 .^ 3) .* γ7 + ((1164 * α7 .^ 3) .* α8 .^ 2) .* γ7) - ((2764 * α7 .^ 3) .* α8) .* γ7) + (64 * α7 .^ 3) .* γ7) - ((576 * α7 .^ 2) .* α8 .^ 5) .* γ7) + ((6072 * α7 .^ 2) .* α8 .^ 4) .* γ7) - ((6612 * α7 .^ 2) .* α8 .^ 3) .* γ7) + ((1362 * α7 .^ 2) .* α8 .^ 2) .* γ7 + ((348 * α7 .^ 2) .* α8) .* γ7) - (27 * α7 .^ 2) .* γ7) + ((1280α7) .* α8 .^ 6) .* γ7) - ((1632α7) .* α8 .^ 5) .* γ7) - ((498α7) .* α8 .^ 4) .* γ7) + ((1268α7) .* α8 .^ 3) .* γ7) - ((408α7) .* α8 .^ 2) .* γ7) + ((6α7) .* α8) .* γ7 + (2α7) .* γ7 + (288 * α8 .^ 7) .* γ7) - (824 * α8 .^ 6) .* γ7) + (822 * α8 .^ 5) .* γ7) - (301 * α8 .^ 4) .* γ7) - (4 * α8 .^ 3) .* γ7) + (21 * α8 .^ 2) .* γ7) - (2α8) .* γ7
end

function constraint15_grad8(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    ((((((((((((((((((((((((((((((384 * α7 .^ 7) .* γ7 + ((3008 * α7 .^ 6) .* α8) .* γ7) - (1424 * α7 .^ 6) .* γ7) - ((1440 * α7 .^ 5) .* α8 .^ 2) .* γ7) - ((3792 * α7 .^ 5) .* α8) .* γ7) + (1542 * α7 .^ 5) .* γ7) - ((7136 * α7 .^ 4) .* α8 .^ 3) .* γ7) + ((7152 * α7 .^ 4) .* α8 .^ 2) .* γ7 + ((582 * α7 .^ 4) .* α8) .* γ7) - (691 * α7 .^ 4) .* γ7) - ((960 * α7 .^ 3) .* α8 .^ 4) .* γ7) + ((8096 * α7 .^ 3) .* α8 .^ 3) .* γ7) - ((6612 * α7 .^ 3) .* α8 .^ 2) .* γ7) + ((908 * α7 .^ 3) .* α8) .* γ7 + (116 * α7 .^ 3) .* γ7 + ((3840 * α7 .^ 2) .* α8 .^ 5) .* γ7) - ((4080 * α7 .^ 2) .* α8 .^ 4) .* γ7) - ((996 * α7 .^ 2) .* α8 .^ 3) .* γ7) + ((1902 * α7 .^ 2) .* α8 .^ 2) .* γ7) - ((408 * α7 .^ 2) .* α8) .* γ7) + (3 * α7 .^ 2) .* γ7 + ((2016α7) .* α8 .^ 6) .* γ7) - ((4944α7) .* α8 .^ 5) .* γ7) + ((4110α7) .* α8 .^ 4) .* γ7) - ((1204α7) .* α8 .^ 3) .* γ7) - ((12α7) .* α8 .^ 2) .* γ7) + ((42α7) .* α8) .* γ7) - (2α7) .* γ7) + (288 * α8 .^ 7) .* γ7) - (1008 * α8 .^ 6) .* γ7) + (1374 * α8 .^ 5) .* γ7) - (915 * α8 .^ 4) .* γ7) + (304 * α8 .^ 3) .* γ7) - (45 * α8 .^ 2) .* γ7) + (2α8) .* γ7
end

function constraint15_grad9(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    0
end

function constraint15_grad10(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    0
end

function constraint15_grad11(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    0
end

function constraint15_grad12(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    0
end

function constraint15_grad13(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    0
end

function constraint15_grad14(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    (((((((((((((((((((((((((((((((((-396 * α5 .^ 8 + (384 * α5 .^ 7) .* α6 + 696 * α5 .^ 7 + (1504 * α5 .^ 6) .* α6 .^ 2) - (1424 * α5 .^ 6) .* α6) - 431 * α5 .^ 6) - (480 * α5 .^ 5) .* α6 .^ 3) - (1896 * α5 .^ 5) .* α6 .^ 2) + (1542 * α5 .^ 5) .* α6 + 87 * α5 .^ 5) - (1784 * α5 .^ 4) .* α6 .^ 4) + (2384 * α5 .^ 4) .* α6 .^ 3 + (291 * α5 .^ 4) .* α6 .^ 2) - (691 * α5 .^ 4) .* α6) + 16 * α5 .^ 4) - (192 * α5 .^ 3) .* α6 .^ 5) + (2024 * α5 .^ 3) .* α6 .^ 4) - (2204 * α5 .^ 3) .* α6 .^ 3) + (454 * α5 .^ 3) .* α6 .^ 2 + (116 * α5 .^ 3) .* α6) - 9 * α5 .^ 3) + (640 * α5 .^ 2) .* α6 .^ 6) - (816 * α5 .^ 2) .* α6 .^ 5) - (249 * α5 .^ 2) .* α6 .^ 4) + (634 * α5 .^ 2) .* α6 .^ 3) - (204 * α5 .^ 2) .* α6 .^ 2) + (3 * α5 .^ 2) .* α6 + α5 .^ 2 + (288α5) .* α6 .^ 7) - (824α5) .* α6 .^ 6) + (822α5) .* α6 .^ 5) - (301α5) .* α6 .^ 4) - (4α5) .* α6 .^ 3) + (21α5) .* α6 .^ 2) - (2α5) .* α6) + 36 * α6 .^ 8) - 144 * α6 .^ 7) + 229 * α6 .^ 6) - 183 * α6 .^ 5) + 76 * α6 .^ 4) - 15 * α6 .^ 3) + α6 .^ 2
end

function constraint15_grad15(α1, α2, α3, α4, α5, α6, α7, α8, γ1, γ2, γ3, γ4, γ5, γ6, γ7)
    (((((((((((((((((((((((((((((((((-396 * α7 .^ 8 + (384 * α7 .^ 7) .* α8 + 696 * α7 .^ 7 + (1504 * α7 .^ 6) .* α8 .^ 2) - (1424 * α7 .^ 6) .* α8) - 431 * α7 .^ 6) - (480 * α7 .^ 5) .* α8 .^ 3) - (1896 * α7 .^ 5) .* α8 .^ 2) + (1542 * α7 .^ 5) .* α8 + 87 * α7 .^ 5) - (1784 * α7 .^ 4) .* α8 .^ 4) + (2384 * α7 .^ 4) .* α8 .^ 3 + (291 * α7 .^ 4) .* α8 .^ 2) - (691 * α7 .^ 4) .* α8) + 16 * α7 .^ 4) - (192 * α7 .^ 3) .* α8 .^ 5) + (2024 * α7 .^ 3) .* α8 .^ 4) - (2204 * α7 .^ 3) .* α8 .^ 3) + (454 * α7 .^ 3) .* α8 .^ 2 + (116 * α7 .^ 3) .* α8) - 9 * α7 .^ 3) + (640 * α7 .^ 2) .* α8 .^ 6) - (816 * α7 .^ 2) .* α8 .^ 5) - (249 * α7 .^ 2) .* α8 .^ 4) + (634 * α7 .^ 2) .* α8 .^ 3) - (204 * α7 .^ 2) .* α8 .^ 2) + (3 * α7 .^ 2) .* α8 + α7 .^ 2 + (288α7) .* α8 .^ 7) - (824α7) .* α8 .^ 6) + (822α7) .* α8 .^ 5) - (301α7) .* α8 .^ 4) - (4α7) .* α8 .^ 3) + (21α7) .* α8 .^ 2) - (2α7) .* α8) + 36 * α8 .^ 8) - 144 * α8 .^ 7) + 229 * α8 .^ 6) - 183 * α8 .^ 5) + 76 * α8 .^ 4) - 15 * α8 .^ 3) + α8 .^ 2
end

constraint15_grad = [constraint15_grad1,constraint15_grad2,constraint15_grad3,constraint15_grad4,constraint15_grad5,constraint15_grad6,constraint15_grad7,constraint15_grad8,constraint15_grad9,constraint15_grad10,constraint15_grad11,constraint15_grad12,constraint15_grad13,constraint15_grad14,constraint15_grad15]

P45_model_j = JuliaModel(FunctionGradient(objective,objective_grad),
	[FunctionGradient(constraint1,constraint1_grad),
	 FunctionGradient(constraint2,constraint2_grad),
	 FunctionGradient(constraint3,constraint3_grad),
	 FunctionGradient(constraint4,constraint4_grad),
	 FunctionGradient(constraint5,constraint5_grad),
	 FunctionGradient(constraint6,constraint6_grad),
	 FunctionGradient(constraint7,constraint7_grad),
	 FunctionGradient(constraint8,constraint8_grad),
	 FunctionGradient(constraint9,constraint9_grad),
	 FunctionGradient(constraint10,constraint10_grad),
	 FunctionGradient(constraint11,constraint11_grad),
	 FunctionGradient(constraint12,constraint12_grad),
	 FunctionGradient(constraint13,constraint13_grad),
	 FunctionGradient(constraint14,constraint14_grad),
	 FunctionGradient(constraint15,constraint15_grad)],
	[0.1, 0.2, 0.1, 0.2, 0.08, 0.21, 0.08, 0.35, 0.022222222222222223, 0.022222222222222223, 0.022222222222222223, 0.022222222222222223, 0.022222222222222223, 0.022222222222222223, 0.022222222222222223],
	Parameter((8,7))
	)
 
